[Survived] BlockStatement
src/api.js:3:39
 const API_URL = "http://localhost:5000";  // your backend server
 
-export async function getCategories() {
-  const response = await fetch(`${API_URL}/categories`);
-  if (!response.ok) throw new Error("Failed to fetch categories");
-  return response.json();
-}
+export async function getCategories() {}
 
 export async function addCategory(newCategory) {

[Survived] ConditionalExpression
src/api.js:5:7
 
 export async function getCategories() {
   const response = await fetch(`${API_URL}/categories`);
-  if (!response.ok) throw new Error("Failed to fetch categories");
+  if (true) throw new Error("Failed to fetch categories");
   return response.json();
 }

[Survived] ConditionalExpression
src/api.js:5:7
 
 export async function getCategories() {
   const response = await fetch(`${API_URL}/categories`);
-  if (!response.ok) throw new Error("Failed to fetch categories");
+  if (false) throw new Error("Failed to fetch categories");
   return response.json();
 }

[Survived] BlockStatement
src/api.js:9:48
   return response.json();
 }
 
-export async function addCategory(newCategory) {
-  const response = await fetch(`${API_URL}/categories`, {
-    method: "POST",
-    headers: { "Content-Type": "application/json" },
-    body: JSON.stringify(newCategory),
-  });
-  if (!response.ok) throw new Error("Failed to add category");
-  return response.json();
-}
+export async function addCategory(newCategory) {}
 

[Survived] StringLiteral
src/api.js:10:32
 }
 
 export async function addCategory(newCategory) {
-  const response = await fetch(`${API_URL}/categories`, {
+  const response = await fetch(``, {
     method: "POST",
     headers: { "Content-Type": "application/json" },

[Survived] BooleanLiteral
src/api.js:15:7
     headers: { "Content-Type": "application/json" },
     body: JSON.stringify(newCategory),
   });
-  if (!response.ok) throw new Error("Failed to add category");
+  if (response.ok) throw new Error("Failed to add category");
   return response.json();
 }

[Timeout] ConditionalExpression
src/api.js:15:7
     headers: { "Content-Type": "application/json" },
     body: JSON.stringify(newCategory),
   });
-  if (!response.ok) throw new Error("Failed to add category");
+  if (true) throw new Error("Failed to add category");
   return response.json();
 }
