[Survived] BlockStatement
src/contexts/AuthContext.tsx:19:19
   const [user, setUser] = useState<User | null>(null);
   const [loading, setLoading] = useState(true);
 
-  useEffect(() => {
-    supabase.auth.getSession().then(({ data: { session } }) => {
-      setUser(session?.user ?? null);
-      setLoading(false);
-    });
-
-    const { data: { subscription } } = supabase.auth.onAuthStateChange((_event, session) => {
-      (async () => {
-        setUser(session?.user ?? null);
-      })();
-    });
-
-    return () => subscription.unsubscribe();
-  }, []);
+  useEffect(() => {}, []);
 
   const signUp = async (email: string, password: string) => {

[Survived] BlockStatement
src/contexts/AuthContext.tsx:20:64
   const [loading, setLoading] = useState(true);
 
   useEffect(() => {
-    supabase.auth.getSession().then(({ data: { session } }) => {
-      setUser(session?.user ?? null);
-      setLoading(false);
-    });
+    supabase.auth.getSession().then(({ data: { session } }) => {});
 
     const { data: { subscription } } = supabase.auth.onAuthStateChange((_event, session) => {

[Survived] OptionalChaining
src/contexts/AuthContext.tsx:21:15
 
   useEffect(() => {
     supabase.auth.getSession().then(({ data: { session } }) => {
-      setUser(session?.user ?? null);
+      setUser(session.user ?? null);
       setLoading(false);
     });

[Survived] LogicalOperator
src/contexts/AuthContext.tsx:21:15
 
   useEffect(() => {
     supabase.auth.getSession().then(({ data: { session } }) => {
-      setUser(session?.user ?? null);
+      setUser(session?.user && null);
       setLoading(false);
     });

[Survived] BooleanLiteral
src/contexts/AuthContext.tsx:22:18
   useEffect(() => {
     supabase.auth.getSession().then(({ data: { session } }) => {
       setUser(session?.user ?? null);
-      setLoading(false);
+      setLoading(true);
     });
 

[Survived] BlockStatement
src/contexts/AuthContext.tsx:25:93
       setLoading(false);
     });
 
-    const { data: { subscription } } = supabase.auth.onAuthStateChange((_event, session) => {
-      (async () => {
-        setUser(session?.user ?? null);
-      })();
-    });
+    const { data: { subscription } } = supabase.auth.onAuthStateChange((_event, session) => {});
 
     return () => subscription.unsubscribe();

[Survived] BlockStatement
src/contexts/AuthContext.tsx:26:20
     });
 
     const { data: { subscription } } = supabase.auth.onAuthStateChange((_event, session) => {
-      (async () => {
-        setUser(session?.user ?? null);
-      })();
+      (async () => {})();
     });
 

[Survived] OptionalChaining
src/contexts/AuthContext.tsx:27:17
 
     const { data: { subscription } } = supabase.auth.onAuthStateChange((_event, session) => {
       (async () => {
-        setUser(session?.user ?? null);
+        setUser(session.user ?? null);
       })();
     });

[Survived] LogicalOperator
src/contexts/AuthContext.tsx:27:17
 
     const { data: { subscription } } = supabase.auth.onAuthStateChange((_event, session) => {
       (async () => {
-        setUser(session?.user ?? null);
+        setUser(session?.user && null);
       })();
     });

[Survived] BlockStatement
src/contexts/AuthContext.tsx:34:61
     return () => subscription.unsubscribe();
   }, []);
 
-  const signUp = async (email: string, password: string) => {
-    const { error } = await supabase.auth.signUp({
-      email,
-      password,
-    });
-    return { error };
-  };
+  const signUp = async (email: string, password: string) => {};
 
   const signIn = async (email: string, password: string) => {

[Survived] ObjectLiteral
src/contexts/AuthContext.tsx:35:50
   }, []);
 
   const signUp = async (email: string, password: string) => {
-    const { error } = await supabase.auth.signUp({
-      email,
-      password,
-    });
+    const { error } = await supabase.auth.signUp({});
     return { error };
   };

[Survived] BlockStatement
src/contexts/AuthContext.tsx:42:61
     return { error };
   };
 
-  const signIn = async (email: string, password: string) => {
-    const { error } = await supabase.auth.signInWithPassword({
-      email,
-      password,
-    });
-    return { error };
-  };
+  const signIn = async (email: string, password: string) => {};
 
   const signOut = async () => {

[Survived] ObjectLiteral
src/contexts/AuthContext.tsx:47:12
       email,
       password,
     });
-    return { error };
+    return {};
   };
 

[Survived] BlockStatement
src/contexts/AuthContext.tsx:50:31
     return { error };
   };
 
-  const signOut = async () => {
-    await supabase.auth.signOut();
-  };
+  const signOut = async () => {};
 
   return (

[Survived] BlockStatement
src/contexts/AuthContext.tsx:61:27
   );
 }
 
-export function useAuth() {
-  const context = useContext(AuthContext);
-  if (context === undefined) {
-    throw new Error('useAuth must be used within an AuthProvider');
-  }
-  return context;
-}
+export function useAuth() {}
 

[Survived] BlockStatement
src/contexts/AuthContext.tsx:63:30
 
 export function useAuth() {
   const context = useContext(AuthContext);
-  if (context === undefined) {
-    throw new Error('useAuth must be used within an AuthProvider');
-  }
+  if (context === undefined) {}
   return context;
 }

[Survived] StringLiteral
src/contexts/AuthContext.tsx:64:21
 export function useAuth() {
   const context = useContext(AuthContext);
   if (context === undefined) {
-    throw new Error('useAuth must be used within an AuthProvider');
+    throw new Error("");
   }
   return context;
