[Survived] BooleanLiteral
src/pages/AuthPage.tsx:6:42
 import { useAuth } from '../contexts/AuthContext';
 
 export function AuthPage() {
-  const [isLogin, setIsLogin] = useState(true);
+  const [isLogin, setIsLogin] = useState(false);
   const [email, setEmail] = useState('');
   const [password, setPassword] = useState('');

[Survived] StringLiteral
src/pages/AuthPage.tsx:7:38
 
 export function AuthPage() {
   const [isLogin, setIsLogin] = useState(true);
-  const [email, setEmail] = useState('');
+  const [email, setEmail] = useState("Stryker was here!");
   const [password, setPassword] = useState('');
   const [confirmPassword, setConfirmPassword] = useState('');

[Survived] StringLiteral
src/pages/AuthPage.tsx:10:38
   const [email, setEmail] = useState('');
   const [password, setPassword] = useState('');
   const [confirmPassword, setConfirmPassword] = useState('');
-  const [error, setError] = useState('');
+  const [error, setError] = useState("Stryker was here!");
   const [loading, setLoading] = useState(false);
   const { signIn, signUp } = useAuth();

[Survived] ConditionalExpression
src/pages/AuthPage.tsx:19:9
     setError('');
     setLoading(true);
 
-    if (!isLogin && password !== confirmPassword) {
+    if (false) {
       setError('Passwords do not match');
       setLoading(false);

[Survived] BooleanLiteral
src/pages/AuthPage.tsx:19:9
     setError('');
     setLoading(true);
 
-    if (!isLogin && password !== confirmPassword) {
+    if (isLogin && password !== confirmPassword) {
       setError('Passwords do not match');
       setLoading(false);

[Survived] BooleanLiteral
src/pages/AuthPage.tsx:21:18
 
     if (!isLogin && password !== confirmPassword) {
       setError('Passwords do not match');
-      setLoading(false);
+      setLoading(true);
       return;
     }

[Survived] ConditionalExpression
src/pages/AuthPage.tsx:25:9
       return;
     }
 
-    if (password.length < 6) {
+    if (true) {
       setError('Password must be at least 6 characters');
       setLoading(false);

[Survived] EqualityOperator
src/pages/AuthPage.tsx:25:9
       return;
     }
 
-    if (password.length < 6) {
+    if (password.length <= 6) {
       setError('Password must be at least 6 characters');
       setLoading(false);

[Survived] StringLiteral
src/pages/AuthPage.tsx:26:16
     }
 
     if (password.length < 6) {
-      setError('Password must be at least 6 characters');
+      setError("");
       setLoading(false);
       return;

[Survived] BooleanLiteral
src/pages/AuthPage.tsx:27:18
 
     if (password.length < 6) {
       setError('Password must be at least 6 characters');
-      setLoading(false);
+      setLoading(true);
       return;
     }

[Survived] BlockStatement
src/pages/AuthPage.tsx:31:9
       return;
     }
 
-    try {
-      if (isLogin) {
-        const { error } = await signIn(email, password);
-        if (error) {
-          setError(error.message);
-        }
-      } else {
-        const { error } = await signUp(email, password);
-        if (error) {
-          setError(error.message);
-        }
-      }
-    } catch (err: any) {
+    try {} catch (err: any) {
       setError(err.message || 'An error occurred');
     } finally {

[Survived] BlockStatement
src/pages/AuthPage.tsx:32:20
     }
 
     try {
-      if (isLogin) {
-        const { error } = await signIn(email, password);
-        if (error) {
-          setError(error.message);
-        }
-      } else {
+      if (isLogin) {} else {
         const { error } = await signUp(email, password);
         if (error) {

[Survived] ConditionalExpression
src/pages/AuthPage.tsx:32:11
     }
 
     try {
-      if (isLogin) {
+      if (false) {
         const { error } = await signIn(email, password);
         if (error) {

[Survived] ConditionalExpression
src/pages/AuthPage.tsx:34:13
     try {
       if (isLogin) {
         const { error } = await signIn(email, password);
-        if (error) {
+        if (true) {
           setError(error.message);
         }

[Survived] BlockStatement
src/pages/AuthPage.tsx:34:20
     try {
       if (isLogin) {
         const { error } = await signIn(email, password);
-        if (error) {
-          setError(error.message);
-        }
+        if (error) {}
       } else {
         const { error } = await signUp(email, password);

[Survived] BlockStatement
src/pages/AuthPage.tsx:37:14
         if (error) {
           setError(error.message);
         }
-      } else {
-        const { error } = await signUp(email, password);
-        if (error) {
-          setError(error.message);
-        }
-      }
+      } else {}
     } catch (err: any) {
       setError(err.message || 'An error occurred');

[Survived] ConditionalExpression
src/pages/AuthPage.tsx:39:13
         }
       } else {
         const { error } = await signUp(email, password);
-        if (error) {
+        if (false) {
           setError(error.message);
         }

[Survived] ConditionalExpression
src/pages/AuthPage.tsx:39:13
         }
       } else {
         const { error } = await signUp(email, password);
-        if (error) {
+        if (true) {
           setError(error.message);
         }

[Survived] BlockStatement
src/pages/AuthPage.tsx:43:24
           setError(error.message);
         }
       }
-    } catch (err: any) {
-      setError(err.message || 'An error occurred');
-    } finally {
+    } catch (err: any) {} finally {
       setLoading(false);
     }

[Survived] LogicalOperator
src/pages/AuthPage.tsx:44:16
         }
       }
     } catch (err: any) {
-      setError(err.message || 'An error occurred');
+      setError(err.message && 'An error occurred');
     } finally {
       setLoading(false);

[Survived] ConditionalExpression
src/pages/AuthPage.tsx:44:16
         }
       }
     } catch (err: any) {
-      setError(err.message || 'An error occurred');
+      setError(false);
     } finally {
       setLoading(false);

[Survived] BlockStatement
src/pages/AuthPage.tsx:45:15
       }
     } catch (err: any) {
       setError(err.message || 'An error occurred');
-    } finally {
-      setLoading(false);
-    }
+    } finally {}
   };
 

[Survived] BlockStatement
src/pages/AuthPage.tsx:65:30
           <div className="flex gap-2 mb-6 bg-gray-100 p-1 rounded-lg">
             <button
               type="button"
-              onClick={() => {
-                setIsLogin(true);
-                setError('');
-              }}
+              onClick={() => {}}
               className={`flex-1 py-2 px-4 rounded-md font-medium transition-all ${
                 isLogin

[Survived] BooleanLiteral
src/pages/AuthPage.tsx:66:28
             <button
               type="button"
               onClick={() => {
-                setIsLogin(true);
+                setIsLogin(false);
                 setError('');
               }}

[Survived] StringLiteral
src/pages/AuthPage.tsx:67:26
               type="button"
               onClick={() => {
                 setIsLogin(true);
-                setError('');
+                setError("Stryker was here!");
               }}
               className={`flex-1 py-2 px-4 rounded-md font-medium transition-all ${

[Survived] StringLiteral
src/pages/AuthPage.tsx:71:21
               }}
               className={`flex-1 py-2 px-4 rounded-md font-medium transition-all ${
                 isLogin
-                  ? 'bg-white text-gray-900 shadow-sm'
+                  ? ""
                   : 'text-gray-600 hover:text-gray-900'
               }`}

[Survived] StringLiteral
src/pages/AuthPage.tsx:72:21
               className={`flex-1 py-2 px-4 rounded-md font-medium transition-all ${
                 isLogin
                   ? 'bg-white text-gray-900 shadow-sm'
-                  : 'text-gray-600 hover:text-gray-900'
+                  : ""
               }`}
             >

[Survived] BlockStatement
src/pages/AuthPage.tsx:79:30
             </button>
             <button
               type="button"
-              onClick={() => {
-                setIsLogin(false);
-                setError('');
-              }}
+              onClick={() => {}}
               className={`flex-1 py-2 px-4 rounded-md font-medium transition-all ${
                 !isLogin

[Survived] BooleanLiteral
src/pages/AuthPage.tsx:80:28
             <button
               type="button"
               onClick={() => {
-                setIsLogin(false);
+                setIsLogin(true);
                 setError('');
               }}

[Survived] BooleanLiteral
src/pages/AuthPage.tsx:84:17
                 setError('');
               }}
               className={`flex-1 py-2 px-4 rounded-md font-medium transition-all ${
-                !isLogin
+                isLogin
                   ? 'bg-white text-gray-900 shadow-sm'
                   : 'text-gray-600 hover:text-gray-900'

[Survived] StringLiteral
src/pages/AuthPage.tsx:85:21
               }}
               className={`flex-1 py-2 px-4 rounded-md font-medium transition-all ${
                 !isLogin
-                  ? 'bg-white text-gray-900 shadow-sm'
+                  ? ""
                   : 'text-gray-600 hover:text-gray-900'
               }`}

[Survived] ConditionalExpression
src/pages/AuthPage.tsx:94:14
           </div>
 
           <form onSubmit={handleSubmit} className="space-y-4">
-            {error && (
-              <div className="bg-red-50 border border-red-200 rounded-lg p-3 flex items-center gap-2 text-red-800">
-                <AlertCircle size={18} />
-                <span className="text-sm">{error}</span>
-              </div>
-            )}
+            {false}
 
             <div>

[Survived] LogicalOperator
src/pages/AuthPage.tsx:94:14
           </div>
 
           <form onSubmit={handleSubmit} className="space-y-4">
-            {error && (
-              <div className="bg-red-50 border border-red-200 rounded-lg p-3 flex items-center gap-2 text-red-800">
-                <AlertCircle size={18} />
-                <span className="text-sm">{error}</span>
-              </div>
-            )}
+            {error || <div className="bg-red-50 border border-red-200 rounded-lg p-3 flex items-center gap-2 text-red-800">
+                <AlertCircle size={18} />
+                <span className="text-sm">{error}</span>
+              </div>}
 
             <div>

[Survived] ConditionalExpression
src/pages/AuthPage.tsx:141:14
               </div>
             </div>
 
-            {!isLogin && (
-              <div>
-                <label className="block text-sm font-medium text-gray-700 mb-2">
-                  Confirm Password
-                </label>
-                <div className="relative">
-                  <Lock
-                    size={20}
-                    className="absolute left-3 top-1/2 -translate-y-1/2 text-gray-400"
-                  />
-                  <input
-                    type="password"
-                    value={confirmPassword}
-                    onChange={(e) => setConfirmPassword(e.target.value)}
-                    placeholder="••••••••"
-                    className="w-full pl-10 pr-4 py-3 border border-gray-300 rounded-lg focus:ring-2 focus:ring-orange-500 focus:border-transparent"
-                    required
-                  />
-                </div>
-              </div>
-            )}
+            {false}
 
             <button

[Survived] BooleanLiteral
src/pages/AuthPage.tsx:141:14
               </div>
             </div>
 
-            {!isLogin && (
+            {isLogin && (
               <div>
                 <label className="block text-sm font-medium text-gray-700 mb-2">

[Survived] ArrowFunction
src/pages/AuthPage.tsx:154:31
                   <input
                     type="password"
                     value={confirmPassword}
-                    onChange={(e) => setConfirmPassword(e.target.value)}
+                    onChange={() => undefined}
                     placeholder="••••••••"
                     className="w-full pl-10 pr-4 py-3 border border-gray-300 rounded-lg focus:ring-2 focus:ring-orange-500 focus:border-transparent"

[Survived] StringLiteral
src/pages/AuthPage.tsx:168:65
               disabled={loading}
               className="w-full py-3 bg-orange-500 text-white rounded-lg font-semibold hover:bg-orange-600 transition-colors disabled:opacity-50 disabled:cursor-not-allowed shadow-lg hover:shadow-xl"
             >
-              {loading ? 'Please wait...' : isLogin ? 'Login' : 'Create Account'}
+              {loading ? 'Please wait...' : isLogin ? 'Login' : ""}
             </button>
           </form>

[Survived] StringLiteral
src/pages/AuthPage.tsx:168:55
               disabled={loading}
               className="w-full py-3 bg-orange-500 text-white rounded-lg font-semibold hover:bg-orange-600 transition-colors disabled:opacity-50 disabled:cursor-not-allowed shadow-lg hover:shadow-xl"
             >
-              {loading ? 'Please wait...' : isLogin ? 'Login' : 'Create Account'}
+              {loading ? 'Please wait...' : isLogin ? "" : 'Create Account'}
             </button>
           </form>

[Survived] BlockStatement
src/pages/AuthPage.tsx:177:34
               <p>
                 Don't have an account?{' '}
                 <button
-                  onClick={() => {
-                    setIsLogin(false);
-                    setError('');
-                  }}
+                  onClick={() => {}}
                   className="text-orange-500 font-medium hover:text-orange-600"
                 >

[Timeout] StringLiteral
src/pages/AuthPage.tsx:188:42
               </p>
             ) : (
               <p>
-                Already have an account?{' '}
+                Already have an account?{""}
                 <button
                   onClick={() => {

[Timeout] BlockStatement
src/pages/AuthPage.tsx:190:34
               <p>
                 Already have an account?{' '}
                 <button
-                  onClick={() => {
-                    setIsLogin(true);
-                    setError('');
-                  }}
+                  onClick={() => {}}
                   className="text-orange-500 font-medium hover:text-orange-600"
                 >
