[Timeout] BlockStatement
src/App.tsx:7:16
 import { DashboardPage } from './pages/DashboardPage';
 import { AnalysisPage } from './pages/AnalysisPage';
 
-function App() {
-  const { user, loading } = useAuth();
-  const [currentPage, setCurrentPage] = useState<'dashboard' | 'analysis'>('dashboard');
-
-  if (loading) {
-    return (
-      <div className="min-h-screen bg-gradient-to-br from-gray-50 to-gray-100 flex items-center justify-center">
-        <div className="text-gray-500">Loading...</div>
-      </div>
-    );
-  }
-
-  if (!user) {
-    return <AuthPage />;
-  }
-
-  if (currentPage === 'analysis') {
-    return <AnalysisPage onNavigateBack={() => setCurrentPage('dashboard')} />;
-  }
-
-  return <DashboardPage onNavigateToAnalysis={() => setCurrentPage('analysis')} />;
-}
+function App() {}
 
 export default App;

[Timeout] BlockStatement
src/App.tsx:11:16
   const { user, loading } = useAuth();
   const [currentPage, setCurrentPage] = useState<'dashboard' | 'analysis'>('dashboard');
 
-  if (loading) {
-    return (
-      <div className="min-h-screen bg-gradient-to-br from-gray-50 to-gray-100 flex items-center justify-center">
-        <div className="text-gray-500">Loading...</div>
-      </div>
-    );
-  }
+  if (loading) {}
 
   if (!user) {

[Timeout] BlockStatement
src/App.tsx:19:14
     );
   }
 
-  if (!user) {
-    return <AuthPage />;
-  }
+  if (!user) {}
 
   if (currentPage === 'analysis') {

[Timeout] EqualityOperator
src/App.tsx:23:7
     return <AuthPage />;
   }
 
-  if (currentPage === 'analysis') {
+  if (currentPage !== 'analysis') {
     return <AnalysisPage onNavigateBack={() => setCurrentPage('dashboard')} />;
   }

[Timeout] ConditionalExpression
src/App.tsx:23:7
     return <AuthPage />;
   }
 
-  if (currentPage === 'analysis') {
+  if (true) {
     return <AnalysisPage onNavigateBack={() => setCurrentPage('dashboard')} />;
   }

[Timeout] ArrowFunction
src/App.tsx:24:42
   }
 
   if (currentPage === 'analysis') {
-    return <AnalysisPage onNavigateBack={() => setCurrentPage('dashboard')} />;
+    return <AnalysisPage onNavigateBack={() => undefined} />;
   }
 

[Timeout] StringLiteral
src/App.tsx:24:63
   }
 
   if (currentPage === 'analysis') {
-    return <AnalysisPage onNavigateBack={() => setCurrentPage('dashboard')} />;
+    return <AnalysisPage onNavigateBack={() => setCurrentPage("")} />;
   }
 

[Timeout] ArrowFunction
src/App.tsx:27:47
     return <AnalysisPage onNavigateBack={() => setCurrentPage('dashboard')} />;
   }
 
-  return <DashboardPage onNavigateToAnalysis={() => setCurrentPage('analysis')} />;
+  return <DashboardPage onNavigateToAnalysis={() => undefined} />;
 }
 
