[Timeout] StringLiteral
src/components/AddCategoryModal.tsx:11:19
 }
 
 const AVAILABLE_ICONS = [
-  'ShoppingCart', 'Home', 'Car', 'Film', 'Zap', 'Coffee', 'Heart',
+  'ShoppingCart', "", 'Car', 'Film', 'Zap', 'Coffee', 'Heart',
   'Book', 'Smartphone', 'Plane', 'Music', 'Utensils', 'Gift', 'Briefcase'
 ];

[Timeout] StringLiteral
src/components/AddCategoryModal.tsx:11:59
 }
 
 const AVAILABLE_ICONS = [
-  'ShoppingCart', 'Home', 'Car', 'Film', 'Zap', 'Coffee', 'Heart',
+  'ShoppingCart', 'Home', 'Car', 'Film', 'Zap', 'Coffee', "",
   'Book', 'Smartphone', 'Plane', 'Music', 'Utensils', 'Gift', 'Briefcase'
 ];

[Timeout] StringLiteral
src/components/AddCategoryModal.tsx:12:63
 
 const AVAILABLE_ICONS = [
   'ShoppingCart', 'Home', 'Car', 'Film', 'Zap', 'Coffee', 'Heart',
-  'Book', 'Smartphone', 'Plane', 'Music', 'Utensils', 'Gift', 'Briefcase'
+  'Book', 'Smartphone', 'Plane', 'Music', 'Utensils', 'Gift', ""
 ];
 

[Timeout] StringLiteral
src/components/AddCategoryModal.tsx:16:3
 ];
 
 const AVAILABLE_COLORS = [
-  '#10b981', '#f59e0b', '#3b82f6', '#ec4899', '#8b5cf6',
+  "", '#f59e0b', '#3b82f6', '#ec4899', '#8b5cf6',
   '#ef4444', '#14b8a6', '#f97316', '#06b6d4', '#a855f7'
 ];

[Timeout] StringLiteral
src/components/AddCategoryModal.tsx:16:36
 ];
 
 const AVAILABLE_COLORS = [
-  '#10b981', '#f59e0b', '#3b82f6', '#ec4899', '#8b5cf6',
+  '#10b981', '#f59e0b', '#3b82f6', "", '#8b5cf6',
   '#ef4444', '#14b8a6', '#f97316', '#06b6d4', '#a855f7'
 ];

[Timeout] StringLiteral
src/components/AddCategoryModal.tsx:17:14
 
 const AVAILABLE_COLORS = [
   '#10b981', '#f59e0b', '#3b82f6', '#ec4899', '#8b5cf6',
-  '#ef4444', '#14b8a6', '#f97316', '#06b6d4', '#a855f7'
+  '#ef4444', "", '#f97316', '#06b6d4', '#a855f7'
 ];
 

[Timeout] StringLiteral
src/components/AddCategoryModal.tsx:17:25
 
 const AVAILABLE_COLORS = [
   '#10b981', '#f59e0b', '#3b82f6', '#ec4899', '#8b5cf6',
-  '#ef4444', '#14b8a6', '#f97316', '#06b6d4', '#a855f7'
+  '#ef4444', '#14b8a6', "", '#06b6d4', '#a855f7'
 ];
 

[Timeout] StringLiteral
src/components/AddCategoryModal.tsx:22:40
 
 export function AddCategoryModal({ onClose, onAdd }: AddCategoryModalProps) {
   const [name, setName] = useState('');
-  const [budget, setBudget] = useState('');
+  const [budget, setBudget] = useState("Stryker was here!");
   const [selectedColor, setSelectedColor] = useState(AVAILABLE_COLORS[0]);
   const [selectedIcon, setSelectedIcon] = useState(AVAILABLE_ICONS[0]);

[Timeout] BlockStatement
src/components/AddCategoryModal.tsx:26:48
   const [selectedColor, setSelectedColor] = useState(AVAILABLE_COLORS[0]);
   const [selectedIcon, setSelectedIcon] = useState(AVAILABLE_ICONS[0]);
 
-  const handleSubmit = (e: React.FormEvent) => {
-    e.preventDefault();
-    const budgetAmount = parseFloat(budget);
-    if (name && !isNaN(budgetAmount) && budgetAmount > 0) {
-      onAdd(name, budgetAmount, selectedColor, selectedIcon);
-      onClose();
-    }
-  };
+  const handleSubmit = (e: React.FormEvent) => {};
 
   return (

[Survived] BooleanLiteral
src/components/AddCategoryModal.tsx:29:17
   const handleSubmit = (e: React.FormEvent) => {
     e.preventDefault();
     const budgetAmount = parseFloat(budget);
-    if (name && !isNaN(budgetAmount) && budgetAmount > 0) {
+    if (name && isNaN(budgetAmount) && budgetAmount > 0) {
       onAdd(name, budgetAmount, selectedColor, selectedIcon);
       onClose();

[Survived] LogicalOperator
src/components/AddCategoryModal.tsx:29:9
   const handleSubmit = (e: React.FormEvent) => {
     e.preventDefault();
     const budgetAmount = parseFloat(budget);
-    if (name && !isNaN(budgetAmount) && budgetAmount > 0) {
+    if (name || !isNaN(budgetAmount) && budgetAmount > 0) {
       onAdd(name, budgetAmount, selectedColor, selectedIcon);
       onClose();

[Survived] ArrowFunction
src/components/AddCategoryModal.tsx:72:27
               <input
                 type="number"
                 value={budget}
-                onChange={(e) => setBudget(e.target.value)}
+                onChange={() => undefined}
                 placeholder="0.00"
                 step="0.01"

[Timeout] BlockStatement
src/components/AddCategoryModal.tsx:86:50
               Choose Icon
             </label>
             <div className="grid grid-cols-7 gap-2">
-              {AVAILABLE_ICONS.map((iconName) => {
-                const IconComponent = (Icons as any)[iconName];
-                return (
-                  <button
-                    key={iconName}
-                    type="button"
-                    onClick={() => setSelectedIcon(iconName)}
-                    className={`p-2 rounded-lg border-2 transition-all ${
-                      selectedIcon === iconName
-                        ? 'border-orange-500 bg-orange-50'
-                        : 'border-gray-200 hover:border-gray-300'
-                    }`}
-                  >
-                    <IconComponent size={20} />
-                  </button>
-                );
-              })}
+              {AVAILABLE_ICONS.map((iconName) => {})}
             </div>
           </div>

[Timeout] ArrowFunction
src/components/AddCategoryModal.tsx:92:30
                   <button
                     key={iconName}
                     type="button"
-                    onClick={() => setSelectedIcon(iconName)}
+                    onClick={() => undefined}
                     className={`p-2 rounded-lg border-2 transition-all ${
                       selectedIcon === iconName

[Timeout] StringLiteral
src/components/AddCategoryModal.tsx:93:32
                     key={iconName}
                     type="button"
                     onClick={() => setSelectedIcon(iconName)}
-                    className={`p-2 rounded-lg border-2 transition-all ${
-                      selectedIcon === iconName
-                        ? 'border-orange-500 bg-orange-50'
-                        : 'border-gray-200 hover:border-gray-300'
-                    }`}
+                    className={``}
                   >
                     <IconComponent size={20} />

[Timeout] EqualityOperator
src/components/AddCategoryModal.tsx:94:23
                     type="button"
                     onClick={() => setSelectedIcon(iconName)}
                     className={`p-2 rounded-lg border-2 transition-all ${
-                      selectedIcon === iconName
+                      selectedIcon !== iconName
                         ? 'border-orange-500 bg-orange-50'
                         : 'border-gray-200 hover:border-gray-300'

[Timeout] ConditionalExpression
src/components/AddCategoryModal.tsx:94:23
                     type="button"
                     onClick={() => setSelectedIcon(iconName)}
                     className={`p-2 rounded-lg border-2 transition-all ${
-                      selectedIcon === iconName
+                      false
                         ? 'border-orange-500 bg-orange-50'
                         : 'border-gray-200 hover:border-gray-300'

[Timeout] ArrowFunction
src/components/AddCategoryModal.tsx:111:37
               Choose Color
             </label>
             <div className="grid grid-cols-10 gap-2">
-              {AVAILABLE_COLORS.map((color) => (
-                <button
-                  key={color}
-                  type="button"
-                  onClick={() => setSelectedColor(color)}
-                  className={`w-8 h-8 rounded-lg border-2 transition-all ${
-                    selectedColor === color
-                      ? 'border-gray-900 scale-110'
-                      : 'border-transparent hover:scale-105'
-                  }`}
-                  style={{ backgroundColor: color }}
-                />
-              ))}
+              {AVAILABLE_COLORS.map(() => undefined)}
             </div>
           </div>

[Timeout] ArrowFunction
src/components/AddCategoryModal.tsx:115:28
                 <button
                   key={color}
                   type="button"
-                  onClick={() => setSelectedColor(color)}
+                  onClick={() => undefined}
                   className={`w-8 h-8 rounded-lg border-2 transition-all ${
                     selectedColor === color

[Timeout] ConditionalExpression
src/components/AddCategoryModal.tsx:117:21
                   type="button"
                   onClick={() => setSelectedColor(color)}
                   className={`w-8 h-8 rounded-lg border-2 transition-all ${
-                    selectedColor === color
+                    false
                       ? 'border-gray-900 scale-110'
                       : 'border-transparent hover:scale-105'

[Timeout] ConditionalExpression
src/components/AddCategoryModal.tsx:117:21
                   type="button"
                   onClick={() => setSelectedColor(color)}
                   className={`w-8 h-8 rounded-lg border-2 transition-all ${
-                    selectedColor === color
+                    true
                       ? 'border-gray-900 scale-110'
                       : 'border-transparent hover:scale-105'

[Timeout] ObjectLiteral
src/components/AddCategoryModal.tsx:121:26
                       ? 'border-gray-900 scale-110'
                       : 'border-transparent hover:scale-105'
                   }`}
-                  style={{ backgroundColor: color }}
+                  style={{}}
                 />
               ))}
