[Timeout] OptionalChaining
src/components/AddTransactionModal.tsx:12:48
 }
 
 export function AddTransactionModal({ categories, onClose, onAdd }: AddTransactionModalProps) {
-  const [categoryId, setCategoryId] = useState(categories[0]?.id || '');
+  const [categoryId, setCategoryId] = useState(categories[0].id || '');
   const [amount, setAmount] = useState('');
   const [description, setDescription] = useState('');

[Timeout] ConditionalExpression
src/components/AddTransactionModal.tsx:12:48
 }
 
 export function AddTransactionModal({ categories, onClose, onAdd }: AddTransactionModalProps) {
-  const [categoryId, setCategoryId] = useState(categories[0]?.id || '');
+  const [categoryId, setCategoryId] = useState(true);
   const [amount, setAmount] = useState('');
   const [description, setDescription] = useState('');

[Timeout] StringLiteral
src/components/AddTransactionModal.tsx:13:40
 
 export function AddTransactionModal({ categories, onClose, onAdd }: AddTransactionModalProps) {
   const [categoryId, setCategoryId] = useState(categories[0]?.id || '');
-  const [amount, setAmount] = useState('');
+  const [amount, setAmount] = useState("Stryker was here!");
   const [description, setDescription] = useState('');
   const [date, setDate] = useState(new Date().toISOString().split('T')[0]);

[Timeout] StringLiteral
src/components/AddTransactionModal.tsx:14:50
 export function AddTransactionModal({ categories, onClose, onAdd }: AddTransactionModalProps) {
   const [categoryId, setCategoryId] = useState(categories[0]?.id || '');
   const [amount, setAmount] = useState('');
-  const [description, setDescription] = useState('');
+  const [description, setDescription] = useState("Stryker was here!");
   const [date, setDate] = useState(new Date().toISOString().split('T')[0]);
 

[Timeout] BlockStatement
src/components/AddTransactionModal.tsx:17:48
   const [description, setDescription] = useState('');
   const [date, setDate] = useState(new Date().toISOString().split('T')[0]);
 
-  const handleSubmit = (e: React.FormEvent) => {
-    e.preventDefault();
-    const amountValue = parseFloat(amount);
-    if (categoryId && !isNaN(amountValue) && amountValue > 0 && description) {
-      onAdd(categoryId, amountValue, description, date);
-      onClose();
-    }
-  };
+  const handleSubmit = (e: React.FormEvent) => {};
 
   return (

[Timeout] EqualityOperator
src/components/AddTransactionModal.tsx:20:46
   const handleSubmit = (e: React.FormEvent) => {
     e.preventDefault();
     const amountValue = parseFloat(amount);
-    if (categoryId && !isNaN(amountValue) && amountValue > 0 && description) {
+    if (categoryId && !isNaN(amountValue) && amountValue <= 0 && description) {
       onAdd(categoryId, amountValue, description, date);
       onClose();

[Timeout] EqualityOperator
src/components/AddTransactionModal.tsx:20:46
   const handleSubmit = (e: React.FormEvent) => {
     e.preventDefault();
     const amountValue = parseFloat(amount);
-    if (categoryId && !isNaN(amountValue) && amountValue > 0 && description) {
+    if (categoryId && !isNaN(amountValue) && amountValue >= 0 && description) {
       onAdd(categoryId, amountValue, description, date);
       onClose();

[Timeout] ArrowFunction
src/components/AddTransactionModal.tsx:46:25
             </label>
             <select
               value={categoryId}
-              onChange={(e) => setCategoryId(e.target.value)}
+              onChange={() => undefined}
               className="w-full px-4 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-orange-500 focus:border-transparent"
               required

[Timeout] ArrowFunction
src/components/AddTransactionModal.tsx:50:31
               className="w-full px-4 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-orange-500 focus:border-transparent"
               required
             >
-              {categories.map((category) => (
-                <option key={category.id} value={category.id}>
-                  {category.name}
-                </option>
-              ))}
+              {categories.map(() => undefined)}
             </select>
           </div>

[Timeout] ArrowFunction
src/components/AddTransactionModal.tsx:67:27
               <input
                 type="number"
                 value={amount}
-                onChange={(e) => setAmount(e.target.value)}
+                onChange={() => undefined}
                 placeholder="0.00"
                 step="0.01"

[Survived] ArrowFunction
src/components/AddTransactionModal.tsx:97:25
             <input
               type="date"
               value={date}
-              onChange={(e) => setDate(e.target.value)}
+              onChange={() => undefined}
               className="w-full px-4 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-orange-500 focus:border-transparent"
               required
