[Survived] BooleanLiteral
src/components/BudgetCard.tsx:13:46
 }
 
 export function BudgetCard({ category, spent, onUpdate, onDelete }: BudgetCardProps) {
-  const [isEditing, setIsEditing] = useState(false);
+  const [isEditing, setIsEditing] = useState(true);
   const [newAmount, setNewAmount] = useState(category.budget_amount.toString());
 

[Survived] ArithmeticOperator
src/components/BudgetCard.tsx:16:21
   const [isEditing, setIsEditing] = useState(false);
   const [newAmount, setNewAmount] = useState(category.budget_amount.toString());
 
-  const remaining = category.budget_amount - spent;
+  const remaining = category.budget_amount + spent;
   const percentUsed = (spent / category.budget_amount) * 100;
 

[Survived] ArithmeticOperator
src/components/BudgetCard.tsx:17:23
   const [newAmount, setNewAmount] = useState(category.budget_amount.toString());
 
   const remaining = category.budget_amount - spent;
-  const percentUsed = (spent / category.budget_amount) * 100;
+  const percentUsed = spent / category.budget_amount / 100;
 
   const Icon = (Icons as any)[category.icon] || Icons.DollarSign;

[Survived] ArithmeticOperator
src/components/BudgetCard.tsx:17:24
   const [newAmount, setNewAmount] = useState(category.budget_amount.toString());
 
   const remaining = category.budget_amount - spent;
-  const percentUsed = (spent / category.budget_amount) * 100;
+  const percentUsed = (spent * category.budget_amount) * 100;
 
   const Icon = (Icons as any)[category.icon] || Icons.DollarSign;

[Survived] ConditionalExpression
src/components/BudgetCard.tsx:19:16
   const remaining = category.budget_amount - spent;
   const percentUsed = (spent / category.budget_amount) * 100;
 
-  const Icon = (Icons as any)[category.icon] || Icons.DollarSign;
+  const Icon = false;
 
   const handleSave = () => {

[Survived] LogicalOperator
src/components/BudgetCard.tsx:19:16
   const remaining = category.budget_amount - spent;
   const percentUsed = (spent / category.budget_amount) * 100;
 
-  const Icon = (Icons as any)[category.icon] || Icons.DollarSign;
+  const Icon = (Icons as any)[category.icon] && Icons.DollarSign;
 
   const handleSave = () => {

[Survived] BlockStatement
src/components/BudgetCard.tsx:21:28
 
   const Icon = (Icons as any)[category.icon] || Icons.DollarSign;
 
-  const handleSave = () => {
-    const amount = parseFloat(newAmount);
-    if (!isNaN(amount) && amount > 0) {
-      onUpdate(category.id, amount);
-      setIsEditing(false);
-    }
-  };
+  const handleSave = () => {};
 
   return (

[Survived] ConditionalExpression
src/components/BudgetCard.tsx:23:27
 
   const handleSave = () => {
     const amount = parseFloat(newAmount);
-    if (!isNaN(amount) && amount > 0) {
+    if (!isNaN(amount) && true) {
       onUpdate(category.id, amount);
       setIsEditing(false);

[Survived] BlockStatement
src/components/BudgetCard.tsx:23:39
 
   const handleSave = () => {
     const amount = parseFloat(newAmount);
-    if (!isNaN(amount) && amount > 0) {
-      onUpdate(category.id, amount);
-      setIsEditing(false);
-    }
+    if (!isNaN(amount) && amount > 0) {}
   };
 

[Survived] BooleanLiteral
src/components/BudgetCard.tsx:25:20
     const amount = parseFloat(newAmount);
     if (!isNaN(amount) && amount > 0) {
       onUpdate(category.id, amount);
-      setIsEditing(false);
+      setIsEditing(true);
     }
   };

[Survived] ArrowFunction
src/components/BudgetCard.tsx:45:20
           </div>
         </div>
         <button
-          onClick={() => onDelete(category.id)}
+          onClick={() => undefined}
           className="text-gray-400 hover:text-red-500 transition-colors"
         >

[Survived] ArrowFunction
src/components/BudgetCard.tsx:59:27
               <input
                 type="number"
                 value={newAmount}
-                onChange={(e) => setNewAmount(e.target.value)}
+                onChange={() => undefined}
                 className="w-24 px-2 py-1 border border-gray-300 rounded text-lg font-bold"
                 autoFocus

[Survived] BooleanLiteral
src/components/BudgetCard.tsx:66:51
               <button onClick={handleSave} className="text-green-600 hover:text-green-700">
                 <Icons.Check size={20} />
               </button>
-              <button onClick={() => setIsEditing(false)} className="text-gray-400 hover:text-gray-600">
+              <button onClick={() => setIsEditing(true)} className="text-gray-400 hover:text-gray-600">
                 <Icons.X size={20} />
               </button>

[Survived] ArrowFunction
src/components/BudgetCard.tsx:66:32
               <button onClick={handleSave} className="text-green-600 hover:text-green-700">
                 <Icons.Check size={20} />
               </button>
-              <button onClick={() => setIsEditing(false)} className="text-gray-400 hover:text-gray-600">
+              <button onClick={() => undefined} className="text-gray-400 hover:text-gray-600">
                 <Icons.X size={20} />
               </button>

[Survived] ArrowFunction
src/components/BudgetCard.tsx:76:26
                 ${category.budget_amount.toFixed(2)}
               </span>
               <button
-                onClick={() => setIsEditing(true)}
+                onClick={() => undefined}
                 className="text-gray-400 hover:text-gray-600 transition-colors"
               >

[Survived] BooleanLiteral
src/components/BudgetCard.tsx:76:45
                 ${category.budget_amount.toFixed(2)}
               </span>
               <button
-                onClick={() => setIsEditing(true)}
+                onClick={() => setIsEditing(false)}
                 className="text-gray-400 hover:text-gray-600 transition-colors"
               >

[Survived] MethodExpression
src/components/BudgetCard.tsx:89:25
           <div
             className="h-full rounded-full transition-all duration-300"
             style={{
-              width: `${Math.min(percentUsed, 100)}%`,
+              width: `${Math.max(percentUsed, 100)}%`,
               backgroundColor: percentUsed > 100 ? '#ef4444' : category.color,
             }}

[Survived] StringLiteral
src/components/BudgetCard.tsx:89:22
           <div
             className="h-full rounded-full transition-all duration-300"
             style={{
-              width: `${Math.min(percentUsed, 100)}%`,
+              width: ``,
               backgroundColor: percentUsed > 100 ? '#ef4444' : category.color,
             }}

[Survived] ConditionalExpression
src/components/BudgetCard.tsx:90:32
             className="h-full rounded-full transition-all duration-300"
             style={{
               width: `${Math.min(percentUsed, 100)}%`,
-              backgroundColor: percentUsed > 100 ? '#ef4444' : category.color,
+              backgroundColor: true ? '#ef4444' : category.color,
             }}
           />

[Survived] EqualityOperator
src/components/BudgetCard.tsx:90:32
             className="h-full rounded-full transition-all duration-300"
             style={{
               width: `${Math.min(percentUsed, 100)}%`,
-              backgroundColor: percentUsed > 100 ? '#ef4444' : category.color,
+              backgroundColor: percentUsed >= 100 ? '#ef4444' : category.color,
             }}
           />

[Survived] EqualityOperator
src/components/BudgetCard.tsx:99:45
           <span className="text-gray-600">
             Spent: <span className="font-semibold text-gray-900">${spent.toFixed(2)}</span>
           </span>
-          <span className={`font-semibold ${remaining >= 0 ? 'text-green-600' : 'text-red-600'}`}>
+          <span className={`font-semibold ${remaining < 0 ? 'text-green-600' : 'text-red-600'}`}>
             {remaining >= 0 ? 'Left: ' : 'Over: '}${Math.abs(remaining).toFixed(2)}
           </span>

[Survived] ConditionalExpression
src/components/BudgetCard.tsx:99:45
           <span className="text-gray-600">
             Spent: <span className="font-semibold text-gray-900">${spent.toFixed(2)}</span>
           </span>
-          <span className={`font-semibold ${remaining >= 0 ? 'text-green-600' : 'text-red-600'}`}>
+          <span className={`font-semibold ${false ? 'text-green-600' : 'text-red-600'}`}>
             {remaining >= 0 ? 'Left: ' : 'Over: '}${Math.abs(remaining).toFixed(2)}
           </span>

[Survived] EqualityOperator
src/components/BudgetCard.tsx:100:14
             Spent: <span className="font-semibold text-gray-900">${spent.toFixed(2)}</span>
           </span>
           <span className={`font-semibold ${remaining >= 0 ? 'text-green-600' : 'text-red-600'}`}>
-            {remaining >= 0 ? 'Left: ' : 'Over: '}${Math.abs(remaining).toFixed(2)}
+            {remaining > 0 ? 'Left: ' : 'Over: '}${Math.abs(remaining).toFixed(2)}
           </span>
         </div>

[Survived] ConditionalExpression
src/components/BudgetCard.tsx:100:14
             Spent: <span className="font-semibold text-gray-900">${spent.toFixed(2)}</span>
           </span>
           <span className={`font-semibold ${remaining >= 0 ? 'text-green-600' : 'text-red-600'}`}>
-            {remaining >= 0 ? 'Left: ' : 'Over: '}${Math.abs(remaining).toFixed(2)}
+            {true ? 'Left: ' : 'Over: '}${Math.abs(remaining).toFixed(2)}
           </span>
         </div>
