[Survived] ArithmeticOperator
src/components/BudgetSummary.tsx:9:21
 }
 
 export function BudgetSummary({ totalBudget, totalSpent }: BudgetSummaryProps) {
-  const remaining = totalBudget - totalSpent;
+  const remaining = totalBudget + totalSpent;
   const percentUsed = totalBudget > 0 ? (totalSpent / totalBudget) * 100 : 0;
 

[Survived] ArithmeticOperator
src/components/BudgetSummary.tsx:10:41
 
 export function BudgetSummary({ totalBudget, totalSpent }: BudgetSummaryProps) {
   const remaining = totalBudget - totalSpent;
-  const percentUsed = totalBudget > 0 ? (totalSpent / totalBudget) * 100 : 0;
+  const percentUsed = totalBudget > 0 ? totalSpent / totalBudget / 100 : 0;
 
   return (

[Survived] ConditionalExpression
src/components/BudgetSummary.tsx:10:23
 
 export function BudgetSummary({ totalBudget, totalSpent }: BudgetSummaryProps) {
   const remaining = totalBudget - totalSpent;
-  const percentUsed = totalBudget > 0 ? (totalSpent / totalBudget) * 100 : 0;
+  const percentUsed = true ? (totalSpent / totalBudget) * 100 : 0;
 
   return (

[Survived] ConditionalExpression
src/components/BudgetSummary.tsx:41:9
       </div>
 
       <div className={`bg-gradient-to-br ${
-        remaining >= 0 ? 'from-green-500 to-green-600' : 'from-red-500 to-red-600'
+        true ? 'from-green-500 to-green-600' : 'from-red-500 to-red-600'
       } rounded-xl shadow-lg p-6 text-white`}>
         <div className="flex items-center justify-between mb-4">

[Survived] EqualityOperator
src/components/BudgetSummary.tsx:41:9
       </div>
 
       <div className={`bg-gradient-to-br ${
-        remaining >= 0 ? 'from-green-500 to-green-600' : 'from-red-500 to-red-600'
+        remaining < 0 ? 'from-green-500 to-green-600' : 'from-red-500 to-red-600'
       } rounded-xl shadow-lg p-6 text-white`}>
         <div className="flex items-center justify-between mb-4">

[Survived] ConditionalExpression
src/components/BudgetSummary.tsx:45:14
       } rounded-xl shadow-lg p-6 text-white`}>
         <div className="flex items-center justify-between mb-4">
           <div className="p-3 bg-white/20 rounded-lg">
-            {remaining >= 0 ? <TrendingUp size={24} /> : <DollarSign size={24} />}
+            {true ? <TrendingUp size={24} /> : <DollarSign size={24} />}
           </div>
           <span className="text-sm font-medium bg-white/20 px-3 py-1 rounded-full">

[Survived] EqualityOperator
src/components/BudgetSummary.tsx:45:14
       } rounded-xl shadow-lg p-6 text-white`}>
         <div className="flex items-center justify-between mb-4">
           <div className="p-3 bg-white/20 rounded-lg">
-            {remaining >= 0 ? <TrendingUp size={24} /> : <DollarSign size={24} />}
+            {remaining > 0 ? <TrendingUp size={24} /> : <DollarSign size={24} />}
           </div>
           <span className="text-sm font-medium bg-white/20 px-3 py-1 rounded-full">

[Survived] EqualityOperator
src/components/BudgetSummary.tsx:48:14
             {remaining >= 0 ? <TrendingUp size={24} /> : <DollarSign size={24} />}
           </div>
           <span className="text-sm font-medium bg-white/20 px-3 py-1 rounded-full">
-            {remaining >= 0 ? 'Remaining' : 'Over Budget'}
+            {remaining < 0 ? 'Remaining' : 'Over Budget'}
           </span>
         </div>

[Survived] EqualityOperator
src/components/BudgetSummary.tsx:48:14
             {remaining >= 0 ? <TrendingUp size={24} /> : <DollarSign size={24} />}
           </div>
           <span className="text-sm font-medium bg-white/20 px-3 py-1 rounded-full">
-            {remaining >= 0 ? 'Remaining' : 'Over Budget'}
+            {remaining > 0 ? 'Remaining' : 'Over Budget'}
           </span>
         </div>

[Survived] ConditionalExpression
src/components/BudgetSummary.tsx:52:34
           </span>
         </div>
         <p className="text-3xl font-bold mb-1">${Math.abs(remaining).toFixed(2)}</p>
-        <p className={`text-sm ${remaining >= 0 ? 'text-green-100' : 'text-red-100'}`}>
+        <p className={`text-sm ${true ? 'text-green-100' : 'text-red-100'}`}>
           {remaining >= 0 ? 'Available to spend' : 'Budget exceeded'}
         </p>

[Survived] ConditionalExpression
src/components/BudgetSummary.tsx:52:34
           </span>
         </div>
         <p className="text-3xl font-bold mb-1">${Math.abs(remaining).toFixed(2)}</p>
-        <p className={`text-sm ${remaining >= 0 ? 'text-green-100' : 'text-red-100'}`}>
+        <p className={`text-sm ${false ? 'text-green-100' : 'text-red-100'}`}>
           {remaining >= 0 ? 'Available to spend' : 'Budget exceeded'}
         </p>

[Survived] ConditionalExpression
src/components/BudgetSummary.tsx:53:12
         </div>
         <p className="text-3xl font-bold mb-1">${Math.abs(remaining).toFixed(2)}</p>
         <p className={`text-sm ${remaining >= 0 ? 'text-green-100' : 'text-red-100'}`}>
-          {remaining >= 0 ? 'Available to spend' : 'Budget exceeded'}
+          {false ? 'Available to spend' : 'Budget exceeded'}
         </p>
       </div>

[Survived] EqualityOperator
src/components/BudgetSummary.tsx:53:12
         </div>
         <p className="text-3xl font-bold mb-1">${Math.abs(remaining).toFixed(2)}</p>
         <p className={`text-sm ${remaining >= 0 ? 'text-green-100' : 'text-red-100'}`}>
-          {remaining >= 0 ? 'Available to spend' : 'Budget exceeded'}
+          {remaining < 0 ? 'Available to spend' : 'Budget exceeded'}
         </p>
       </div>
