[Survived] BooleanLiteral
src/components/ExportPDF.tsx:14:46
 export function ExportPDF({ categories, transactions, userEmail }: ExportPDFProps) {
   const [startDate, setStartDate] = useState('');
   const [endDate, setEndDate] = useState('');
-  const [showModal, setShowModal] = useState(false);
+  const [showModal, setShowModal] = useState(true);
 
   const generatePDF = () => {

[Survived] ConditionalExpression
src/components/ExportPDF.tsx:19:9
   const generatePDF = () => {
     let filteredTransactions = transactions;
 
-    if (startDate && endDate) {
+    if (true) {
       filteredTransactions = transactions.filter(t => {
         const transDate = new Date(t.transaction_date);

[Survived] ConditionalExpression
src/components/ExportPDF.tsx:19:9
   const generatePDF = () => {
     let filteredTransactions = transactions;
 
-    if (startDate && endDate) {
+    if (false) {
       filteredTransactions = transactions.filter(t => {
         const transDate = new Date(t.transaction_date);

[Survived] MethodExpression
src/components/ExportPDF.tsx:20:30
     let filteredTransactions = transactions;
 
     if (startDate && endDate) {
-      filteredTransactions = transactions.filter(t => {
-        const transDate = new Date(t.transaction_date);
-        return transDate >= new Date(startDate) && transDate <= new Date(endDate);
-      });
+      filteredTransactions = transactions;
     }
 

[Survived] BlockStatement
src/components/ExportPDF.tsx:20:55
     let filteredTransactions = transactions;
 
     if (startDate && endDate) {
-      filteredTransactions = transactions.filter(t => {
-        const transDate = new Date(t.transaction_date);
-        return transDate >= new Date(startDate) && transDate <= new Date(endDate);
-      });
+      filteredTransactions = transactions.filter(t => {});
     }
 

[Survived] EqualityOperator
src/components/ExportPDF.tsx:22:52
     if (startDate && endDate) {
       filteredTransactions = transactions.filter(t => {
         const transDate = new Date(t.transaction_date);
-        return transDate >= new Date(startDate) && transDate <= new Date(endDate);
+        return transDate >= new Date(startDate) && transDate < new Date(endDate);
       });
     }

[Survived] ConditionalExpression
src/components/ExportPDF.tsx:22:16
     if (startDate && endDate) {
       filteredTransactions = transactions.filter(t => {
         const transDate = new Date(t.transaction_date);
-        return transDate >= new Date(startDate) && transDate <= new Date(endDate);
+        return false;
       });
     }

[Survived] ArrowFunction
src/components/ExportPDF.tsx:26:52
       });
     }
 
-    const totalSpent = filteredTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
+    const totalSpent = filteredTransactions.reduce(() => undefined, 0);
     const totalBudget = categories.reduce((sum, c) => sum + parseFloat(c.budget_amount.toString()), 0);
 

[Survived] ArithmeticOperator
src/components/ExportPDF.tsx:26:64
       });
     }
 
-    const totalSpent = filteredTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
+    const totalSpent = filteredTransactions.reduce((sum, t) => sum - parseFloat(t.amount.toString()), 0);
     const totalBudget = categories.reduce((sum, c) => sum + parseFloat(c.budget_amount.toString()), 0);
 

[Survived] ArrowFunction
src/components/ExportPDF.tsx:27:43
     }
 
     const totalSpent = filteredTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
-    const totalBudget = categories.reduce((sum, c) => sum + parseFloat(c.budget_amount.toString()), 0);
+    const totalBudget = categories.reduce(() => undefined, 0);
 
     const getCategoryInfo = (categoryId: string) => {

[Survived] ArithmeticOperator
src/components/ExportPDF.tsx:27:55
     }
 
     const totalSpent = filteredTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
-    const totalBudget = categories.reduce((sum, c) => sum + parseFloat(c.budget_amount.toString()), 0);
+    const totalBudget = categories.reduce((sum, c) => sum - parseFloat(c.budget_amount.toString()), 0);
 
     const getCategoryInfo = (categoryId: string) => {

[Survived] BlockStatement
src/components/ExportPDF.tsx:29:53
     const totalSpent = filteredTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
     const totalBudget = categories.reduce((sum, c) => sum + parseFloat(c.budget_amount.toString()), 0);
 
-    const getCategoryInfo = (categoryId: string) => {
-      return categories.find(c => c.id === categoryId);
-    };
+    const getCategoryInfo = (categoryId: string) => {};
 
     const getSpentByCategory = (categoryId: string) => {

[Survived] ArrowFunction
src/components/ExportPDF.tsx:30:30
     const totalBudget = categories.reduce((sum, c) => sum + parseFloat(c.budget_amount.toString()), 0);
 
     const getCategoryInfo = (categoryId: string) => {
-      return categories.find(c => c.id === categoryId);
+      return categories.find(() => undefined);
     };
 

[Survived] ConditionalExpression
src/components/ExportPDF.tsx:30:35
     const totalBudget = categories.reduce((sum, c) => sum + parseFloat(c.budget_amount.toString()), 0);
 
     const getCategoryInfo = (categoryId: string) => {
-      return categories.find(c => c.id === categoryId);
+      return categories.find(c => false);
     };
 

[Survived] BlockStatement
src/components/ExportPDF.tsx:33:56
       return categories.find(c => c.id === categoryId);
     };
 
-    const getSpentByCategory = (categoryId: string) => {
-      return filteredTransactions
-        .filter(t => t.category_id === categoryId)
-        .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
-    };
+    const getSpentByCategory = (categoryId: string) => {};
 
     const printWindow = window.open('', '_blank');

[Survived] MethodExpression
src/components/ExportPDF.tsx:34:14
     };
 
     const getSpentByCategory = (categoryId: string) => {
-      return filteredTransactions
-        .filter(t => t.category_id === categoryId)
+      return filteredTransactions
         .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
     };

[Survived] ConditionalExpression
src/components/ExportPDF.tsx:35:22
 
     const getSpentByCategory = (categoryId: string) => {
       return filteredTransactions
-        .filter(t => t.category_id === categoryId)
+        .filter(t => true)
         .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
     };

[Survived] ArrowFunction
src/components/ExportPDF.tsx:35:17
 
     const getSpentByCategory = (categoryId: string) => {
       return filteredTransactions
-        .filter(t => t.category_id === categoryId)
+        .filter(() => undefined)
         .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
     };

[Survived] ArithmeticOperator
src/components/ExportPDF.tsx:36:29
     const getSpentByCategory = (categoryId: string) => {
       return filteredTransactions
         .filter(t => t.category_id === categoryId)
-        .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
+        .reduce((sum, t) => sum - parseFloat(t.amount.toString()), 0);
     };
 

[Survived] ArrowFunction
src/components/ExportPDF.tsx:36:17
     const getSpentByCategory = (categoryId: string) => {
       return filteredTransactions
         .filter(t => t.category_id === categoryId)
-        .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
+        .reduce(() => undefined, 0);
     };
 

[Survived] StringLiteral
src/components/ExportPDF.tsx:39:37
         .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
     };
 
-    const printWindow = window.open('', '_blank');
+    const printWindow = window.open("Stryker was here!", '_blank');
     if (!printWindow) return;
 

[Survived] ConditionalExpression
src/components/ExportPDF.tsx:40:9
     };
 
     const printWindow = window.open('', '_blank');
-    if (!printWindow) return;
+    if (false) return;
 
     const dateRangeText = startDate && endDate

[Survived] BooleanLiteral
src/components/ExportPDF.tsx:40:9
     };
 
     const printWindow = window.open('', '_blank');
-    if (!printWindow) return;
+    if (printWindow) return;
 
     const dateRangeText = startDate && endDate

[Survived] ConditionalExpression
src/components/ExportPDF.tsx:42:27
     const printWindow = window.open('', '_blank');
     if (!printWindow) return;
 
-    const dateRangeText = startDate && endDate
+    const dateRangeText = false
       ? `${new Date(startDate).toLocaleDateString()} - ${new Date(endDate).toLocaleDateString()}`
       : 'All Time';

[Survived] LogicalOperator
src/components/ExportPDF.tsx:42:27
     const printWindow = window.open('', '_blank');
     if (!printWindow) return;
 
-    const dateRangeText = startDate && endDate
+    const dateRangeText = startDate || endDate
       ? `${new Date(startDate).toLocaleDateString()} - ${new Date(endDate).toLocaleDateString()}`
       : 'All Time';

[Survived] StringLiteral
src/components/ExportPDF.tsx:43:9
     if (!printWindow) return;
 
     const dateRangeText = startDate && endDate
-      ? `${new Date(startDate).toLocaleDateString()} - ${new Date(endDate).toLocaleDateString()}`
+      ? ``
       : 'All Time';
 

[Survived] EqualityOperator
src/components/ExportPDF.tsx:207:40
               <h3>Total Spent</h3>
               <p>$${totalSpent.toFixed(2)}</p>
             </div>
-            <div class="summary-card ${totalSpent > totalBudget ? 'over' : 'remaining'}">
+            <div class="summary-card ${totalSpent <= totalBudget ? 'over' : 'remaining'}">
               <h3>${totalSpent > totalBudget ? 'Over Budget' : 'Remaining'}</h3>
               <p>$${Math.abs(totalBudget - totalSpent).toFixed(2)}</p>

[Survived] EqualityOperator
src/components/ExportPDF.tsx:207:40
               <h3>Total Spent</h3>
               <p>$${totalSpent.toFixed(2)}</p>
             </div>
-            <div class="summary-card ${totalSpent > totalBudget ? 'over' : 'remaining'}">
+            <div class="summary-card ${totalSpent >= totalBudget ? 'over' : 'remaining'}">
               <h3>${totalSpent > totalBudget ? 'Over Budget' : 'Remaining'}</h3>
               <p>$${Math.abs(totalBudget - totalSpent).toFixed(2)}</p>

[Survived] EqualityOperator
src/components/ExportPDF.tsx:208:21
               <p>$${totalSpent.toFixed(2)}</p>
             </div>
             <div class="summary-card ${totalSpent > totalBudget ? 'over' : 'remaining'}">
-              <h3>${totalSpent > totalBudget ? 'Over Budget' : 'Remaining'}</h3>
+              <h3>${totalSpent <= totalBudget ? 'Over Budget' : 'Remaining'}</h3>
               <p>$${Math.abs(totalBudget - totalSpent).toFixed(2)}</p>
             </div>

[Survived] ConditionalExpression
src/components/ExportPDF.tsx:208:21
               <p>$${totalSpent.toFixed(2)}</p>
             </div>
             <div class="summary-card ${totalSpent > totalBudget ? 'over' : 'remaining'}">
-              <h3>${totalSpent > totalBudget ? 'Over Budget' : 'Remaining'}</h3>
+              <h3>${true ? 'Over Budget' : 'Remaining'}</h3>
               <p>$${Math.abs(totalBudget - totalSpent).toFixed(2)}</p>
             </div>

[Survived] ArithmeticOperator
src/components/ExportPDF.tsx:209:30
             </div>
             <div class="summary-card ${totalSpent > totalBudget ? 'over' : 'remaining'}">
               <h3>${totalSpent > totalBudget ? 'Over Budget' : 'Remaining'}</h3>
-              <p>$${Math.abs(totalBudget - totalSpent).toFixed(2)}</p>
+              <p>$${Math.abs(totalBudget + totalSpent).toFixed(2)}</p>
             </div>
           </div>

[Survived] BlockStatement
src/components/ExportPDF.tsx:215:37
 
           <div class="section category-breakdown">
             <h2>Spending by Category</h2>
-            ${categories.map(cat => {
-              const spent = getSpentByCategory(cat.id);
-              const remaining = cat.budget_amount - spent;
-              const isOver = remaining < 0;
-              return `
-                <div class="category-item" style="border-left-color: ${cat.color}">
-                  <div class="category-name">${cat.name}</div>
-                  <div class="category-amounts">
-                    <div class="category-spent" style="color: ${isOver ? '#ef4444' : '#1f2937'}">
-                      $${spent.toFixed(2)}
-                    </div>
-                    <div class="category-budget">
-                      Budget: $${cat.budget_amount.toFixed(2)}
-                      ${isOver ? `<span style="color: #ef4444;"> (Over by $${Math.abs(remaining).toFixed(2)})</span>` : ''}
-                    </div>
-                  </div>
-                </div>
-              `;
-            }).join('')}
+            ${categories.map(cat => {}).join('')}
           </div>
 

[Survived] ArithmeticOperator
src/components/ExportPDF.tsx:217:33
             <h2>Spending by Category</h2>
             ${categories.map(cat => {
               const spent = getSpentByCategory(cat.id);
-              const remaining = cat.budget_amount - spent;
+              const remaining = cat.budget_amount + spent;
               const isOver = remaining < 0;
               return `

[Survived] ConditionalExpression
src/components/ExportPDF.tsx:218:30
             ${categories.map(cat => {
               const spent = getSpentByCategory(cat.id);
               const remaining = cat.budget_amount - spent;
-              const isOver = remaining < 0;
+              const isOver = true;
               return `
                 <div class="category-item" style="border-left-color: ${cat.color}">

[Survived] EqualityOperator
src/components/ExportPDF.tsx:218:30
             ${categories.map(cat => {
               const spent = getSpentByCategory(cat.id);
               const remaining = cat.budget_amount - spent;
-              const isOver = remaining < 0;
+              const isOver = remaining >= 0;
               return `
                 <div class="category-item" style="border-left-color: ${cat.color}">

[Survived] StringLiteral
src/components/ExportPDF.tsx:223:86
                 <div class="category-item" style="border-left-color: ${cat.color}">
                   <div class="category-name">${cat.name}</div>
                   <div class="category-amounts">
-                    <div class="category-spent" style="color: ${isOver ? '#ef4444' : '#1f2937'}">
+                    <div class="category-spent" style="color: ${isOver ? '#ef4444' : ""}">
                       $${spent.toFixed(2)}
                     </div>

[Survived] StringLiteral
src/components/ExportPDF.tsx:223:74
                 <div class="category-item" style="border-left-color: ${cat.color}">
                   <div class="category-name">${cat.name}</div>
                   <div class="category-amounts">
-                    <div class="category-spent" style="color: ${isOver ? '#ef4444' : '#1f2937'}">
+                    <div class="category-spent" style="color: ${isOver ? "" : '#1f2937'}">
                       $${spent.toFixed(2)}
                     </div>

[Survived] StringLiteral
src/components/ExportPDF.tsx:228:121
                     </div>
                     <div class="category-budget">
                       Budget: $${cat.budget_amount.toFixed(2)}
-                      ${isOver ? `<span style="color: #ef4444;"> (Over by $${Math.abs(remaining).toFixed(2)})</span>` : ''}
+                      ${isOver ? `<span style="color: #ef4444;"> (Over by $${Math.abs(remaining).toFixed(2)})</span>` : "Stryker was here!"}
                     </div>
                   </div>

[Survived] StringLiteral
src/components/ExportPDF.tsx:233:21
                   </div>
                 </div>
               `;
-            }).join('')}
+            }).join("Stryker was here!")}
           </div>
 

[Survived] MethodExpression
src/components/ExportPDF.tsx:248:19
                 </tr>
               </thead>
               <tbody>
-                ${filteredTransactions.sort((a, b) =>
-                  new Date(b.transaction_date).getTime() - new Date(a.transaction_date).getTime()
-                ).map(t => {
+                ${filteredTransactions.map(t => {
                   const category = getCategoryInfo(t.category_id);
                   return `

[Survived] ArrowFunction
src/components/ExportPDF.tsx:248:45
                 </tr>
               </thead>
               <tbody>
-                ${filteredTransactions.sort((a, b) =>
-                  new Date(b.transaction_date).getTime() - new Date(a.transaction_date).getTime()
+                ${filteredTransactions.sort(() => undefined
                 ).map(t => {
                   const category = getCategoryInfo(t.category_id);

[Survived] ArithmeticOperator
src/components/ExportPDF.tsx:249:19
               </thead>
               <tbody>
                 ${filteredTransactions.sort((a, b) =>
-                  new Date(b.transaction_date).getTime() - new Date(a.transaction_date).getTime()
+                  new Date(b.transaction_date).getTime() + new Date(a.transaction_date).getTime()
                 ).map(t => {
                   const category = getCategoryInfo(t.category_id);

[Survived] BlockStatement
src/components/ExportPDF.tsx:250:28
               <tbody>
                 ${filteredTransactions.sort((a, b) =>
                   new Date(b.transaction_date).getTime() - new Date(a.transaction_date).getTime()
-                ).map(t => {
-                  const category = getCategoryInfo(t.category_id);
-                  return `
-                    <tr>
-                      <td class="transaction-date">
-                        ${new Date(t.transaction_date).toLocaleDateString('en-US', {
-                          year: 'numeric',
-                          month: 'short',
-                          day: 'numeric'
-                        })}
-                      </td>
-                      <td>${t.description}</td>
-                      <td>${category?.name || 'Unknown'}</td>
-                      <td class="transaction-amount" style="text-align: right;">$${parseFloat(t.amount.toString()).toFixed(2)}</td>
-                    </tr>
-                  `;
-                }).join('')}
+                ).map(t => {}).join('')}
               </tbody>
             </table>

[Survived] StringLiteral
src/components/ExportPDF.tsx:255:75
                   return `
                     <tr>
                       <td class="transaction-date">
-                        ${new Date(t.transaction_date).toLocaleDateString('en-US', {
+                        ${new Date(t.transaction_date).toLocaleDateString("", {
                           year: 'numeric',
                           month: 'short',

[Timeout] OptionalChaining
src/components/ExportPDF.tsx:262:29
                         })}
                       </td>
                       <td>${t.description}</td>
-                      <td>${category?.name || 'Unknown'}</td>
+                      <td>${category.name || 'Unknown'}</td>
                       <td class="transaction-amount" style="text-align: right;">$${parseFloat(t.amount.toString()).toFixed(2)}</td>
                     </tr>

[Timeout] ConditionalExpression
src/components/ExportPDF.tsx:262:29
                         })}
                       </td>
                       <td>${t.description}</td>
-                      <td>${category?.name || 'Unknown'}</td>
+                      <td>${true}</td>
                       <td class="transaction-amount" style="text-align: right;">$${parseFloat(t.amount.toString()).toFixed(2)}</td>
                     </tr>

[Survived] ObjectLiteral
src/components/ExportPDF.tsx:272:70
           </div>
 
           <div class="footer">
-            <p>Generated on ${new Date().toLocaleDateString('en-US', {
-              year: 'numeric',
-              month: 'long',
-              day: 'numeric',
-              hour: '2-digit',
-              minute: '2-digit'
-            })}</p>
+            <p>Generated on ${new Date().toLocaleDateString('en-US', {})}</p>
             <p style="margin-top: 8px;">Budget Tracker - Personal Finance Management</p>
           </div>

[Survived] StringLiteral
src/components/ExportPDF.tsx:274:22
           <div class="footer">
             <p>Generated on ${new Date().toLocaleDateString('en-US', {
               year: 'numeric',
-              month: 'long',
+              month: "",
               day: 'numeric',
               hour: '2-digit',

[Survived] BlockStatement
src/components/ExportPDF.tsx:288:22
     printWindow.document.write(htmlContent);
     printWindow.document.close();
 
-    setTimeout(() => {
-      printWindow.print();
-    }, 250);
+    setTimeout(() => {}, 250);
 
     setShowModal(false);

[Survived] BooleanLiteral
src/components/ExportPDF.tsx:292:18
       printWindow.print();
     }, 250);
 
-    setShowModal(false);
+    setShowModal(true);
   };
 

[Survived] ArrowFunction
src/components/ExportPDF.tsx:298:18
   return (
     <>
       <button
-        onClick={() => setShowModal(true)}
+        onClick={() => undefined}
         className="flex items-center gap-2 px-4 py-2 bg-green-500 text-white rounded-lg font-medium hover:bg-green-600 transition-colors shadow-sm"
       >

[Survived] BooleanLiteral
src/components/ExportPDF.tsx:298:37
   return (
     <>
       <button
-        onClick={() => setShowModal(true)}
+        onClick={() => setShowModal(false)}
         className="flex items-center gap-2 px-4 py-2 bg-green-500 text-white rounded-lg font-medium hover:bg-green-600 transition-colors shadow-sm"
       >

[Survived] ArrowFunction
src/components/ExportPDF.tsx:329:31
                   <input
                     type="date"
                     value={startDate}
-                    onChange={(e) => setStartDate(e.target.value)}
+                    onChange={() => undefined}
                     className="w-full pl-10 pr-4 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-green-500 focus:border-transparent"
                   />

[Survived] ArrowFunction
src/components/ExportPDF.tsx:344:31
                   <input
                     type="date"
                     value={endDate}
-                    onChange={(e) => setEndDate(e.target.value)}
+                    onChange={() => undefined}
                     className="w-full pl-10 pr-4 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-green-500 focus:border-transparent"
                   />

[Survived] ArrowFunction
src/components/ExportPDF.tsx:352:28
 
               <div className="flex gap-3 pt-4">
                 <button
-                  onClick={() => setShowModal(false)}
+                  onClick={() => undefined}
                   className="flex-1 px-4 py-2 border border-gray-300 rounded-lg text-gray-700 font-medium hover:bg-gray-50 transition-colors"
                 >

[Survived] BooleanLiteral
src/components/ExportPDF.tsx:352:47
 
               <div className="flex gap-3 pt-4">
                 <button
-                  onClick={() => setShowModal(false)}
+                  onClick={() => setShowModal(true)}
                   className="flex-1 px-4 py-2 border border-gray-300 rounded-lg text-gray-700 font-medium hover:bg-gray-50 transition-colors"
                 >
