[Survived] ArrayDeclaration
src/components/LineChart.tsx:13:69
   const [hoveredIndex, setHoveredIndex] = useState<number | null>(null);
 
   const getDailyData = () => {
-    const data: { date: Date; dateStr: string; amount: number }[] = [];
+    const data: { date: Date; dateStr: string; amount: number }[] = ["Stryker was here"];
     const now = new Date();
 

[Survived] BlockStatement
src/components/LineChart.tsx:16:41
     const data: { date: Date; dateStr: string; amount: number }[] = [];
     const now = new Date();
 
-    for (let i = days - 1; i >= 0; i--) {
-      const date = new Date(now);
-      date.setDate(date.getDate() - i);
-      date.setHours(0, 0, 0, 0);
-
-      const dayTransactions = transactions.filter(t => {
-        const transDate = new Date(t.transaction_date);
-        transDate.setHours(0, 0, 0, 0);
-        return transDate.getTime() === date.getTime();
-      });
-
-      const amount = dayTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
-
-      data.push({
-        date,
-        dateStr: date.toLocaleDateString('en-US', { month: 'short', day: 'numeric' }),
-        amount
-      });
-    }
+    for (let i = days - 1; i >= 0; i--) {}
 
     return data;

[Survived] ConditionalExpression
src/components/LineChart.tsx:16:28
     const data: { date: Date; dateStr: string; amount: number }[] = [];
     const now = new Date();
 
-    for (let i = days - 1; i >= 0; i--) {
+    for (let i = days - 1; false; i--) {
       const date = new Date(now);
       date.setDate(date.getDate() - i);

[Survived] ArithmeticOperator
src/components/LineChart.tsx:18:20
 
     for (let i = days - 1; i >= 0; i--) {
       const date = new Date(now);
-      date.setDate(date.getDate() - i);
+      date.setDate(date.getDate() + i);
       date.setHours(0, 0, 0, 0);
 

[Survived] MethodExpression
src/components/LineChart.tsx:18:7
 
     for (let i = days - 1; i >= 0; i--) {
       const date = new Date(now);
-      date.setDate(date.getDate() - i);
+      date.setTime(date.getDate() - i);
       date.setHours(0, 0, 0, 0);
 

[Survived] MethodExpression
src/components/LineChart.tsx:19:7
     for (let i = days - 1; i >= 0; i--) {
       const date = new Date(now);
       date.setDate(date.getDate() - i);
-      date.setHours(0, 0, 0, 0);
+      date.setMinutes(0, 0, 0, 0);
 
       const dayTransactions = transactions.filter(t => {

[Survived] BlockStatement
src/components/LineChart.tsx:21:56
       date.setDate(date.getDate() - i);
       date.setHours(0, 0, 0, 0);
 
-      const dayTransactions = transactions.filter(t => {
-        const transDate = new Date(t.transaction_date);
-        transDate.setHours(0, 0, 0, 0);
-        return transDate.getTime() === date.getTime();
-      });
+      const dayTransactions = transactions.filter(t => {});
 
       const amount = dayTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);

[Survived] MethodExpression
src/components/LineChart.tsx:21:31
       date.setDate(date.getDate() - i);
       date.setHours(0, 0, 0, 0);
 
-      const dayTransactions = transactions.filter(t => {
-        const transDate = new Date(t.transaction_date);
-        transDate.setHours(0, 0, 0, 0);
-        return transDate.getTime() === date.getTime();
-      });
+      const dayTransactions = transactions;
 
       const amount = dayTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);

[Survived] MethodExpression
src/components/LineChart.tsx:23:9
 
       const dayTransactions = transactions.filter(t => {
         const transDate = new Date(t.transaction_date);
-        transDate.setHours(0, 0, 0, 0);
+        transDate.setMinutes(0, 0, 0, 0);
         return transDate.getTime() === date.getTime();
       });

[Survived] ConditionalExpression
src/components/LineChart.tsx:24:16
       const dayTransactions = transactions.filter(t => {
         const transDate = new Date(t.transaction_date);
         transDate.setHours(0, 0, 0, 0);
-        return transDate.getTime() === date.getTime();
+        return false;
       });
 

[Survived] EqualityOperator
src/components/LineChart.tsx:24:16
       const dayTransactions = transactions.filter(t => {
         const transDate = new Date(t.transaction_date);
         transDate.setHours(0, 0, 0, 0);
-        return transDate.getTime() === date.getTime();
+        return transDate.getTime() !== date.getTime();
       });
 

[Survived] ArithmeticOperator
src/components/LineChart.tsx:27:57
         return transDate.getTime() === date.getTime();
       });
 
-      const amount = dayTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
+      const amount = dayTransactions.reduce((sum, t) => sum - parseFloat(t.amount.toString()), 0);
 
       data.push({

[Survived] ArrowFunction
src/components/LineChart.tsx:27:45
         return transDate.getTime() === date.getTime();
       });
 
-      const amount = dayTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
+      const amount = dayTransactions.reduce(() => undefined, 0);
 
       data.push({

[Survived] StringLiteral
src/components/LineChart.tsx:31:60
 
       data.push({
         date,
-        dateStr: date.toLocaleDateString('en-US', { month: 'short', day: 'numeric' }),
+        dateStr: date.toLocaleDateString('en-US', { month: "", day: 'numeric' }),
         amount
       });

[Survived] ArrowFunction
src/components/LineChart.tsx:40:47
   };
 
   const dailyData = getDailyData();
-  const maxAmount = Math.max(...dailyData.map(d => d.amount), 100);
+  const maxAmount = Math.max(...dailyData.map(() => undefined), 100);
   const avgAmount = dailyData.reduce((sum, d) => sum + d.amount, 0) / dailyData.length;
 

[Survived] MethodExpression
src/components/LineChart.tsx:40:21
   };
 
   const dailyData = getDailyData();
-  const maxAmount = Math.max(...dailyData.map(d => d.amount), 100);
+  const maxAmount = Math.min(...dailyData.map(d => d.amount), 100);
   const avgAmount = dailyData.reduce((sum, d) => sum + d.amount, 0) / dailyData.length;
 

[Survived] ArithmeticOperator
src/components/LineChart.tsx:41:50
 
   const dailyData = getDailyData();
   const maxAmount = Math.max(...dailyData.map(d => d.amount), 100);
-  const avgAmount = dailyData.reduce((sum, d) => sum + d.amount, 0) / dailyData.length;
+  const avgAmount = dailyData.reduce((sum, d) => sum - d.amount, 0) / dailyData.length;
 
   const chartWidth = 800;

[Survived] ArrowFunction
src/components/LineChart.tsx:41:38
 
   const dailyData = getDailyData();
   const maxAmount = Math.max(...dailyData.map(d => d.amount), 100);
-  const avgAmount = dailyData.reduce((sum, d) => sum + d.amount, 0) / dailyData.length;
+  const avgAmount = dailyData.reduce(() => undefined, 0) / dailyData.length;
 
   const chartWidth = 800;

[Survived] ObjectLiteral
src/components/LineChart.tsx:45:19
 
   const chartWidth = 800;
   const chartHeight = 300;
-  const padding = { top: 40, right: 20, bottom: 60, left: 60 };
+  const padding = {};
   const innerWidth = chartWidth - padding.left - padding.right;
   const innerHeight = chartHeight - padding.top - padding.bottom;

[Survived] ArithmeticOperator
src/components/LineChart.tsx:46:22
   const chartWidth = 800;
   const chartHeight = 300;
   const padding = { top: 40, right: 20, bottom: 60, left: 60 };
-  const innerWidth = chartWidth - padding.left - padding.right;
+  const innerWidth = chartWidth - padding.left + padding.right;
   const innerHeight = chartHeight - padding.top - padding.bottom;
 

[Survived] ArithmeticOperator
src/components/LineChart.tsx:46:22
   const chartWidth = 800;
   const chartHeight = 300;
   const padding = { top: 40, right: 20, bottom: 60, left: 60 };
-  const innerWidth = chartWidth - padding.left - padding.right;
+  const innerWidth = chartWidth + padding.left - padding.right;
   const innerHeight = chartHeight - padding.top - padding.bottom;
 

[Survived] ArithmeticOperator
src/components/LineChart.tsx:47:23
   const chartHeight = 300;
   const padding = { top: 40, right: 20, bottom: 60, left: 60 };
   const innerWidth = chartWidth - padding.left - padding.right;
-  const innerHeight = chartHeight - padding.top - padding.bottom;
+  const innerHeight = chartHeight - padding.top + padding.bottom;
 
   const xStep = innerWidth / (dailyData.length - 1);

[Survived] ArithmeticOperator
src/components/LineChart.tsx:47:23
   const chartHeight = 300;
   const padding = { top: 40, right: 20, bottom: 60, left: 60 };
   const innerWidth = chartWidth - padding.left - padding.right;
-  const innerHeight = chartHeight - padding.top - padding.bottom;
+  const innerHeight = chartHeight + padding.top - padding.bottom;
 
   const xStep = innerWidth / (dailyData.length - 1);

[Survived] ArithmeticOperator
src/components/LineChart.tsx:49:31
   const innerWidth = chartWidth - padding.left - padding.right;
   const innerHeight = chartHeight - padding.top - padding.bottom;
 
-  const xStep = innerWidth / (dailyData.length - 1);
+  const xStep = innerWidth / (dailyData.length + 1);
   const yScale = innerHeight / maxAmount;
 

[Survived] ArithmeticOperator
src/components/LineChart.tsx:49:17
   const innerWidth = chartWidth - padding.left - padding.right;
   const innerHeight = chartHeight - padding.top - padding.bottom;
 
-  const xStep = innerWidth / (dailyData.length - 1);
+  const xStep = innerWidth * (dailyData.length - 1);
   const yScale = innerHeight / maxAmount;
 

[Survived] ArithmeticOperator
src/components/LineChart.tsx:50:18
   const innerHeight = chartHeight - padding.top - padding.bottom;
 
   const xStep = innerWidth / (dailyData.length - 1);
-  const yScale = innerHeight / maxAmount;
+  const yScale = innerHeight * maxAmount;
 
   const points = dailyData.map((d, i) => ({

[Survived] ArrowFunction
src/components/LineChart.tsx:52:32
   const xStep = innerWidth / (dailyData.length - 1);
   const yScale = innerHeight / maxAmount;
 
-  const points = dailyData.map((d, i) => ({
-    x: padding.left + i * xStep,
-    y: padding.top + innerHeight - d.amount * yScale,
-    ...d
-  }));
+  const points = dailyData.map(() => undefined);
 
   const pathD = points.reduce((path, point, i) => {

[Survived] ObjectLiteral
src/components/LineChart.tsx:52:43
   const xStep = innerWidth / (dailyData.length - 1);
   const yScale = innerHeight / maxAmount;
 
-  const points = dailyData.map((d, i) => ({
-    x: padding.left + i * xStep,
-    y: padding.top + innerHeight - d.amount * yScale,
-    ...d
-  }));
+  const points = dailyData.map((d, i) => ({}));
 
   const pathD = points.reduce((path, point, i) => {

[Survived] ArithmeticOperator
src/components/LineChart.tsx:53:23
   const yScale = innerHeight / maxAmount;
 
   const points = dailyData.map((d, i) => ({
-    x: padding.left + i * xStep,
+    x: padding.left + i / xStep,
     y: padding.top + innerHeight - d.amount * yScale,
     ...d

[Survived] ArithmeticOperator
src/components/LineChart.tsx:53:8
   const yScale = innerHeight / maxAmount;
 
   const points = dailyData.map((d, i) => ({
-    x: padding.left + i * xStep,
+    x: padding.left - i * xStep,
     y: padding.top + innerHeight - d.amount * yScale,
     ...d

[Survived] ArithmeticOperator
src/components/LineChart.tsx:54:36
 
   const points = dailyData.map((d, i) => ({
     x: padding.left + i * xStep,
-    y: padding.top + innerHeight - d.amount * yScale,
+    y: padding.top + innerHeight - d.amount / yScale,
     ...d
   }));

[Survived] ArithmeticOperator
src/components/LineChart.tsx:54:8
 
   const points = dailyData.map((d, i) => ({
     x: padding.left + i * xStep,
-    y: padding.top + innerHeight - d.amount * yScale,
+    y: padding.top - innerHeight - d.amount * yScale,
     ...d
   }));

[Survived] BlockStatement
src/components/LineChart.tsx:58:51
     ...d
   }));
 
-  const pathD = points.reduce((path, point, i) => {
-    if (i === 0) {
-      return `M ${point.x} ${point.y}`;
-    }
-    const prevPoint = points[i - 1];
-    const cpX = (prevPoint.x + point.x) / 2;
-    return `${path} C ${cpX} ${prevPoint.y}, ${cpX} ${point.y}, ${point.x} ${point.y}`;
-  }, '');
+  const pathD = points.reduce((path, point, i) => {}, '');
 
   const areaPathD = `${pathD} L ${points[points.length - 1].x} ${padding.top + innerHeight} L ${padding.left} ${padding.top + innerHeight} Z`;

[Survived] ConditionalExpression
src/components/LineChart.tsx:59:9
   }));
 
   const pathD = points.reduce((path, point, i) => {
-    if (i === 0) {
+    if (false) {
       return `M ${point.x} ${point.y}`;
     }

[Survived] EqualityOperator
src/components/LineChart.tsx:59:9
   }));
 
   const pathD = points.reduce((path, point, i) => {
-    if (i === 0) {
+    if (i !== 0) {
       return `M ${point.x} ${point.y}`;
     }

[Survived] StringLiteral
src/components/LineChart.tsx:60:14
 
   const pathD = points.reduce((path, point, i) => {
     if (i === 0) {
-      return `M ${point.x} ${point.y}`;
+      return ``;
     }
     const prevPoint = points[i - 1];

[Survived] ArithmeticOperator
src/components/LineChart.tsx:62:30
     if (i === 0) {
       return `M ${point.x} ${point.y}`;
     }
-    const prevPoint = points[i - 1];
+    const prevPoint = points[i + 1];
     const cpX = (prevPoint.x + point.x) / 2;
     return `${path} C ${cpX} ${prevPoint.y}, ${cpX} ${point.y}, ${point.x} ${point.y}`;

[Survived] ArithmeticOperator
src/components/LineChart.tsx:63:18
       return `M ${point.x} ${point.y}`;
     }
     const prevPoint = points[i - 1];
-    const cpX = (prevPoint.x + point.x) / 2;
+    const cpX = (prevPoint.x - point.x) / 2;
     return `${path} C ${cpX} ${prevPoint.y}, ${cpX} ${point.y}, ${point.x} ${point.y}`;
   }, '');

[Survived] ArithmeticOperator
src/components/LineChart.tsx:63:17
       return `M ${point.x} ${point.y}`;
     }
     const prevPoint = points[i - 1];
-    const cpX = (prevPoint.x + point.x) / 2;
+    const cpX = (prevPoint.x + point.x) * 2;
     return `${path} C ${cpX} ${prevPoint.y}, ${cpX} ${point.y}, ${point.x} ${point.y}`;
   }, '');

[Survived] StringLiteral
src/components/LineChart.tsx:64:12
     }
     const prevPoint = points[i - 1];
     const cpX = (prevPoint.x + point.x) / 2;
-    return `${path} C ${cpX} ${prevPoint.y}, ${cpX} ${point.y}, ${point.x} ${point.y}`;
+    return ``;
   }, '');
 

[Survived] ArithmeticOperator
src/components/LineChart.tsx:67:66
     return `${path} C ${cpX} ${prevPoint.y}, ${cpX} ${point.y}, ${point.x} ${point.y}`;
   }, '');
 
-  const areaPathD = `${pathD} L ${points[points.length - 1].x} ${padding.top + innerHeight} L ${padding.left} ${padding.top + innerHeight} Z`;
+  const areaPathD = `${pathD} L ${points[points.length - 1].x} ${padding.top - innerHeight} L ${padding.left} ${padding.top + innerHeight} Z`;
 
   const yAxisLabels = [0, maxAmount / 2, maxAmount];

[Survived] ArithmeticOperator
src/components/LineChart.tsx:67:113
     return `${path} C ${cpX} ${prevPoint.y}, ${cpX} ${point.y}, ${point.x} ${point.y}`;
   }, '');
 
-  const areaPathD = `${pathD} L ${points[points.length - 1].x} ${padding.top + innerHeight} L ${padding.left} ${padding.top + innerHeight} Z`;
+  const areaPathD = `${pathD} L ${points[points.length - 1].x} ${padding.top + innerHeight} L ${padding.left} ${padding.top - innerHeight} Z`;
 
   const yAxisLabels = [0, maxAmount / 2, maxAmount];

[Survived] ArithmeticOperator
src/components/LineChart.tsx:69:27
 
   const areaPathD = `${pathD} L ${points[points.length - 1].x} ${padding.top + innerHeight} L ${padding.left} ${padding.top + innerHeight} Z`;
 
-  const yAxisLabels = [0, maxAmount / 2, maxAmount];
+  const yAxisLabels = [0, maxAmount * 2, maxAmount];
 
   return (

[Survived] StringLiteral
src/components/LineChart.tsx:82:20
 
       <div className="relative">
         <svg
-          viewBox={`0 0 ${chartWidth} ${chartHeight}`}
+          viewBox={``}
           className="w-full"
           style={{ maxHeight: '400px' }}

[Survived] BlockStatement
src/components/LineChart.tsx:93:42
             </linearGradient>
           </defs>
 
-          {yAxisLabels.map((label, i) => {
-            const y = padding.top + innerHeight - (label / maxAmount) * innerHeight;
-            return (
-              <g key={i}>
-                <line
-                  x1={padding.left}
-                  y1={y}
-                  x2={chartWidth - padding.right}
-                  y2={y}
-                  stroke="#e5e7eb"
-                  strokeWidth="1"
-                  strokeDasharray={i === 0 ? "0" : "4 4"}
-                />
-                <text
-                  x={padding.left - 10}
-                  y={y + 4}
-                  textAnchor="end"
-                  className="text-xs fill-gray-600"
-                >
-                  ${label.toFixed(0)}
-                </text>
-              </g>
-            );
-          })}
+          {yAxisLabels.map((label, i) => {})}
 
           <path d={areaPathD} fill="url(#areaGradient)" />

[Survived] ArithmeticOperator
src/components/LineChart.tsx:94:51
           </defs>
 
           {yAxisLabels.map((label, i) => {
-            const y = padding.top + innerHeight - (label / maxAmount) * innerHeight;
+            const y = padding.top + innerHeight - label / maxAmount / innerHeight;
             return (
               <g key={i}>

[Survived] ArithmeticOperator
src/components/LineChart.tsx:94:52
           </defs>
 
           {yAxisLabels.map((label, i) => {
-            const y = padding.top + innerHeight - (label / maxAmount) * innerHeight;
+            const y = padding.top + innerHeight - (label * maxAmount) * innerHeight;
             return (
               <g key={i}>

[Survived] ArithmeticOperator
src/components/LineChart.tsx:100:23
                 <line
                   x1={padding.left}
                   y1={y}
-                  x2={chartWidth - padding.right}
+                  x2={chartWidth + padding.right}
                   y2={y}
                   stroke="#e5e7eb"

[Survived] ConditionalExpression
src/components/LineChart.tsx:104:36
                   y2={y}
                   stroke="#e5e7eb"
                   strokeWidth="1"
-                  strokeDasharray={i === 0 ? "0" : "4 4"}
+                  strokeDasharray={true ? "0" : "4 4"}
                 />
                 <text

[Survived] EqualityOperator
src/components/LineChart.tsx:104:36
                   y2={y}
                   stroke="#e5e7eb"
                   strokeWidth="1"
-                  strokeDasharray={i === 0 ? "0" : "4 4"}
+                  strokeDasharray={i !== 0 ? "0" : "4 4"}
                 />
                 <text

[Survived] ArithmeticOperator
src/components/LineChart.tsx:107:22
                   strokeDasharray={i === 0 ? "0" : "4 4"}
                 />
                 <text
-                  x={padding.left - 10}
+                  x={padding.left + 10}
                   y={y + 4}
                   textAnchor="end"

[Survived] ArithmeticOperator
src/components/LineChart.tsx:108:22
                 />
                 <text
                   x={padding.left - 10}
-                  y={y + 4}
+                  y={y - 4}
                   textAnchor="end"
                   className="text-xs fill-gray-600"

[Survived] EqualityOperator
src/components/LineChart.tsx:130:73
           />
 
           {points.map((point, i) => {
-            const showLabel = i % Math.ceil(points.length / 7) === 0 || i === points.length - 1;
+            const showLabel = i % Math.ceil(points.length / 7) === 0 || i !== points.length - 1;
 
             return (

[Survived] LogicalOperator
src/components/LineChart.tsx:130:31
           />
 
           {points.map((point, i) => {
-            const showLabel = i % Math.ceil(points.length / 7) === 0 || i === points.length - 1;
+            const showLabel = i % Math.ceil(points.length / 7) === 0 && i === points.length - 1;
 
             return (

[Survived] ConditionalExpression
src/components/LineChart.tsx:134:18
 
             return (
               <g key={i}>
-                {showLabel && (
-                  <text
-                    x={point.x}
-                    y={chartHeight - padding.bottom + 20}
-                    textAnchor="middle"
-                    className="text-xs fill-gray-600"
-                  >
-                    {point.dateStr}
-                  </text>
-                )}
+                {true}
                 <circle
                   cx={point.x}

[Survived] ConditionalExpression
src/components/LineChart.tsx:134:18
 
             return (
               <g key={i}>
-                {showLabel && (
-                  <text
-                    x={point.x}
-                    y={chartHeight - padding.bottom + 20}
-                    textAnchor="middle"
-                    className="text-xs fill-gray-600"
-                  >
-                    {point.dateStr}
-                  </text>
-                )}
+                {false}
                 <circle
                   cx={point.x}

[Survived] ArithmeticOperator
src/components/LineChart.tsx:137:24
                 {showLabel && (
                   <text
                     x={point.x}
-                    y={chartHeight - padding.bottom + 20}
+                    y={chartHeight + padding.bottom + 20}
                     textAnchor="middle"
                     className="text-xs fill-gray-600"

[Survived] ArithmeticOperator
src/components/LineChart.tsx:137:24
                 {showLabel && (
                   <text
                     x={point.x}
-                    y={chartHeight - padding.bottom + 20}
+                    y={chartHeight - padding.bottom - 20}
                     textAnchor="middle"
                     className="text-xs fill-gray-600"

[Survived] ConditionalExpression
src/components/LineChart.tsx:147:22
                 <circle
                   cx={point.x}
                   cy={point.y}
-                  r={hoveredIndex === i ? 6 : 4}
+                  r={false ? 6 : 4}
                   fill="white"
                   stroke="#f97316"

[Survived] EqualityOperator
src/components/LineChart.tsx:147:22
                 <circle
                   cx={point.x}
                   cy={point.y}
-                  r={hoveredIndex === i ? 6 : 4}
+                  r={hoveredIndex !== i ? 6 : 4}
                   fill="white"
                   stroke="#f97316"

[Survived] ArrowFunction
src/components/LineChart.tsx:152:33
                   stroke="#f97316"
                   strokeWidth="2"
                   className="transition-all duration-200 cursor-pointer"
-                  onMouseEnter={() => setHoveredIndex(i)}
+                  onMouseEnter={() => undefined}
                   onMouseLeave={() => setHoveredIndex(null)}
                 />

[Survived] ArrowFunction
src/components/LineChart.tsx:153:33
                   strokeWidth="2"
                   className="transition-all duration-200 cursor-pointer"
                   onMouseEnter={() => setHoveredIndex(i)}
-                  onMouseLeave={() => setHoveredIndex(null)}
+                  onMouseLeave={() => undefined}
                 />
                 {hoveredIndex === i && (

[Survived] ConditionalExpression
src/components/LineChart.tsx:155:18
                   onMouseEnter={() => setHoveredIndex(i)}
                   onMouseLeave={() => setHoveredIndex(null)}
                 />
-                {hoveredIndex === i && (
+                {true && (
                   <>
                     <rect

[Survived] EqualityOperator
src/components/LineChart.tsx:155:18
                   onMouseEnter={() => setHoveredIndex(i)}
                   onMouseLeave={() => setHoveredIndex(null)}
                 />
-                {hoveredIndex === i && (
+                {hoveredIndex !== i && (
                   <>
                     <rect

[Survived] ArithmeticOperator
src/components/LineChart.tsx:158:26
                 {hoveredIndex === i && (
                   <>
                     <rect
-                      x={point.x - 50}
+                      x={point.x + 50}
                       y={point.y - 50}
                       width="100"

[Survived] ArithmeticOperator
src/components/LineChart.tsx:159:26
                   <>
                     <rect
                       x={point.x - 50}
-                      y={point.y - 50}
+                      y={point.y + 50}
                       width="100"
                       height="40"

[Survived] ArithmeticOperator
src/components/LineChart.tsx:168:26
                     />
                     <text
                       x={point.x}
-                      y={point.y - 35}
+                      y={point.y + 35}
                       textAnchor="middle"
                       className="text-xs fill-white font-medium"

[Survived] ArithmeticOperator
src/components/LineChart.tsx:176:26
                     </text>
                     <text
                       x={point.x}
-                      y={point.y - 20}
+                      y={point.y + 20}
                       textAnchor="middle"
                       className="text-sm fill-white font-bold"

[Survived] ArithmeticOperator
src/components/LineChart.tsx:194:44
         <div className="text-center">
           <p className="text-sm text-gray-600 mb-1">Total Spent</p>
           <p className="text-xl font-bold text-gray-900">
-            ${dailyData.reduce((sum, d) => sum + d.amount, 0).toFixed(2)}
+            ${dailyData.reduce((sum, d) => sum - d.amount, 0).toFixed(2)}
           </p>
         </div>

[Survived] ArrowFunction
src/components/LineChart.tsx:194:32
         <div className="text-center">
           <p className="text-sm text-gray-600 mb-1">Total Spent</p>
           <p className="text-xl font-bold text-gray-900">
-            ${dailyData.reduce((sum, d) => sum + d.amount, 0).toFixed(2)}
+            ${dailyData.reduce(() => undefined, 0).toFixed(2)}
           </p>
         </div>

[Survived] ArrowFunction
src/components/LineChart.tsx:200:41
         <div className="text-center">
           <p className="text-sm text-gray-600 mb-1">Peak Day</p>
           <p className="text-xl font-bold text-orange-600">
-            ${Math.max(...dailyData.map(d => d.amount)).toFixed(2)}
+            ${Math.max(...dailyData.map(() => undefined)).toFixed(2)}
           </p>
         </div>

[Survived] MethodExpression
src/components/LineChart.tsx:200:15
         <div className="text-center">
           <p className="text-sm text-gray-600 mb-1">Peak Day</p>
           <p className="text-xl font-bold text-orange-600">
-            ${Math.max(...dailyData.map(d => d.amount)).toFixed(2)}
+            ${Math.min(...dailyData.map(d => d.amount)).toFixed(2)}
           </p>
         </div>

[Survived] EqualityOperator
src/components/LineChart.tsx:206:36
         <div className="text-center">
           <p className="text-sm text-gray-600 mb-1">Days Active</p>
           <p className="text-xl font-bold text-blue-600">
-            {dailyData.filter(d => d.amount > 0).length}
+            {dailyData.filter(d => d.amount >= 0).length}
           </p>
         </div>

[Survived] ArrowFunction
src/components/LineChart.tsx:206:31
         <div className="text-center">
           <p className="text-sm text-gray-600 mb-1">Days Active</p>
           <p className="text-xl font-bold text-blue-600">
-            {dailyData.filter(d => d.amount > 0).length}
+            {dailyData.filter(() => undefined).length}
           </p>
         </div>
