[Survived] BlockStatement
src/components/MonthlyTrends.tsx:8:32
 }
 
 export function MonthlyTrends({ transactions }: MonthlyTrendsProps) {
-  const getLast6Months = () => {
-    const months = [];
-    const now = new Date();
-
-    for (let i = 5; i >= 0; i--) {
-      const date = new Date(now.getFullYear(), now.getMonth() - i, 1);
-      months.push({
-        date,
-        name: date.toLocaleDateString('en-US', { month: 'short', year: 'numeric' }),
-        month: date.getMonth(),
-        year: date.getFullYear()
-      });
-    }
-
-    return months;
-  };
+  const getLast6Months = () => {};
 
   const months = getLast6Months();

[Survived] EqualityOperator
src/components/MonthlyTrends.tsx:12:21
     const months = [];
     const now = new Date();
 
-    for (let i = 5; i >= 0; i--) {
+    for (let i = 5; i > 0; i--) {
       const date = new Date(now.getFullYear(), now.getMonth() - i, 1);
       months.push({

[Survived] EqualityOperator
src/components/MonthlyTrends.tsx:12:21
     const months = [];
     const now = new Date();
 
-    for (let i = 5; i >= 0; i--) {
+    for (let i = 5; i < 0; i--) {
       const date = new Date(now.getFullYear(), now.getMonth() - i, 1);
       months.push({

[Survived] ArithmeticOperator
src/components/MonthlyTrends.tsx:13:48
     const now = new Date();
 
     for (let i = 5; i >= 0; i--) {
-      const date = new Date(now.getFullYear(), now.getMonth() - i, 1);
+      const date = new Date(now.getFullYear(), now.getMonth() + i, 1);
       months.push({
         date,

[Survived] StringLiteral
src/components/MonthlyTrends.tsx:16:57
       const date = new Date(now.getFullYear(), now.getMonth() - i, 1);
       months.push({
         date,
-        name: date.toLocaleDateString('en-US', { month: 'short', year: 'numeric' }),
+        name: date.toLocaleDateString('en-US', { month: "", year: 'numeric' }),
         month: date.getMonth(),
         year: date.getFullYear()

[Survived] BlockStatement
src/components/MonthlyTrends.tsx:27:39
 
   const months = getLast6Months();
 
-  const monthlyData = months.map(m => {
-    const monthTransactions = transactions.filter(t => {
-      const transDate = new Date(t.transaction_date);
-      return transDate.getMonth() === m.month && transDate.getFullYear() === m.year;
-    });
-
-    const total = monthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
-
-    return {
-      ...m,
-      total,
-      count: monthTransactions.length
-    };
-  });
+  const monthlyData = months.map(m => {});
 
   const maxSpending = Math.max(...monthlyData.map(m => m.total), 1);

[Survived] MethodExpression
src/components/MonthlyTrends.tsx:28:31
   const months = getLast6Months();
 
   const monthlyData = months.map(m => {
-    const monthTransactions = transactions.filter(t => {
-      const transDate = new Date(t.transaction_date);
-      return transDate.getMonth() === m.month && transDate.getFullYear() === m.year;
-    });
+    const monthTransactions = transactions;
 
     const total = monthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);

[Survived] BlockStatement
src/components/MonthlyTrends.tsx:28:56
   const months = getLast6Months();
 
   const monthlyData = months.map(m => {
-    const monthTransactions = transactions.filter(t => {
-      const transDate = new Date(t.transaction_date);
-      return transDate.getMonth() === m.month && transDate.getFullYear() === m.year;
-    });
+    const monthTransactions = transactions.filter(t => {});
 
     const total = monthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);

[Survived] ConditionalExpression
src/components/MonthlyTrends.tsx:30:50
   const monthlyData = months.map(m => {
     const monthTransactions = transactions.filter(t => {
       const transDate = new Date(t.transaction_date);
-      return transDate.getMonth() === m.month && transDate.getFullYear() === m.year;
+      return transDate.getMonth() === m.month && true;
     });
 

[Survived] ConditionalExpression
src/components/MonthlyTrends.tsx:30:14
   const monthlyData = months.map(m => {
     const monthTransactions = transactions.filter(t => {
       const transDate = new Date(t.transaction_date);
-      return transDate.getMonth() === m.month && transDate.getFullYear() === m.year;
+      return true;
     });
 

[Survived] ArithmeticOperator
src/components/MonthlyTrends.tsx:33:56
       return transDate.getMonth() === m.month && transDate.getFullYear() === m.year;
     });
 
-    const total = monthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
+    const total = monthTransactions.reduce((sum, t) => sum - parseFloat(t.amount.toString()), 0);
 
     return {

[Survived] ArrowFunction
src/components/MonthlyTrends.tsx:33:44
       return transDate.getMonth() === m.month && transDate.getFullYear() === m.year;
     });
 
-    const total = monthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
+    const total = monthTransactions.reduce(() => undefined, 0);
 
     return {

[Survived] ArrowFunction
src/components/MonthlyTrends.tsx:42:51
     };
   });
 
-  const maxSpending = Math.max(...monthlyData.map(m => m.total), 1);
+  const maxSpending = Math.max(...monthlyData.map(() => undefined), 1);
 
   return (

[Survived] MethodExpression
src/components/MonthlyTrends.tsx:42:23
     };
   });
 
-  const maxSpending = Math.max(...monthlyData.map(m => m.total), 1);
+  const maxSpending = Math.min(...monthlyData.map(m => m.total), 1);
 
   return (

[Survived] ArithmeticOperator
src/components/MonthlyTrends.tsx:51:35
       <div className="space-y-6">
         <div className="flex items-end justify-between gap-2 h-64">
           {monthlyData.map((month, index) => {
-            const heightPercent = (month.total / maxSpending) * 100;
+            const heightPercent = month.total / maxSpending / 100;
 
             return (

[Survived] ArithmeticOperator
src/components/MonthlyTrends.tsx:51:36
       <div className="space-y-6">
         <div className="flex items-end justify-between gap-2 h-64">
           {monthlyData.map((month, index) => {
-            const heightPercent = (month.total / maxSpending) * 100;
+            const heightPercent = (month.total * maxSpending) * 100;
 
             return (

[Survived] EqualityOperator
src/components/MonthlyTrends.tsx:61:70
                   </span>
                   <div
                     className="w-full bg-gradient-to-t from-orange-500 to-orange-400 rounded-t-lg transition-all duration-500 hover:from-orange-600 hover:to-orange-500 relative group"
-                    style={{ height: `${heightPercent}%`, minHeight: month.total > 0 ? '8px' : '0' }}
+                    style={{ height: `${heightPercent}%`, minHeight: month.total >= 0 ? '8px' : '0' }}
                   >

[Survived] ConditionalExpression
src/components/MonthlyTrends.tsx:61:70
                   </span>
                   <div
                     className="w-full bg-gradient-to-t from-orange-500 to-orange-400 rounded-t-lg transition-all duration-500 hover:from-orange-600 hover:to-orange-500 relative group"
-                    style={{ height: `${heightPercent}%`, minHeight: month.total > 0 ? '8px' : '0' }}
+                    style={{ height: `${heightPercent}%`, minHeight: true ? '8px' : '0' }}
                   >

[Survived] ArithmeticOperator
src/components/MonthlyTrends.tsx:83:50
             <div>
               <p className="text-sm text-gray-600 mb-1">6-Month Total</p>
               <p className="text-xl font-bold text-gray-900">
-                ${monthlyData.reduce((sum, m) => sum + m.total, 0).toFixed(2)}
+                ${monthlyData.reduce((sum, m) => sum - m.total, 0).toFixed(2)}
               </p>
             </div>

[Survived] ArrowFunction
src/components/MonthlyTrends.tsx:83:38
             <div>
               <p className="text-sm text-gray-600 mb-1">6-Month Total</p>
               <p className="text-xl font-bold text-gray-900">
-                ${monthlyData.reduce((sum, m) => sum + m.total, 0).toFixed(2)}
+                ${monthlyData.reduce(() => undefined, 0).toFixed(2)}
               </p>
             </div>

[Survived] ArithmeticOperator
src/components/MonthlyTrends.tsx:89:20
             <div>
               <p className="text-sm text-gray-600 mb-1">Monthly Average</p>
               <p className="text-xl font-bold text-gray-900">
-                ${(monthlyData.reduce((sum, m) => sum + m.total, 0) / 6).toFixed(2)}
+                ${(monthlyData.reduce((sum, m) => sum + m.total, 0) * 6).toFixed(2)}
               </p>
             </div>

[Survived] ArrowFunction
src/components/MonthlyTrends.tsx:89:39
             <div>
               <p className="text-sm text-gray-600 mb-1">Monthly Average</p>
               <p className="text-xl font-bold text-gray-900">
-                ${(monthlyData.reduce((sum, m) => sum + m.total, 0) / 6).toFixed(2)}
+                ${(monthlyData.reduce(() => undefined, 0) / 6).toFixed(2)}
               </p>
             </div>

[Survived] ArithmeticOperator
src/components/MonthlyTrends.tsx:95:31
             <div>
               <p className="text-sm text-gray-600 mb-1">This Month</p>
               <p className="text-xl font-bold text-orange-500">
-                ${monthlyData[monthlyData.length - 1].total.toFixed(2)}
+                ${monthlyData[monthlyData.length + 1].total.toFixed(2)}
               </p>
             </div>
