[Survived] BlockStatement
src/components/PieChart.tsx:12:54
 export function PieChart({ categories, transactions }: PieChartProps) {
   const [hoveredIndex, setHoveredIndex] = useState<number | null>(null);
 
-  const getSpentByCategory = (categoryId: string) => {
-    return transactions
-      .filter(t => t.category_id === categoryId)
-      .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
-  };
+  const getSpentByCategory = (categoryId: string) => {};
 
   const totalSpent = transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);

[Survived] MethodExpression
src/components/PieChart.tsx:13:12
   const [hoveredIndex, setHoveredIndex] = useState<number | null>(null);
 
   const getSpentByCategory = (categoryId: string) => {
-    return transactions
-      .filter(t => t.category_id === categoryId)
+    return transactions
       .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   };

[Survived] ConditionalExpression
src/components/PieChart.tsx:14:20
 
   const getSpentByCategory = (categoryId: string) => {
     return transactions
-      .filter(t => t.category_id === categoryId)
+      .filter(t => false)
       .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   };

[Survived] EqualityOperator
src/components/PieChart.tsx:14:20
 
   const getSpentByCategory = (categoryId: string) => {
     return transactions
-      .filter(t => t.category_id === categoryId)
+      .filter(t => t.category_id !== categoryId)
       .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   };

[Survived] ArithmeticOperator
src/components/PieChart.tsx:18:54
       .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   };
 
-  const totalSpent = transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
+  const totalSpent = transactions.reduce((sum, t) => sum - parseFloat(t.amount.toString()), 0);
 
   const chartData = categories

[Survived] ArrowFunction
src/components/PieChart.tsx:18:42
       .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   };
 
-  const totalSpent = transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
+  const totalSpent = transactions.reduce(() => undefined, 0);
 
   const chartData = categories

[Survived] MethodExpression
src/components/PieChart.tsx:20:21
 
   const totalSpent = transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
 
-  const chartData = categories
-    .map(category => ({
-      ...category,
-      spent: getSpentByCategory(category.id),
-      percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
-    }))
-    .filter(item => item.spent > 0)
+  const chartData = categories.map(category => ({
+  ...category,
+  spent: getSpentByCategory(category.id),
+  percentage: totalSpent > 0 ? getSpentByCategory(category.id) / totalSpent * 100 : 0
+}))
     .sort((a, b) => b.spent - a.spent);
 

[Survived] MethodExpression
src/components/PieChart.tsx:20:21
 
   const totalSpent = transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
 
-  const chartData = categories
-    .map(category => ({
-      ...category,
-      spent: getSpentByCategory(category.id),
-      percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
-    }))
-    .filter(item => item.spent > 0)
-    .sort((a, b) => b.spent - a.spent);
+  const chartData = categories.map(category => ({
+  ...category,
+  spent: getSpentByCategory(category.id),
+  percentage: totalSpent > 0 ? getSpentByCategory(category.id) / totalSpent * 100 : 0
+})).filter(item => item.spent > 0);
 
   if (chartData.length === 0) {

[Survived] ArrowFunction
src/components/PieChart.tsx:21:10
   const totalSpent = transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
 
   const chartData = categories
-    .map(category => ({
-      ...category,
-      spent: getSpentByCategory(category.id),
-      percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
-    }))
+    .map(() => undefined)
     .filter(item => item.spent > 0)
     .sort((a, b) => b.spent - a.spent);

[Survived] ConditionalExpression
src/components/PieChart.tsx:24:19
     .map(category => ({
       ...category,
       spent: getSpentByCategory(category.id),
-      percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
+      percentage: false ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
     }))
     .filter(item => item.spent > 0)

[Survived] ConditionalExpression
src/components/PieChart.tsx:24:19
     .map(category => ({
       ...category,
       spent: getSpentByCategory(category.id),
-      percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
+      percentage: true ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
     }))
     .filter(item => item.spent > 0)

[Survived] EqualityOperator
src/components/PieChart.tsx:26:21
       spent: getSpentByCategory(category.id),
       percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
     }))
-    .filter(item => item.spent > 0)
+    .filter(item => item.spent >= 0)
     .sort((a, b) => b.spent - a.spent);
 

[Survived] EqualityOperator
src/components/PieChart.tsx:26:21
       spent: getSpentByCategory(category.id),
       percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
     }))
-    .filter(item => item.spent > 0)
+    .filter(item => item.spent <= 0)
     .sort((a, b) => b.spent - a.spent);
 

[Survived] ArithmeticOperator
src/components/PieChart.tsx:27:21
       percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
     }))
     .filter(item => item.spent > 0)
-    .sort((a, b) => b.spent - a.spent);
+    .sort((a, b) => b.spent + a.spent);
 
   if (chartData.length === 0) {

[Survived] ArrowFunction
src/components/PieChart.tsx:27:11
       percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
     }))
     .filter(item => item.spent > 0)
-    .sort((a, b) => b.spent - a.spent);
+    .sort(() => undefined);
 
   if (chartData.length === 0) {

[Survived] ConditionalExpression
src/components/PieChart.tsx:29:7
     .filter(item => item.spent > 0)
     .sort((a, b) => b.spent - a.spent);
 
-  if (chartData.length === 0) {
+  if (true) {
     return (
       <div className="bg-white rounded-xl shadow-sm border border-gray-200 p-8 text-center">

[Survived] BlockStatement
src/components/PieChart.tsx:29:31
     .filter(item => item.spent > 0)
     .sort((a, b) => b.spent - a.spent);
 
-  if (chartData.length === 0) {
-    return (
-      <div className="bg-white rounded-xl shadow-sm border border-gray-200 p-8 text-center">
-        <p className="text-gray-500">No spending data available</p>
-      </div>
-    );
-  }
+  if (chartData.length === 0) {}
 
   let currentAngle = -90;

[Survived] UnaryOperator
src/components/PieChart.tsx:37:22
     );
   }
 
-  let currentAngle = -90;
+  let currentAngle = +90;
   const slices = chartData.map((item, index) => {
     const angle = (item.percentage / 100) * 360;

[Survived] BlockStatement
src/components/PieChart.tsx:38:49
   }
 
   let currentAngle = -90;
-  const slices = chartData.map((item, index) => {
-    const angle = (item.percentage / 100) * 360;
-    const startAngle = currentAngle;
-    const endAngle = currentAngle + angle;
-    currentAngle = endAngle;
-
-    const startRad = (startAngle * Math.PI) / 180;
-    const endRad = (endAngle * Math.PI) / 180;
-
-    const x1 = 100 + 80 * Math.cos(startRad);
-    const y1 = 100 + 80 * Math.sin(startRad);
-    const x2 = 100 + 80 * Math.cos(endRad);
-    const y2 = 100 + 80 * Math.sin(endRad);
-
-    const largeArc = angle > 180 ? 1 : 0;
-
-    const path = `M 100 100 L ${x1} ${y1} A 80 80 0 ${largeArc} 1 ${x2} ${y2} Z`;
-
-    return {
-      ...item,
-      path,
-      index
-    };
-  });
+  const slices = chartData.map((item, index) => {});
 
   return (

[Survived] ArithmeticOperator
src/components/PieChart.tsx:39:20
 
   let currentAngle = -90;
   const slices = chartData.map((item, index) => {
-    const angle = (item.percentage / 100) * 360;
+    const angle = (item.percentage * 100) * 360;
     const startAngle = currentAngle;
     const endAngle = currentAngle + angle;

[Survived] ArithmeticOperator
src/components/PieChart.tsx:39:19
 
   let currentAngle = -90;
   const slices = chartData.map((item, index) => {
-    const angle = (item.percentage / 100) * 360;
+    const angle = item.percentage / 100 / 360;
     const startAngle = currentAngle;
     const endAngle = currentAngle + angle;

[Survived] ArithmeticOperator
src/components/PieChart.tsx:41:22
   const slices = chartData.map((item, index) => {
     const angle = (item.percentage / 100) * 360;
     const startAngle = currentAngle;
-    const endAngle = currentAngle + angle;
+    const endAngle = currentAngle - angle;
     currentAngle = endAngle;
 

[Survived] ArithmeticOperator
src/components/PieChart.tsx:44:22
     const endAngle = currentAngle + angle;
     currentAngle = endAngle;
 
-    const startRad = (startAngle * Math.PI) / 180;
+    const startRad = startAngle * Math.PI * 180;
     const endRad = (endAngle * Math.PI) / 180;
 

[Survived] ArithmeticOperator
src/components/PieChart.tsx:44:23
     const endAngle = currentAngle + angle;
     currentAngle = endAngle;
 
-    const startRad = (startAngle * Math.PI) / 180;
+    const startRad = (startAngle / Math.PI) / 180;
     const endRad = (endAngle * Math.PI) / 180;
 

[Survived] ArithmeticOperator
src/components/PieChart.tsx:45:21
     currentAngle = endAngle;
 
     const startRad = (startAngle * Math.PI) / 180;
-    const endRad = (endAngle * Math.PI) / 180;
+    const endRad = (endAngle / Math.PI) / 180;
 
     const x1 = 100 + 80 * Math.cos(startRad);

[Survived] ArithmeticOperator
src/components/PieChart.tsx:45:20
     currentAngle = endAngle;
 
     const startRad = (startAngle * Math.PI) / 180;
-    const endRad = (endAngle * Math.PI) / 180;
+    const endRad = endAngle * Math.PI * 180;
 
     const x1 = 100 + 80 * Math.cos(startRad);

[Survived] ArithmeticOperator
src/components/PieChart.tsx:47:22
     const startRad = (startAngle * Math.PI) / 180;
     const endRad = (endAngle * Math.PI) / 180;
 
-    const x1 = 100 + 80 * Math.cos(startRad);
+    const x1 = 100 + 80 / Math.cos(startRad);
     const y1 = 100 + 80 * Math.sin(startRad);
     const x2 = 100 + 80 * Math.cos(endRad);

[Survived] ArithmeticOperator
src/components/PieChart.tsx:47:16
     const startRad = (startAngle * Math.PI) / 180;
     const endRad = (endAngle * Math.PI) / 180;
 
-    const x1 = 100 + 80 * Math.cos(startRad);
+    const x1 = 100 - 80 * Math.cos(startRad);
     const y1 = 100 + 80 * Math.sin(startRad);
     const x2 = 100 + 80 * Math.cos(endRad);

[Survived] ArithmeticOperator
src/components/PieChart.tsx:48:22
     const endRad = (endAngle * Math.PI) / 180;
 
     const x1 = 100 + 80 * Math.cos(startRad);
-    const y1 = 100 + 80 * Math.sin(startRad);
+    const y1 = 100 + 80 / Math.sin(startRad);
     const x2 = 100 + 80 * Math.cos(endRad);
     const y2 = 100 + 80 * Math.sin(endRad);

[Survived] ArithmeticOperator
src/components/PieChart.tsx:48:16
     const endRad = (endAngle * Math.PI) / 180;
 
     const x1 = 100 + 80 * Math.cos(startRad);
-    const y1 = 100 + 80 * Math.sin(startRad);
+    const y1 = 100 - 80 * Math.sin(startRad);
     const x2 = 100 + 80 * Math.cos(endRad);
     const y2 = 100 + 80 * Math.sin(endRad);

[Survived] ArithmeticOperator
src/components/PieChart.tsx:49:16
 
     const x1 = 100 + 80 * Math.cos(startRad);
     const y1 = 100 + 80 * Math.sin(startRad);
-    const x2 = 100 + 80 * Math.cos(endRad);
+    const x2 = 100 - 80 * Math.cos(endRad);
     const y2 = 100 + 80 * Math.sin(endRad);
 

[Survived] ArithmeticOperator
src/components/PieChart.tsx:49:22
 
     const x1 = 100 + 80 * Math.cos(startRad);
     const y1 = 100 + 80 * Math.sin(startRad);
-    const x2 = 100 + 80 * Math.cos(endRad);
+    const x2 = 100 + 80 / Math.cos(endRad);
     const y2 = 100 + 80 * Math.sin(endRad);
 

[Survived] ArithmeticOperator
src/components/PieChart.tsx:50:16
     const x1 = 100 + 80 * Math.cos(startRad);
     const y1 = 100 + 80 * Math.sin(startRad);
     const x2 = 100 + 80 * Math.cos(endRad);
-    const y2 = 100 + 80 * Math.sin(endRad);
+    const y2 = 100 - 80 * Math.sin(endRad);
 
     const largeArc = angle > 180 ? 1 : 0;

[Survived] ArithmeticOperator
src/components/PieChart.tsx:50:22
     const x1 = 100 + 80 * Math.cos(startRad);
     const y1 = 100 + 80 * Math.sin(startRad);
     const x2 = 100 + 80 * Math.cos(endRad);
-    const y2 = 100 + 80 * Math.sin(endRad);
+    const y2 = 100 + 80 / Math.sin(endRad);
 
     const largeArc = angle > 180 ? 1 : 0;

[Survived] ConditionalExpression
src/components/PieChart.tsx:52:22
     const x2 = 100 + 80 * Math.cos(endRad);
     const y2 = 100 + 80 * Math.sin(endRad);
 
-    const largeArc = angle > 180 ? 1 : 0;
+    const largeArc = false ? 1 : 0;
 
     const path = `M 100 100 L ${x1} ${y1} A 80 80 0 ${largeArc} 1 ${x2} ${y2} Z`;

[Survived] ConditionalExpression
src/components/PieChart.tsx:52:22
     const x2 = 100 + 80 * Math.cos(endRad);
     const y2 = 100 + 80 * Math.sin(endRad);
 
-    const largeArc = angle > 180 ? 1 : 0;
+    const largeArc = true ? 1 : 0;
 
     const path = `M 100 100 L ${x1} ${y1} A 80 80 0 ${largeArc} 1 ${x2} ${y2} Z`;

[Survived] ObjectLiteral
src/components/PieChart.tsx:68:42
       <h3 className="text-lg font-semibold text-gray-900 mb-6">Spending Distribution</h3>
 
       <div className="flex flex-col lg:flex-row items-center gap-8">
-        <div className="relative" style={{ width: '280px', height: '280px' }}>
+        <div className="relative" style={{}}>
           <svg viewBox="0 0 200 200" className="w-full h-full transform rotate-0">
             {slices.map((slice) => (

[Survived] StringLiteral
src/components/PieChart.tsx:68:51
       <h3 className="text-lg font-semibold text-gray-900 mb-6">Spending Distribution</h3>
 
       <div className="flex flex-col lg:flex-row items-center gap-8">
-        <div className="relative" style={{ width: '280px', height: '280px' }}>
+        <div className="relative" style={{ width: "", height: '280px' }}>
           <svg viewBox="0 0 200 200" className="w-full h-full transform rotate-0">
             {slices.map((slice) => (

[Survived] ArrowFunction
src/components/PieChart.tsx:70:25
       <div className="flex flex-col lg:flex-row items-center gap-8">
         <div className="relative" style={{ width: '280px', height: '280px' }}>
           <svg viewBox="0 0 200 200" className="w-full h-full transform rotate-0">
-            {slices.map((slice) => (
-              <g key={slice.id}>
-                <path
-                  d={slice.path}
-                  fill={slice.color}
-                  className="transition-all duration-300 cursor-pointer"
-                  style={{
-                    opacity: hoveredIndex === null || hoveredIndex === slice.index ? 1 : 0.3,
-                    transform:
-                      hoveredIndex === slice.index
-                        ? 'scale(1.05)'
-                        : 'scale(1)',
-                    transformOrigin: '100px 100px'
-                  }}
-                  onMouseEnter={() => setHoveredIndex(slice.index)}
-                  onMouseLeave={() => setHoveredIndex(null)}
-                />
-              </g>
-            ))}
+            {slices.map(() => undefined)}
             <circle cx="100" cy="100" r="45" fill="white" />
             <text

[Survived] ConditionalExpression
src/components/PieChart.tsx:77:55
                   fill={slice.color}
                   className="transition-all duration-300 cursor-pointer"
                   style={{
-                    opacity: hoveredIndex === null || hoveredIndex === slice.index ? 1 : 0.3,
+                    opacity: hoveredIndex === null || false ? 1 : 0.3,
                     transform:
                       hoveredIndex === slice.index

[Survived] ConditionalExpression
src/components/PieChart.tsx:77:30
                   fill={slice.color}
                   className="transition-all duration-300 cursor-pointer"
                   style={{
-                    opacity: hoveredIndex === null || hoveredIndex === slice.index ? 1 : 0.3,
+                    opacity: true ? 1 : 0.3,
                     transform:
                       hoveredIndex === slice.index

[Survived] ConditionalExpression
src/components/PieChart.tsx:79:23
                   style={{
                     opacity: hoveredIndex === null || hoveredIndex === slice.index ? 1 : 0.3,
                     transform:
-                      hoveredIndex === slice.index
+                      true
                         ? 'scale(1.05)'
                         : 'scale(1)',

[Survived] ConditionalExpression
src/components/PieChart.tsx:79:23
                   style={{
                     opacity: hoveredIndex === null || hoveredIndex === slice.index ? 1 : 0.3,
                     transform:
-                      hoveredIndex === slice.index
+                      false
                         ? 'scale(1.05)'
                         : 'scale(1)',

[Survived] StringLiteral
src/components/PieChart.tsx:82:38
                       hoveredIndex === slice.index
                         ? 'scale(1.05)'
                         : 'scale(1)',
-                    transformOrigin: '100px 100px'
+                    transformOrigin: ""
                   }}
                   onMouseEnter={() => setHoveredIndex(slice.index)}

[Survived] ArrowFunction
src/components/PieChart.tsx:84:33
                         : 'scale(1)',
                     transformOrigin: '100px 100px'
                   }}
-                  onMouseEnter={() => setHoveredIndex(slice.index)}
+                  onMouseEnter={() => undefined}
                   onMouseLeave={() => setHoveredIndex(null)}
                 />

[Survived] ArrowFunction
src/components/PieChart.tsx:85:33
                     transformOrigin: '100px 100px'
                   }}
                   onMouseEnter={() => setHoveredIndex(slice.index)}
-                  onMouseLeave={() => setHoveredIndex(null)}
+                  onMouseLeave={() => undefined}
                 />
               </g>

[Survived] ArrowFunction
src/components/PieChart.tsx:111:28
 
         <div className="flex-1 w-full">
           <div className="space-y-3">
-            {chartData.map((item, index) => (
-              <div
-                key={item.id}
-                className="flex items-center justify-between p-3 rounded-lg transition-all duration-200 cursor-pointer"
-                style={{
-                  backgroundColor: hoveredIndex === index ? `${item.color}15` : 'transparent',
-                  borderLeft: `4px solid ${item.color}`
-                }}
-                onMouseEnter={() => setHoveredIndex(index)}
-                onMouseLeave={() => setHoveredIndex(null)}
-              >
-                <div className="flex items-center gap-3">
-                  <div
-                    className="w-4 h-4 rounded-full"
-                    style={{ backgroundColor: item.color }}
-                  />
-                  <span className="font-medium text-gray-900">{item.name}</span>
-                </div>
-                <div className="text-right">
-                  <div className="font-bold text-gray-900">${item.spent.toFixed(2)}</div>
-                  <div className="text-sm text-gray-600">{item.percentage.toFixed(1)}%</div>
-                </div>
-              </div>
-            ))}
+            {chartData.map(() => undefined)}
           </div>
         </div>

[Survived] EqualityOperator
src/components/PieChart.tsx:116:36
                 key={item.id}
                 className="flex items-center justify-between p-3 rounded-lg transition-all duration-200 cursor-pointer"
                 style={{
-                  backgroundColor: hoveredIndex === index ? `${item.color}15` : 'transparent',
+                  backgroundColor: hoveredIndex !== index ? `${item.color}15` : 'transparent',
                   borderLeft: `4px solid ${item.color}`
                 }}

[Survived] ConditionalExpression
src/components/PieChart.tsx:116:36
                 key={item.id}
                 className="flex items-center justify-between p-3 rounded-lg transition-all duration-200 cursor-pointer"
                 style={{
-                  backgroundColor: hoveredIndex === index ? `${item.color}15` : 'transparent',
+                  backgroundColor: true ? `${item.color}15` : 'transparent',
                   borderLeft: `4px solid ${item.color}`
                 }}

[Survived] ArrowFunction
src/components/PieChart.tsx:119:31
                   backgroundColor: hoveredIndex === index ? `${item.color}15` : 'transparent',
                   borderLeft: `4px solid ${item.color}`
                 }}
-                onMouseEnter={() => setHoveredIndex(index)}
+                onMouseEnter={() => undefined}
                 onMouseLeave={() => setHoveredIndex(null)}
               >

[Survived] ObjectLiteral
src/components/PieChart.tsx:125:28
                 <div className="flex items-center gap-3">
                   <div
                     className="w-4 h-4 rounded-full"
-                    style={{ backgroundColor: item.color }}
+                    style={{}}
                   />
                   <span className="font-medium text-gray-900">{item.name}</span>
