[Survived] BlockStatement
src/components/SpendingChart.tsx:9:54
 }
 
 export function SpendingChart({ categories, transactions }: SpendingChartProps) {
-  const getSpentByCategory = (categoryId: string) => {
-    return transactions
-      .filter(t => t.category_id === categoryId)
-      .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
-  };
+  const getSpentByCategory = (categoryId: string) => {};
 
   const totalSpent = transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);

[Survived] ArrowFunction
src/components/SpendingChart.tsx:11:15
 export function SpendingChart({ categories, transactions }: SpendingChartProps) {
   const getSpentByCategory = (categoryId: string) => {
     return transactions
-      .filter(t => t.category_id === categoryId)
+      .filter(() => undefined)
       .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   };

[Survived] ArrowFunction
src/components/SpendingChart.tsx:17:36
 
   const totalSpent = transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
 
-  const chartData = categories.map(category => ({
-    ...category,
-    spent: getSpentByCategory(category.id),
-    percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
-  })).filter(item => item.spent > 0);
+  const chartData = categories.map(() => undefined).filter(item => item.spent > 0);
 
   const maxSpent = Math.max(...chartData.map(d => d.spent), 1);

[Survived] MethodExpression
src/components/SpendingChart.tsx:17:21
 
   const totalSpent = transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
 
-  const chartData = categories.map(category => ({
-    ...category,
-    spent: getSpentByCategory(category.id),
-    percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
-  })).filter(item => item.spent > 0);
+  const chartData = categories.map(category => ({
+  ...category,
+  spent: getSpentByCategory(category.id),
+  percentage: totalSpent > 0 ? getSpentByCategory(category.id) / totalSpent * 100 : 0
+}));
 
   const maxSpent = Math.max(...chartData.map(d => d.spent), 1);

[Survived] EqualityOperator
src/components/SpendingChart.tsx:20:17
   const chartData = categories.map(category => ({
     ...category,
     spent: getSpentByCategory(category.id),
-    percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
+    percentage: totalSpent <= 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
   })).filter(item => item.spent > 0);
 

[Survived] ArithmeticOperator
src/components/SpendingChart.tsx:20:34
   const chartData = categories.map(category => ({
     ...category,
     spent: getSpentByCategory(category.id),
-    percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
+    percentage: totalSpent > 0 ? getSpentByCategory(category.id) / totalSpent / 100 : 0
   })).filter(item => item.spent > 0);
 

[Survived] ConditionalExpression
src/components/SpendingChart.tsx:21:22
     ...category,
     spent: getSpentByCategory(category.id),
     percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
-  })).filter(item => item.spent > 0);
+  })).filter(item => false);
 
   const maxSpent = Math.max(...chartData.map(d => d.spent), 1);

[Survived] ConditionalExpression
src/components/SpendingChart.tsx:21:22
     ...category,
     spent: getSpentByCategory(category.id),
     percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
-  })).filter(item => item.spent > 0);
+  })).filter(item => true);
 
   const maxSpent = Math.max(...chartData.map(d => d.spent), 1);

[Survived] MethodExpression
src/components/SpendingChart.tsx:23:20
     percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
   })).filter(item => item.spent > 0);
 
-  const maxSpent = Math.max(...chartData.map(d => d.spent), 1);
+  const maxSpent = Math.min(...chartData.map(d => d.spent), 1);
 
   if (chartData.length === 0) {

[Survived] ArrowFunction
src/components/SpendingChart.tsx:23:46
     percentage: totalSpent > 0 ? (getSpentByCategory(category.id) / totalSpent) * 100 : 0
   })).filter(item => item.spent > 0);
 
-  const maxSpent = Math.max(...chartData.map(d => d.spent), 1);
+  const maxSpent = Math.max(...chartData.map(() => undefined), 1);
 
   if (chartData.length === 0) {

[Survived] ConditionalExpression
src/components/SpendingChart.tsx:25:7
 
   const maxSpent = Math.max(...chartData.map(d => d.spent), 1);
 
-  if (chartData.length === 0) {
+  if (false) {
     return (
       <div className="bg-white rounded-xl shadow-sm border border-gray-200 p-8 text-center">

[Survived] BlockStatement
src/components/SpendingChart.tsx:25:31
 
   const maxSpent = Math.max(...chartData.map(d => d.spent), 1);
 
-  if (chartData.length === 0) {
-    return (
-      <div className="bg-white rounded-xl shadow-sm border border-gray-200 p-8 text-center">
-        <p className="text-gray-500">No spending data yet. Add transactions to see charts!</p>
-      </div>
-    );
-  }
+  if (chartData.length === 0) {}
 
   return (

[Survived] ArrowFunction
src/components/SpendingChart.tsx:38:26
       <div className="bg-white rounded-xl shadow-sm border border-gray-200 p-6">
         <h3 className="text-lg font-semibold text-gray-900 mb-6">Spending by Category</h3>
         <div className="space-y-4">
-          {chartData.map((item) => (
-            <div key={item.id}>
-              <div className="flex items-center justify-between mb-2">
-                <span className="text-sm font-medium text-gray-700">{item.name}</span>
-                <span className="text-sm font-semibold text-gray-900">
-                  ${item.spent.toFixed(2)} ({item.percentage.toFixed(1)}%)
-                </span>
-              </div>
-              <div className="h-3 bg-gray-100 rounded-full overflow-hidden">
-                <div
-                  className="h-full rounded-full transition-all duration-500"
-                  style={{
-                    width: `${(item.spent / maxSpent) * 100}%`,
-                    backgroundColor: item.color
-                  }}
-                />
-              </div>
-            </div>
-          ))}
+          {chartData.map(() => undefined)}
         </div>
       </div>

[Survived] ArithmeticOperator
src/components/SpendingChart.tsx:50:32
                 <div
                   className="h-full rounded-full transition-all duration-500"
                   style={{
-                    width: `${(item.spent / maxSpent) * 100}%`,
+                    width: `${(item.spent * maxSpent) * 100}%`,
                     backgroundColor: item.color
                   }}

[Survived] ArithmeticOperator
src/components/SpendingChart.tsx:50:31
                 <div
                   className="h-full rounded-full transition-all duration-500"
                   style={{
-                    width: `${(item.spent / maxSpent) * 100}%`,
+                    width: `${item.spent / maxSpent / 100}%`,
                     backgroundColor: item.color
                   }}

[Survived] ArithmeticOperator
src/components/SpendingChart.tsx:64:31
         <h3 className="text-lg font-semibold text-gray-900 mb-6">Budget vs Actual</h3>
         <div className="space-y-4">
           {chartData.map((item) => {
-            const remaining = item.budget_amount - item.spent;
+            const remaining = item.budget_amount + item.spent;
             const isOverBudget = remaining < 0;
 

[Survived] ConditionalExpression
src/components/SpendingChart.tsx:65:34
         <div className="space-y-4">
           {chartData.map((item) => {
             const remaining = item.budget_amount - item.spent;
-            const isOverBudget = remaining < 0;
+            const isOverBudget = true;
 
             return (

[Survived] ConditionalExpression
src/components/SpendingChart.tsx:65:34
         <div className="space-y-4">
           {chartData.map((item) => {
             const remaining = item.budget_amount - item.spent;
-            const isOverBudget = remaining < 0;
+            const isOverBudget = false;
 
             return (

[Survived] MethodExpression
src/components/SpendingChart.tsx:80:33
                   <div
                     className="absolute h-full rounded-full transition-all duration-500"
                     style={{
-                      width: `${Math.min((item.spent / item.budget_amount) * 100, 100)}%`,
+                      width: `${Math.max(item.spent / item.budget_amount * 100, 100)}%`,
                       backgroundColor: isOverBudget ? '#ef4444' : item.color
                     }}

[Survived] ArithmeticOperator
src/components/SpendingChart.tsx:80:42
                   <div
                     className="absolute h-full rounded-full transition-all duration-500"
                     style={{
-                      width: `${Math.min((item.spent / item.budget_amount) * 100, 100)}%`,
+                      width: `${Math.min(item.spent / item.budget_amount / 100, 100)}%`,
                       backgroundColor: isOverBudget ? '#ef4444' : item.color
                     }}

[Survived] StringLiteral
src/components/SpendingChart.tsx:81:55
                     className="absolute h-full rounded-full transition-all duration-500"
                     style={{
                       width: `${Math.min((item.spent / item.budget_amount) * 100, 100)}%`,
-                      backgroundColor: isOverBudget ? '#ef4444' : item.color
+                      backgroundColor: isOverBudget ? "" : item.color
                     }}
                   />

[Survived] ConditionalExpression
src/components/SpendingChart.tsx:84:20
                       backgroundColor: isOverBudget ? '#ef4444' : item.color
                     }}
                   />
-                  {isOverBudget && (
-                    <div
-                      className="absolute h-full bg-red-200 rounded-full"
-                      style={{
-                        left: '100%',
-                        width: `${((item.spent - item.budget_amount) / item.budget_amount) * 100}%`
-                      }}
-                    />
-                  )}
+                  {true}
                 </div>
                 {isOverBudget && (

[Survived] ConditionalExpression
src/components/SpendingChart.tsx:84:20
                       backgroundColor: isOverBudget ? '#ef4444' : item.color
                     }}
                   />
-                  {isOverBudget && (
-                    <div
-                      className="absolute h-full bg-red-200 rounded-full"
-                      style={{
-                        left: '100%',
-                        width: `${((item.spent - item.budget_amount) / item.budget_amount) * 100}%`
-                      }}
-                    />
-                  )}
+                  {false}
                 </div>
                 {isOverBudget && (

[Survived] ArithmeticOperator
src/components/SpendingChart.tsx:89:37
                       className="absolute h-full bg-red-200 rounded-full"
                       style={{
                         left: '100%',
-                        width: `${((item.spent - item.budget_amount) / item.budget_amount) * 100}%`
+                        width: `${((item.spent + item.budget_amount) / item.budget_amount) * 100}%`
                       }}
                     />

[Survived] ArithmeticOperator
src/components/SpendingChart.tsx:89:35
                       className="absolute h-full bg-red-200 rounded-full"
                       style={{
                         left: '100%',
-                        width: `${((item.spent - item.budget_amount) / item.budget_amount) * 100}%`
+                        width: `${(item.spent - item.budget_amount) / item.budget_amount / 100}%`
                       }}
                     />

[Survived] ConditionalExpression
src/components/SpendingChart.tsx:94:18
                     />
                   )}
                 </div>
-                {isOverBudget && (
-                  <p className="text-xs text-red-600 mt-1">
-                    Over budget by ${Math.abs(remaining).toFixed(2)}
-                  </p>
-                )}
+                {false}
               </div>
             );

[Survived] LogicalOperator
src/components/SpendingChart.tsx:94:18
                     />
                   )}
                 </div>
-                {isOverBudget && (
-                  <p className="text-xs text-red-600 mt-1">
-                    Over budget by ${Math.abs(remaining).toFixed(2)}
-                  </p>
-                )}
+                {isOverBudget || <p className="text-xs text-red-600 mt-1">
+                    Over budget by ${Math.abs(remaining).toFixed(2)}
+                  </p>}
               </div>
             );
