[Survived] BlockStatement
src/components/SpendingInsights.tsx:10:54
 }
 
 export function SpendingInsights({ categories, transactions }: SpendingInsightsProps) {
-  const getSpentByCategory = (categoryId: string) => {
-    return transactions
-      .filter(t => t.category_id === categoryId)
-      .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
-  };
+  const getSpentByCategory = (categoryId: string) => {};
 
   const now = new Date();

[Survived] MethodExpression
src/components/SpendingInsights.tsx:20:33
   const currentMonth = now.getMonth();
   const currentYear = now.getFullYear();
 
-  const thisMonthTransactions = transactions.filter(t => {
-    const date = new Date(t.transaction_date);
-    return date.getMonth() === currentMonth && date.getFullYear() === currentYear;
-  });
+  const thisMonthTransactions = transactions;
 
   const lastMonthTransactions = transactions.filter(t => {

[Survived] BlockStatement
src/components/SpendingInsights.tsx:20:58
   const currentMonth = now.getMonth();
   const currentYear = now.getFullYear();
 
-  const thisMonthTransactions = transactions.filter(t => {
-    const date = new Date(t.transaction_date);
-    return date.getMonth() === currentMonth && date.getFullYear() === currentYear;
-  });
+  const thisMonthTransactions = transactions.filter(t => {});
 
   const lastMonthTransactions = transactions.filter(t => {

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:22:48
 
   const thisMonthTransactions = transactions.filter(t => {
     const date = new Date(t.transaction_date);
-    return date.getMonth() === currentMonth && date.getFullYear() === currentYear;
+    return date.getMonth() === currentMonth && true;
   });
 

[Survived] LogicalOperator
src/components/SpendingInsights.tsx:22:12
 
   const thisMonthTransactions = transactions.filter(t => {
     const date = new Date(t.transaction_date);
-    return date.getMonth() === currentMonth && date.getFullYear() === currentYear;
+    return date.getMonth() === currentMonth || date.getFullYear() === currentYear;
   });
 

[Survived] MethodExpression
src/components/SpendingInsights.tsx:25:33
     return date.getMonth() === currentMonth && date.getFullYear() === currentYear;
   });
 
-  const lastMonthTransactions = transactions.filter(t => {
-    const date = new Date(t.transaction_date);
-    const lastMonth = currentMonth === 0 ? 11 : currentMonth - 1;
-    const lastMonthYear = currentMonth === 0 ? currentYear - 1 : currentYear;
-    return date.getMonth() === lastMonth && date.getFullYear() === lastMonthYear;
-  });
+  const lastMonthTransactions = transactions;
 
   const thisMonthSpent = thisMonthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);

[Survived] BlockStatement
src/components/SpendingInsights.tsx:25:58
     return date.getMonth() === currentMonth && date.getFullYear() === currentYear;
   });
 
-  const lastMonthTransactions = transactions.filter(t => {
-    const date = new Date(t.transaction_date);
-    const lastMonth = currentMonth === 0 ? 11 : currentMonth - 1;
-    const lastMonthYear = currentMonth === 0 ? currentYear - 1 : currentYear;
-    return date.getMonth() === lastMonth && date.getFullYear() === lastMonthYear;
-  });
+  const lastMonthTransactions = transactions.filter(t => {});
 
   const thisMonthSpent = thisMonthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:27:23
 
   const lastMonthTransactions = transactions.filter(t => {
     const date = new Date(t.transaction_date);
-    const lastMonth = currentMonth === 0 ? 11 : currentMonth - 1;
+    const lastMonth = false ? 11 : currentMonth - 1;
     const lastMonthYear = currentMonth === 0 ? currentYear - 1 : currentYear;
     return date.getMonth() === lastMonth && date.getFullYear() === lastMonthYear;

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:27:23
 
   const lastMonthTransactions = transactions.filter(t => {
     const date = new Date(t.transaction_date);
-    const lastMonth = currentMonth === 0 ? 11 : currentMonth - 1;
+    const lastMonth = true ? 11 : currentMonth - 1;
     const lastMonthYear = currentMonth === 0 ? currentYear - 1 : currentYear;
     return date.getMonth() === lastMonth && date.getFullYear() === lastMonthYear;

[Survived] EqualityOperator
src/components/SpendingInsights.tsx:28:27
   const lastMonthTransactions = transactions.filter(t => {
     const date = new Date(t.transaction_date);
     const lastMonth = currentMonth === 0 ? 11 : currentMonth - 1;
-    const lastMonthYear = currentMonth === 0 ? currentYear - 1 : currentYear;
+    const lastMonthYear = currentMonth !== 0 ? currentYear - 1 : currentYear;
     return date.getMonth() === lastMonth && date.getFullYear() === lastMonthYear;
   });

[Survived] ArithmeticOperator
src/components/SpendingInsights.tsx:28:48
   const lastMonthTransactions = transactions.filter(t => {
     const date = new Date(t.transaction_date);
     const lastMonth = currentMonth === 0 ? 11 : currentMonth - 1;
-    const lastMonthYear = currentMonth === 0 ? currentYear - 1 : currentYear;
+    const lastMonthYear = currentMonth === 0 ? currentYear + 1 : currentYear;
     return date.getMonth() === lastMonth && date.getFullYear() === lastMonthYear;
   });

[Survived] LogicalOperator
src/components/SpendingInsights.tsx:29:12
     const date = new Date(t.transaction_date);
     const lastMonth = currentMonth === 0 ? 11 : currentMonth - 1;
     const lastMonthYear = currentMonth === 0 ? currentYear - 1 : currentYear;
-    return date.getMonth() === lastMonth && date.getFullYear() === lastMonthYear;
+    return date.getMonth() === lastMonth || date.getFullYear() === lastMonthYear;
   });
 

[Survived] EqualityOperator
src/components/SpendingInsights.tsx:29:45
     const date = new Date(t.transaction_date);
     const lastMonth = currentMonth === 0 ? 11 : currentMonth - 1;
     const lastMonthYear = currentMonth === 0 ? currentYear - 1 : currentYear;
-    return date.getMonth() === lastMonth && date.getFullYear() === lastMonthYear;
+    return date.getMonth() === lastMonth && date.getFullYear() !== lastMonthYear;
   });
 

[Survived] ArithmeticOperator
src/components/SpendingInsights.tsx:32:67
     return date.getMonth() === lastMonth && date.getFullYear() === lastMonthYear;
   });
 
-  const thisMonthSpent = thisMonthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
+  const thisMonthSpent = thisMonthTransactions.reduce((sum, t) => sum - parseFloat(t.amount.toString()), 0);
   const lastMonthSpent = lastMonthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   const monthChange = lastMonthSpent > 0 ? ((thisMonthSpent - lastMonthSpent) / lastMonthSpent) * 100 : 0;

[Survived] ArrowFunction
src/components/SpendingInsights.tsx:32:55
     return date.getMonth() === lastMonth && date.getFullYear() === lastMonthYear;
   });
 
-  const thisMonthSpent = thisMonthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
+  const thisMonthSpent = thisMonthTransactions.reduce(() => undefined, 0);
   const lastMonthSpent = lastMonthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   const monthChange = lastMonthSpent > 0 ? ((thisMonthSpent - lastMonthSpent) / lastMonthSpent) * 100 : 0;

[Survived] ArrowFunction
src/components/SpendingInsights.tsx:33:55
   });
 
   const thisMonthSpent = thisMonthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
-  const lastMonthSpent = lastMonthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
+  const lastMonthSpent = lastMonthTransactions.reduce(() => undefined, 0);
   const monthChange = lastMonthSpent > 0 ? ((thisMonthSpent - lastMonthSpent) / lastMonthSpent) * 100 : 0;
 

[Survived] ArithmeticOperator
src/components/SpendingInsights.tsx:33:67
   });
 
   const thisMonthSpent = thisMonthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
-  const lastMonthSpent = lastMonthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
+  const lastMonthSpent = lastMonthTransactions.reduce((sum, t) => sum - parseFloat(t.amount.toString()), 0);
   const monthChange = lastMonthSpent > 0 ? ((thisMonthSpent - lastMonthSpent) / lastMonthSpent) * 100 : 0;
 

[Survived] ArithmeticOperator
src/components/SpendingInsights.tsx:34:45
 
   const thisMonthSpent = thisMonthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   const lastMonthSpent = lastMonthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
-  const monthChange = lastMonthSpent > 0 ? ((thisMonthSpent - lastMonthSpent) / lastMonthSpent) * 100 : 0;
+  const monthChange = lastMonthSpent > 0 ? ((thisMonthSpent - lastMonthSpent) * lastMonthSpent) * 100 : 0;
 
   const overBudgetCategories = categories.filter(cat => {

[Survived] EqualityOperator
src/components/SpendingInsights.tsx:34:23
 
   const thisMonthSpent = thisMonthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   const lastMonthSpent = lastMonthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
-  const monthChange = lastMonthSpent > 0 ? ((thisMonthSpent - lastMonthSpent) / lastMonthSpent) * 100 : 0;
+  const monthChange = lastMonthSpent <= 0 ? ((thisMonthSpent - lastMonthSpent) / lastMonthSpent) * 100 : 0;
 
   const overBudgetCategories = categories.filter(cat => {

[Survived] BlockStatement
src/components/SpendingInsights.tsx:36:57
   const lastMonthSpent = lastMonthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   const monthChange = lastMonthSpent > 0 ? ((thisMonthSpent - lastMonthSpent) / lastMonthSpent) * 100 : 0;
 
-  const overBudgetCategories = categories.filter(cat => {
-    const spent = getSpentByCategory(cat.id);
-    return spent > cat.budget_amount;
-  });
+  const overBudgetCategories = categories.filter(cat => {});
 
   const onTrackCategories = categories.filter(cat => {

[Survived] MethodExpression
src/components/SpendingInsights.tsx:36:32
   const lastMonthSpent = lastMonthTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   const monthChange = lastMonthSpent > 0 ? ((thisMonthSpent - lastMonthSpent) / lastMonthSpent) * 100 : 0;
 
-  const overBudgetCategories = categories.filter(cat => {
-    const spent = getSpentByCategory(cat.id);
-    return spent > cat.budget_amount;
-  });
+  const overBudgetCategories = categories;
 
   const onTrackCategories = categories.filter(cat => {

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:38:12
 
   const overBudgetCategories = categories.filter(cat => {
     const spent = getSpentByCategory(cat.id);
-    return spent > cat.budget_amount;
+    return false;
   });
 

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:38:12
 
   const overBudgetCategories = categories.filter(cat => {
     const spent = getSpentByCategory(cat.id);
-    return spent > cat.budget_amount;
+    return true;
   });
 

[Survived] MethodExpression
src/components/SpendingInsights.tsx:41:29
     return spent > cat.budget_amount;
   });
 
-  const onTrackCategories = categories.filter(cat => {
-    const spent = getSpentByCategory(cat.id);
-    return spent <= cat.budget_amount && spent > 0;
-  });
+  const onTrackCategories = categories;
 
   const avgTransactionAmount = transactions.length > 0

[Survived] BlockStatement
src/components/SpendingInsights.tsx:41:54
     return spent > cat.budget_amount;
   });
 
-  const onTrackCategories = categories.filter(cat => {
-    const spent = getSpentByCategory(cat.id);
-    return spent <= cat.budget_amount && spent > 0;
-  });
+  const onTrackCategories = categories.filter(cat => {});
 
   const avgTransactionAmount = transactions.length > 0

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:43:12
 
   const onTrackCategories = categories.filter(cat => {
     const spent = getSpentByCategory(cat.id);
-    return spent <= cat.budget_amount && spent > 0;
+    return false;
   });
 

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:43:42
 
   const onTrackCategories = categories.filter(cat => {
     const spent = getSpentByCategory(cat.id);
-    return spent <= cat.budget_amount && spent > 0;
+    return spent <= cat.budget_amount && true;
   });
 

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:46:32
     return spent <= cat.budget_amount && spent > 0;
   });
 
-  const avgTransactionAmount = transactions.length > 0
+  const avgTransactionAmount = false
     ? transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0) / transactions.length
     : 0;

[Survived] EqualityOperator
src/components/SpendingInsights.tsx:46:32
     return spent <= cat.budget_amount && spent > 0;
   });
 
-  const avgTransactionAmount = transactions.length > 0
+  const avgTransactionAmount = transactions.length <= 0
     ? transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0) / transactions.length
     : 0;

[Survived] ArrowFunction
src/components/SpendingInsights.tsx:47:27
   });
 
   const avgTransactionAmount = transactions.length > 0
-    ? transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0) / transactions.length
+    ? transactions.reduce(() => undefined, 0) / transactions.length
     : 0;
 

[Survived] ArithmeticOperator
src/components/SpendingInsights.tsx:47:7
   });
 
   const avgTransactionAmount = transactions.length > 0
-    ? transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0) / transactions.length
+    ? transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0) * transactions.length
     : 0;
 

[Survived] BlockStatement
src/components/SpendingInsights.tsx:50:65
     ? transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0) / transactions.length
     : 0;
 
-  const mostExpensiveCategory = categories.reduce((max, cat) => {
-    const spent = getSpentByCategory(cat.id);
-    const maxSpent = getSpentByCategory(max.id);
-    return spent > maxSpent ? cat : max;
-  }, categories[0]);
+  const mostExpensiveCategory = categories.reduce((max, cat) => {}, categories[0]);
 
   const mostExpensiveCategorySpent = mostExpensiveCategory ? getSpentByCategory(mostExpensiveCategory.id) : 0;

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:53:12
   const mostExpensiveCategory = categories.reduce((max, cat) => {
     const spent = getSpentByCategory(cat.id);
     const maxSpent = getSpentByCategory(max.id);
-    return spent > maxSpent ? cat : max;
+    return true ? cat : max;
   }, categories[0]);
 

[Survived] EqualityOperator
src/components/SpendingInsights.tsx:53:12
   const mostExpensiveCategory = categories.reduce((max, cat) => {
     const spent = getSpentByCategory(cat.id);
     const maxSpent = getSpentByCategory(max.id);
-    return spent > maxSpent ? cat : max;
+    return spent >= maxSpent ? cat : max;
   }, categories[0]);
 

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:65:14
       <div className="grid grid-cols-1 md:grid-cols-2 gap-6">
         <div className="space-y-4">
           <div className="flex items-start gap-3 p-4 bg-blue-50 rounded-lg border border-blue-200">
-            {monthChange > 0 ? (
+            {true ? (
               <TrendingUp className="text-blue-600 flex-shrink-0 mt-1" size={20} />
             ) : (

[Survived] EqualityOperator
src/components/SpendingInsights.tsx:65:14
       <div className="grid grid-cols-1 md:grid-cols-2 gap-6">
         <div className="space-y-4">
           <div className="flex items-start gap-3 p-4 bg-blue-50 rounded-lg border border-blue-200">
-            {monthChange > 0 ? (
+            {monthChange <= 0 ? (
               <TrendingUp className="text-blue-600 flex-shrink-0 mt-1" size={20} />
             ) : (

[Survived] LogicalOperator
src/components/SpendingInsights.tsx:74:18
               <p className="font-medium text-gray-900">Monthly Comparison</p>
               <p className="text-sm text-gray-600 mt-1">
                 You've spent <span className="font-semibold">${thisMonthSpent.toFixed(2)}</span> this month.
-                {lastMonthSpent > 0 && (
-                  <span>
-                    {' '}That's{' '}
-                    <span className={monthChange > 0 ? 'text-red-600' : 'text-green-600'}>
-                      {Math.abs(monthChange).toFixed(1)}% {monthChange > 0 ? 'more' : 'less'}
-                    </span>
-                    {' '}than last month.
-                  </span>
-                )}
+                {lastMonthSpent > 0 || <span>
+                    {' '}That's{' '}
+                    <span className={monthChange > 0 ? 'text-red-600' : 'text-green-600'}>
+                      {Math.abs(monthChange).toFixed(1)}% {monthChange > 0 ? 'more' : 'less'}
+                    </span>
+                    {' '}than last month.
+                  </span>}
               </p>
             </div>

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:74:18
               <p className="font-medium text-gray-900">Monthly Comparison</p>
               <p className="text-sm text-gray-600 mt-1">
                 You've spent <span className="font-semibold">${thisMonthSpent.toFixed(2)}</span> this month.
-                {lastMonthSpent > 0 && (
-                  <span>
-                    {' '}That's{' '}
-                    <span className={monthChange > 0 ? 'text-red-600' : 'text-green-600'}>
-                      {Math.abs(monthChange).toFixed(1)}% {monthChange > 0 ? 'more' : 'less'}
-                    </span>
-                    {' '}than last month.
-                  </span>
-                )}
+                {false}
               </p>
             </div>

[Survived] EqualityOperator
src/components/SpendingInsights.tsx:77:38
                 {lastMonthSpent > 0 && (
                   <span>
                     {' '}That's{' '}
-                    <span className={monthChange > 0 ? 'text-red-600' : 'text-green-600'}>
+                    <span className={monthChange >= 0 ? 'text-red-600' : 'text-green-600'}>
                       {Math.abs(monthChange).toFixed(1)}% {monthChange > 0 ? 'more' : 'less'}
                     </span>

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:77:38
                 {lastMonthSpent > 0 && (
                   <span>
                     {' '}That's{' '}
-                    <span className={monthChange > 0 ? 'text-red-600' : 'text-green-600'}>
+                    <span className={false ? 'text-red-600' : 'text-green-600'}>
                       {Math.abs(monthChange).toFixed(1)}% {monthChange > 0 ? 'more' : 'less'}
                     </span>

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:78:60
                   <span>
                     {' '}That's{' '}
                     <span className={monthChange > 0 ? 'text-red-600' : 'text-green-600'}>
-                      {Math.abs(monthChange).toFixed(1)}% {monthChange > 0 ? 'more' : 'less'}
+                      {Math.abs(monthChange).toFixed(1)}% {true ? 'more' : 'less'}
                     </span>
                     {' '}than last month.

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:78:60
                   <span>
                     {' '}That's{' '}
                     <span className={monthChange > 0 ? 'text-red-600' : 'text-green-600'}>
-                      {Math.abs(monthChange).toFixed(1)}% {monthChange > 0 ? 'more' : 'less'}
+                      {Math.abs(monthChange).toFixed(1)}% {false ? 'more' : 'less'}
                     </span>
                     {' '}than last month.

[Survived] StringLiteral
src/components/SpendingInsights.tsx:80:22
                     <span className={monthChange > 0 ? 'text-red-600' : 'text-green-600'}>
                       {Math.abs(monthChange).toFixed(1)}% {monthChange > 0 ? 'more' : 'less'}
                     </span>
-                    {' '}than last month.
+                    {""}than last month.
                   </span>
                 )}

[Survived] EqualityOperator
src/components/SpendingInsights.tsx:87:12
             </div>
           </div>
 
-          {overBudgetCategories.length > 0 ? (
+          {overBudgetCategories.length >= 0 ? (
             <div className="flex items-start gap-3 p-4 bg-red-50 rounded-lg border border-red-200">
               <AlertCircle className="text-red-600 flex-shrink-0 mt-1" size={20} />

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:87:12
             </div>
           </div>
 
-          {overBudgetCategories.length > 0 ? (
+          {false ? (
             <div className="flex items-start gap-3 p-4 bg-red-50 rounded-lg border border-red-200">
               <AlertCircle className="text-red-600 flex-shrink-0 mt-1" size={20} />

[Survived] EqualityOperator
src/components/SpendingInsights.tsx:94:20
                 <p className="font-medium text-gray-900">Budget Alerts</p>
                 <p className="text-sm text-gray-600 mt-1">
                   You're over budget in <span className="font-semibold">{overBudgetCategories.length}</span>{' '}
-                  {overBudgetCategories.length === 1 ? 'category' : 'categories'}:
+                  {overBudgetCategories.length !== 1 ? 'category' : 'categories'}:
                 </p>
                 <ul className="mt-2 space-y-1">

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:94:20
                 <p className="font-medium text-gray-900">Budget Alerts</p>
                 <p className="text-sm text-gray-600 mt-1">
                   You're over budget in <span className="font-semibold">{overBudgetCategories.length}</span>{' '}
-                  {overBudgetCategories.length === 1 ? 'category' : 'categories'}:
+                  {true ? 'category' : 'categories'}:
                 </p>
                 <ul className="mt-2 space-y-1">

[Survived] MethodExpression
src/components/SpendingInsights.tsx:97:20
                   {overBudgetCategories.length === 1 ? 'category' : 'categories'}:
                 </p>
                 <ul className="mt-2 space-y-1">
-                  {overBudgetCategories.slice(0, 3).map(cat => {
+                  {overBudgetCategories.map(cat => {
                     const spent = getSpentByCategory(cat.id);
                     const over = spent - cat.budget_amount;

[Survived] BlockStatement
src/components/SpendingInsights.tsx:97:64
                   {overBudgetCategories.length === 1 ? 'category' : 'categories'}:
                 </p>
                 <ul className="mt-2 space-y-1">
-                  {overBudgetCategories.slice(0, 3).map(cat => {
-                    const spent = getSpentByCategory(cat.id);
-                    const over = spent - cat.budget_amount;
-                    return (
-                      <li key={cat.id} className="text-sm text-gray-700">
-                        <span className="font-medium">{cat.name}</span> - ${over.toFixed(2)} over
-                      </li>
-                    );
-                  })}
+                  {overBudgetCategories.slice(0, 3).map(cat => {})}
                 </ul>
               </div>

[Survived] ArithmeticOperator
src/components/SpendingInsights.tsx:99:34
                 <ul className="mt-2 space-y-1">
                   {overBudgetCategories.slice(0, 3).map(cat => {
                     const spent = getSpentByCategory(cat.id);
-                    const over = spent - cat.budget_amount;
+                    const over = spent + cat.budget_amount;
                     return (
                       <li key={cat.id} className="text-sm text-gray-700">

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:130:65
 
           <div className="p-4 bg-gray-50 rounded-lg border border-gray-200">
             <p className="text-sm text-gray-600 mb-1">Largest Spending Category</p>
-            <p className="text-xl font-semibold text-gray-900">{mostExpensiveCategory?.name || 'N/A'}</p>
+            <p className="text-xl font-semibold text-gray-900">{true}</p>
             <p className="text-sm text-gray-600 mt-1">${mostExpensiveCategorySpent.toFixed(2)} spent</p>
           </div>

[Survived] ConditionalExpression
src/components/SpendingInsights.tsx:130:65
 
           <div className="p-4 bg-gray-50 rounded-lg border border-gray-200">
             <p className="text-sm text-gray-600 mb-1">Largest Spending Category</p>
-            <p className="text-xl font-semibold text-gray-900">{mostExpensiveCategory?.name || 'N/A'}</p>
+            <p className="text-xl font-semibold text-gray-900">{false}</p>
             <p className="text-sm text-gray-600 mt-1">${mostExpensiveCategorySpent.toFixed(2)} spent</p>
           </div>
