[Survived] BlockStatement
src/components/TransactionsList.tsx:11:51
 }
 
 export function TransactionsList({ transactions, categories, onDelete }: TransactionsListProps) {
-  const getCategoryInfo = (categoryId: string) => {
-    return categories.find(c => c.id === categoryId);
-  };
+  const getCategoryInfo = (categoryId: string) => {};
 
   const sortedTransactions = [...transactions].sort(

[Survived] ConditionalExpression
src/components/TransactionsList.tsx:12:33
 
 export function TransactionsList({ transactions, categories, onDelete }: TransactionsListProps) {
   const getCategoryInfo = (categoryId: string) => {
-    return categories.find(c => c.id === categoryId);
+    return categories.find(c => true);
   };
 

[Survived] MethodExpression
src/components/TransactionsList.tsx:15:30
     return categories.find(c => c.id === categoryId);
   };
 
-  const sortedTransactions = [...transactions].sort(
-    (a, b) => new Date(b.transaction_date).getTime() - new Date(a.transaction_date).getTime()
-  );
+  const sortedTransactions = [...transactions];
 
   if (transactions.length === 0) {

[Survived] ArrowFunction
src/components/TransactionsList.tsx:16:5
   };
 
   const sortedTransactions = [...transactions].sort(
-    (a, b) => new Date(b.transaction_date).getTime() - new Date(a.transaction_date).getTime()
+    () => undefined
   );
 

[Survived] ArithmeticOperator
src/components/TransactionsList.tsx:16:15
   };
 
   const sortedTransactions = [...transactions].sort(
-    (a, b) => new Date(b.transaction_date).getTime() - new Date(a.transaction_date).getTime()
+    (a, b) => new Date(b.transaction_date).getTime() + new Date(a.transaction_date).getTime()
   );
 

[Survived] ConditionalExpression
src/components/TransactionsList.tsx:19:7
     (a, b) => new Date(b.transaction_date).getTime() - new Date(a.transaction_date).getTime()
   );
 
-  if (transactions.length === 0) {
+  if (false) {
     return (
       <div className="bg-white rounded-xl shadow-sm border border-gray-200 p-12 text-center">

[Survived] ConditionalExpression
src/components/TransactionsList.tsx:19:7
     (a, b) => new Date(b.transaction_date).getTime() - new Date(a.transaction_date).getTime()
   );
 
-  if (transactions.length === 0) {
+  if (true) {
     return (
       <div className="bg-white rounded-xl shadow-sm border border-gray-200 p-12 text-center">

[Survived] LogicalOperator
src/components/TransactionsList.tsx:36:35
       <div className="divide-y divide-gray-100">
         {sortedTransactions.map((transaction) => {
           const category = getCategoryInfo(transaction.category_id);
-          const Icon = category ? (Icons as any)[category.icon] || Icons.DollarSign : Icons.DollarSign;
+          const Icon = category ? (Icons as any)[category.icon] && Icons.DollarSign : Icons.DollarSign;
 
           return (

[Survived] ConditionalExpression
src/components/TransactionsList.tsx:36:35
       <div className="divide-y divide-gray-100">
         {sortedTransactions.map((transaction) => {
           const category = getCategoryInfo(transaction.category_id);
-          const Icon = category ? (Icons as any)[category.icon] || Icons.DollarSign : Icons.DollarSign;
+          const Icon = category ? true : Icons.DollarSign;
 
           return (

[Survived] LogicalOperator
src/components/TransactionsList.tsx:42:20
             <div key={transaction.id} className="px-6 py-4 hover:bg-gray-50 transition-colors">
               <div className="flex items-center justify-between">
                 <div className="flex items-center gap-4 flex-1">
-                  {category && (
-                    <div
-                      className="p-2 rounded-lg"
-                      style={{ backgroundColor: `${category.color}20` }}
-                    >
-                      <Icon size={20} style={{ color: category.color }} />
-                    </div>
-                  )}
+                  {category || <div className="p-2 rounded-lg" style={{
+  backgroundColor: `${category.color}20`
+}}>
+                      <Icon size={20} style={{
+    color: category.color
+  }} />
+                    </div>}
                   <div className="flex-1">
                     <p className="font-medium text-gray-900">{transaction.description}</p>

[Survived] ConditionalExpression
src/components/TransactionsList.tsx:42:20
             <div key={transaction.id} className="px-6 py-4 hover:bg-gray-50 transition-colors">
               <div className="flex items-center justify-between">
                 <div className="flex items-center gap-4 flex-1">
-                  {category && (
-                    <div
-                      className="p-2 rounded-lg"
-                      style={{ backgroundColor: `${category.color}20` }}
-                    >
-                      <Icon size={20} style={{ color: category.color }} />
-                    </div>
-                  )}
+                  {false}
                   <div className="flex-1">
                     <p className="font-medium text-gray-900">{transaction.description}</p>

[Survived] ObjectLiteral
src/components/TransactionsList.tsx:45:30
                   {category && (
                     <div
                       className="p-2 rounded-lg"
-                      style={{ backgroundColor: `${category.color}20` }}
+                      style={{}}
                     >
                       <Icon size={20} style={{ color: category.color }} />

[Survived] ObjectLiteral
src/components/TransactionsList.tsx:47:46
                       className="p-2 rounded-lg"
                       style={{ backgroundColor: `${category.color}20` }}
                     >
-                      <Icon size={20} style={{ color: category.color }} />
+                      <Icon size={20} style={{}} />
                     </div>
                   )}

[Survived] OptionalChaining
src/components/TransactionsList.tsx:53:61
                   <div className="flex-1">
                     <p className="font-medium text-gray-900">{transaction.description}</p>
                     <div className="flex items-center gap-2 mt-1">
-                      <p className="text-sm text-gray-500">{category?.name}</p>
+                      <p className="text-sm text-gray-500">{category.name}</p>
                       <span className="text-gray-300">•</span>
                       <p className="text-sm text-gray-500">

[Survived] StringLiteral
src/components/TransactionsList.tsx:57:34
                       <span className="text-gray-300">•</span>
                       <p className="text-sm text-gray-500">
                         {new Date(transaction.transaction_date).toLocaleDateString('en-US', {
-                          month: 'short',
+                          month: "",
                           day: 'numeric',
                           year: 'numeric'

[Survived] StringLiteral
src/components/TransactionsList.tsx:58:32
                       <p className="text-sm text-gray-500">
                         {new Date(transaction.transaction_date).toLocaleDateString('en-US', {
                           month: 'short',
-                          day: 'numeric',
+                          day: "",
                           year: 'numeric'
                         })}

[Survived] ArrowFunction
src/components/TransactionsList.tsx:70:30
                     ${transaction.amount.toFixed(2)}
                   </span>
                   <button
-                    onClick={() => onDelete(transaction.id)}
+                    onClick={() => undefined}
                     className="text-gray-400 hover:text-red-500 transition-colors"
                   >
