[Survived] ArrayDeclaration
src/pages/AnalysisPage.tsx:17:66
 
 export function AnalysisPage({ onNavigateBack }: AnalysisPageProps) {
   const { user } = useAuth();
-  const [categories, setCategories] = useState<BudgetCategory[]>([]);
+  const [categories, setCategories] = useState<BudgetCategory[]>(["Stryker was here"]);
   const [transactions, setTransactions] = useState<Transaction[]>([]);
   const [filteredTransactions, setFilteredTransactions] = useState<Transaction[]>([]);

[Survived] ArrayDeclaration
src/pages/AnalysisPage.tsx:19:83
   const { user } = useAuth();
   const [categories, setCategories] = useState<BudgetCategory[]>([]);
   const [transactions, setTransactions] = useState<Transaction[]>([]);
-  const [filteredTransactions, setFilteredTransactions] = useState<Transaction[]>([]);
+  const [filteredTransactions, setFilteredTransactions] = useState<Transaction[]>(["Stryker was here"]);
   const [loading, setLoading] = useState(true);
 

[Survived] BooleanLiteral
src/pages/AnalysisPage.tsx:20:42
   const [categories, setCategories] = useState<BudgetCategory[]>([]);
   const [transactions, setTransactions] = useState<Transaction[]>([]);
   const [filteredTransactions, setFilteredTransactions] = useState<Transaction[]>([]);
-  const [loading, setLoading] = useState(true);
+  const [loading, setLoading] = useState(false);
 
   const [selectedCategory, setSelectedCategory] = useState<string>('all');

[Survived] StringLiteral
src/pages/AnalysisPage.tsx:22:68
   const [filteredTransactions, setFilteredTransactions] = useState<Transaction[]>([]);
   const [loading, setLoading] = useState(true);
 
-  const [selectedCategory, setSelectedCategory] = useState<string>('all');
+  const [selectedCategory, setSelectedCategory] = useState<string>("");
   const [dateRange, setDateRange] = useState<string>('30');
   const [startDate, setStartDate] = useState('');

[Survived] StringLiteral
src/pages/AnalysisPage.tsx:24:46
 
   const [selectedCategory, setSelectedCategory] = useState<string>('all');
   const [dateRange, setDateRange] = useState<string>('30');
-  const [startDate, setStartDate] = useState('');
+  const [startDate, setStartDate] = useState("Stryker was here!");
   const [endDate, setEndDate] = useState('');
 

[Survived] BlockStatement
src/pages/AnalysisPage.tsx:27:19
   const [startDate, setStartDate] = useState('');
   const [endDate, setEndDate] = useState('');
 
-  useEffect(() => {
-    if (user) {
-      loadData();
-    }
-  }, [user]);
+  useEffect(() => {}, [user]);
 
   useEffect(() => {

[Survived] BlockStatement
src/pages/AnalysisPage.tsx:28:15
   const [endDate, setEndDate] = useState('');
 
   useEffect(() => {
-    if (user) {
-      loadData();
-    }
+    if (user) {}
   }, [user]);
 

[Survived] BlockStatement
src/pages/AnalysisPage.tsx:33:19
     }
   }, [user]);
 
-  useEffect(() => {
-    applyFilters();
-  }, [transactions, selectedCategory, dateRange, startDate, endDate]);
+  useEffect(() => {}, [transactions, selectedCategory, dateRange, startDate, endDate]);
 
   async function loadData() {

[Survived] BlockStatement
src/pages/AnalysisPage.tsx:37:29
     applyFilters();
   }, [transactions, selectedCategory, dateRange, startDate, endDate]);
 
-  async function loadData() {
-    try {
-      const [categoriesRes, transactionsRes] = await Promise.all([
-        supabase.from('budget_categories').select('*').order('created_at', { ascending: true }),
-        supabase.from('transactions').select('*').order('created_at', { ascending: false })
-      ]);
-
-      if (categoriesRes.data) setCategories(categoriesRes.data);
-      if (transactionsRes.data) setTransactions(transactionsRes.data);
-    } catch (error) {
-      console.error('Error loading data:', error);
-    } finally {
-      setLoading(false);
-    }
-  }
+  async function loadData() {}
 
   function applyFilters() {

[Survived] BlockStatement
src/pages/AnalysisPage.tsx:38:9
   }, [transactions, selectedCategory, dateRange, startDate, endDate]);
 
   async function loadData() {
-    try {
-      const [categoriesRes, transactionsRes] = await Promise.all([
-        supabase.from('budget_categories').select('*').order('created_at', { ascending: true }),
-        supabase.from('transactions').select('*').order('created_at', { ascending: false })
-      ]);
-
-      if (categoriesRes.data) setCategories(categoriesRes.data);
-      if (transactionsRes.data) setTransactions(transactionsRes.data);
-    } catch (error) {
+    try {} catch (error) {
       console.error('Error loading data:', error);
     } finally {

[Survived] ArrayDeclaration
src/pages/AnalysisPage.tsx:39:66
 
   async function loadData() {
     try {
-      const [categoriesRes, transactionsRes] = await Promise.all([
-        supabase.from('budget_categories').select('*').order('created_at', { ascending: true }),
-        supabase.from('transactions').select('*').order('created_at', { ascending: false })
-      ]);
+      const [categoriesRes, transactionsRes] = await Promise.all([]);
 
       if (categoriesRes.data) setCategories(categoriesRes.data);

[Survived] BooleanLiteral
src/pages/AnalysisPage.tsx:40:89
   async function loadData() {
     try {
       const [categoriesRes, transactionsRes] = await Promise.all([
-        supabase.from('budget_categories').select('*').order('created_at', { ascending: true }),
+        supabase.from('budget_categories').select('*').order('created_at', { ascending: false }),
         supabase.from('transactions').select('*').order('created_at', { ascending: false })
       ]);

[Survived] ObjectLiteral
src/pages/AnalysisPage.tsx:40:76
   async function loadData() {
     try {
       const [categoriesRes, transactionsRes] = await Promise.all([
-        supabase.from('budget_categories').select('*').order('created_at', { ascending: true }),
+        supabase.from('budget_categories').select('*').order('created_at', {}),
         supabase.from('transactions').select('*').order('created_at', { ascending: false })
       ]);

[Survived] BooleanLiteral
src/pages/AnalysisPage.tsx:41:84
     try {
       const [categoriesRes, transactionsRes] = await Promise.all([
         supabase.from('budget_categories').select('*').order('created_at', { ascending: true }),
-        supabase.from('transactions').select('*').order('created_at', { ascending: false })
+        supabase.from('transactions').select('*').order('created_at', { ascending: true })
       ]);
 

[Survived] StringLiteral
src/pages/AnalysisPage.tsx:41:46
     try {
       const [categoriesRes, transactionsRes] = await Promise.all([
         supabase.from('budget_categories').select('*').order('created_at', { ascending: true }),
-        supabase.from('transactions').select('*').order('created_at', { ascending: false })
+        supabase.from('transactions').select("").order('created_at', { ascending: false })
       ]);
 

[Survived] ConditionalExpression
src/pages/AnalysisPage.tsx:44:11
         supabase.from('transactions').select('*').order('created_at', { ascending: false })
       ]);
 
-      if (categoriesRes.data) setCategories(categoriesRes.data);
+      if (true) setCategories(categoriesRes.data);
       if (transactionsRes.data) setTransactions(transactionsRes.data);
     } catch (error) {

[Survived] ConditionalExpression
src/pages/AnalysisPage.tsx:44:11
         supabase.from('transactions').select('*').order('created_at', { ascending: false })
       ]);
 
-      if (categoriesRes.data) setCategories(categoriesRes.data);
+      if (false) setCategories(categoriesRes.data);
       if (transactionsRes.data) setTransactions(transactionsRes.data);
     } catch (error) {

[Survived] ConditionalExpression
src/pages/AnalysisPage.tsx:45:11
       ]);
 
       if (categoriesRes.data) setCategories(categoriesRes.data);
-      if (transactionsRes.data) setTransactions(transactionsRes.data);
+      if (false) setTransactions(transactionsRes.data);
     } catch (error) {
       console.error('Error loading data:', error);

[Survived] ConditionalExpression
src/pages/AnalysisPage.tsx:45:11
       ]);
 
       if (categoriesRes.data) setCategories(categoriesRes.data);
-      if (transactionsRes.data) setTransactions(transactionsRes.data);
+      if (true) setTransactions(transactionsRes.data);
     } catch (error) {
       console.error('Error loading data:', error);

[Survived] BlockStatement
src/pages/AnalysisPage.tsx:46:21
 
       if (categoriesRes.data) setCategories(categoriesRes.data);
       if (transactionsRes.data) setTransactions(transactionsRes.data);
-    } catch (error) {
-      console.error('Error loading data:', error);
-    } finally {
+    } catch (error) {} finally {
       setLoading(false);
     }

[Survived] BlockStatement
src/pages/AnalysisPage.tsx:48:15
       if (transactionsRes.data) setTransactions(transactionsRes.data);
     } catch (error) {
       console.error('Error loading data:', error);
-    } finally {
-      setLoading(false);
-    }
+    } finally {}
   }
 

[Survived] BlockStatement
src/pages/AnalysisPage.tsx:53:27
     }
   }
 
-  function applyFilters() {
-    let filtered = [...transactions];
-
-    if (selectedCategory !== 'all') {
-      filtered = filtered.filter(t => t.category_id === selectedCategory);
-    }
-
-    if (dateRange === 'custom' && startDate && endDate) {
-      filtered = filtered.filter(t => {
-        const transDate = new Date(t.transaction_date);
-        return transDate >= new Date(startDate) && transDate <= new Date(endDate);
-      });
-    } else if (dateRange !== 'all') {
-      const days = parseInt(dateRange);
-      const cutoffDate = new Date();
-      cutoffDate.setDate(cutoffDate.getDate() - days);
-      filtered = filtered.filter(t => new Date(t.transaction_date) >= cutoffDate);
-    }
-
-    setFilteredTransactions(filtered);
-  }
+  function applyFilters() {}
 
   const totalSpent = filteredTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);

[Survived] ArrayDeclaration
src/pages/AnalysisPage.tsx:54:20
   }
 
   function applyFilters() {
-    let filtered = [...transactions];
+    let filtered = [];
 
     if (selectedCategory !== 'all') {

[Survived] BlockStatement
src/pages/AnalysisPage.tsx:56:37
   function applyFilters() {
     let filtered = [...transactions];
 
-    if (selectedCategory !== 'all') {
-      filtered = filtered.filter(t => t.category_id === selectedCategory);
-    }
+    if (selectedCategory !== 'all') {}
 
     if (dateRange === 'custom' && startDate && endDate) {

[Survived] EqualityOperator
src/pages/AnalysisPage.tsx:56:9
   function applyFilters() {
     let filtered = [...transactions];
 
-    if (selectedCategory !== 'all') {
+    if (selectedCategory === 'all') {
       filtered = filtered.filter(t => t.category_id === selectedCategory);
     }

[Survived] ConditionalExpression
src/pages/AnalysisPage.tsx:57:39
     let filtered = [...transactions];
 
     if (selectedCategory !== 'all') {
-      filtered = filtered.filter(t => t.category_id === selectedCategory);
+      filtered = filtered.filter(t => false);
     }
 

[Survived] ConditionalExpression
src/pages/AnalysisPage.tsx:57:39
     let filtered = [...transactions];
 
     if (selectedCategory !== 'all') {
-      filtered = filtered.filter(t => t.category_id === selectedCategory);
+      filtered = filtered.filter(t => true);
     }
 

[Survived] LogicalOperator
src/pages/AnalysisPage.tsx:60:9
       filtered = filtered.filter(t => t.category_id === selectedCategory);
     }
 
-    if (dateRange === 'custom' && startDate && endDate) {
+    if (dateRange === 'custom' || startDate && endDate) {
       filtered = filtered.filter(t => {
         const transDate = new Date(t.transaction_date);

[Survived] ConditionalExpression
src/pages/AnalysisPage.tsx:60:9
       filtered = filtered.filter(t => t.category_id === selectedCategory);
     }
 
-    if (dateRange === 'custom' && startDate && endDate) {
+    if (true) {
       filtered = filtered.filter(t => {
         const transDate = new Date(t.transaction_date);

[Survived] MethodExpression
src/pages/AnalysisPage.tsx:61:18
     }
 
     if (dateRange === 'custom' && startDate && endDate) {
-      filtered = filtered.filter(t => {
-        const transDate = new Date(t.transaction_date);
-        return transDate >= new Date(startDate) && transDate <= new Date(endDate);
-      });
+      filtered = filtered;
     } else if (dateRange !== 'all') {
       const days = parseInt(dateRange);

[Survived] BlockStatement
src/pages/AnalysisPage.tsx:61:39
     }
 
     if (dateRange === 'custom' && startDate && endDate) {
-      filtered = filtered.filter(t => {
-        const transDate = new Date(t.transaction_date);
-        return transDate >= new Date(startDate) && transDate <= new Date(endDate);
-      });
+      filtered = filtered.filter(t => {});
     } else if (dateRange !== 'all') {
       const days = parseInt(dateRange);

[Survived] ConditionalExpression
src/pages/AnalysisPage.tsx:63:16
     if (dateRange === 'custom' && startDate && endDate) {
       filtered = filtered.filter(t => {
         const transDate = new Date(t.transaction_date);
-        return transDate >= new Date(startDate) && transDate <= new Date(endDate);
+        return true;
       });
     } else if (dateRange !== 'all') {

[Survived] ConditionalExpression
src/pages/AnalysisPage.tsx:63:16
     if (dateRange === 'custom' && startDate && endDate) {
       filtered = filtered.filter(t => {
         const transDate = new Date(t.transaction_date);
-        return transDate >= new Date(startDate) && transDate <= new Date(endDate);
+        return true && transDate <= new Date(endDate);
       });
     } else if (dateRange !== 'all') {

[Survived] ConditionalExpression
src/pages/AnalysisPage.tsx:65:16
         const transDate = new Date(t.transaction_date);
         return transDate >= new Date(startDate) && transDate <= new Date(endDate);
       });
-    } else if (dateRange !== 'all') {
+    } else if (true) {
       const days = parseInt(dateRange);
       const cutoffDate = new Date();

[Survived] EqualityOperator
src/pages/AnalysisPage.tsx:65:16
         const transDate = new Date(t.transaction_date);
         return transDate >= new Date(startDate) && transDate <= new Date(endDate);
       });
-    } else if (dateRange !== 'all') {
+    } else if (dateRange === 'all') {
       const days = parseInt(dateRange);
       const cutoffDate = new Date();

[Survived] MethodExpression
src/pages/AnalysisPage.tsx:68:7
     } else if (dateRange !== 'all') {
       const days = parseInt(dateRange);
       const cutoffDate = new Date();
-      cutoffDate.setDate(cutoffDate.getDate() - days);
+      cutoffDate.setTime(cutoffDate.getDate() - days);
       filtered = filtered.filter(t => new Date(t.transaction_date) >= cutoffDate);
     }

[Survived] ArithmeticOperator
src/pages/AnalysisPage.tsx:68:26
     } else if (dateRange !== 'all') {
       const days = parseInt(dateRange);
       const cutoffDate = new Date();
-      cutoffDate.setDate(cutoffDate.getDate() - days);
+      cutoffDate.setDate(cutoffDate.getDate() + days);
       filtered = filtered.filter(t => new Date(t.transaction_date) >= cutoffDate);
     }

[Survived] ConditionalExpression
src/pages/AnalysisPage.tsx:69:39
       const days = parseInt(dateRange);
       const cutoffDate = new Date();
       cutoffDate.setDate(cutoffDate.getDate() - days);
-      filtered = filtered.filter(t => new Date(t.transaction_date) >= cutoffDate);
+      filtered = filtered.filter(t => true);
     }
 

[Survived] EqualityOperator
src/pages/AnalysisPage.tsx:69:39
       const days = parseInt(dateRange);
       const cutoffDate = new Date();
       cutoffDate.setDate(cutoffDate.getDate() - days);
-      filtered = filtered.filter(t => new Date(t.transaction_date) >= cutoffDate);
+      filtered = filtered.filter(t => new Date(t.transaction_date) > cutoffDate);
     }
 

[Survived] EqualityOperator
src/pages/AnalysisPage.tsx:78:26
   const totalSpent = filteredTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   const totalBudget = categories.reduce((sum, c) => sum + parseFloat(c.budget_amount.toString()), 0);
   const transactionCount = filteredTransactions.length;
-  const avgTransaction = transactionCount > 0 ? totalSpent / transactionCount : 0;
+  const avgTransaction = transactionCount >= 0 ? totalSpent / transactionCount : 0;
 
   if (loading) {

[Survived] ConditionalExpression
src/pages/AnalysisPage.tsx:78:26
   const totalSpent = filteredTransactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   const totalBudget = categories.reduce((sum, c) => sum + parseFloat(c.budget_amount.toString()), 0);
   const transactionCount = filteredTransactions.length;
-  const avgTransaction = transactionCount > 0 ? totalSpent / transactionCount : 0;
+  const avgTransaction = false ? totalSpent / transactionCount : 0;
 
   if (loading) {

[Survived] BlockStatement
src/pages/AnalysisPage.tsx:80:16
   const transactionCount = filteredTransactions.length;
   const avgTransaction = transactionCount > 0 ? totalSpent / transactionCount : 0;
 
-  if (loading) {
-    return (
-      <div className="min-h-screen bg-gradient-to-br from-gray-50 to-gray-100 flex items-center justify-center">
-        <div className="text-gray-500">Loading analytics...</div>
-      </div>
-    );
-  }
+  if (loading) {}
 
   return (

[Survived] ArrowFunction
src/pages/AnalysisPage.tsx:122:27
               </label>
               <select
                 value={selectedCategory}
-                onChange={(e) => setSelectedCategory(e.target.value)}
+                onChange={() => undefined}
                 className="w-full px-4 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-blue-500 focus:border-transparent"
               >

[Survived] ArrowFunction
src/pages/AnalysisPage.tsx:126:33
                 className="w-full px-4 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-blue-500 focus:border-transparent"
               >
                 <option value="all">All Categories</option>
-                {categories.map(cat => (
-                  <option key={cat.id} value={cat.id}>{cat.name}</option>
-                ))}
+                {categories.map(() => undefined)}
               </select>
             </div>

[Survived] ArrowFunction
src/pages/AnalysisPage.tsx:138:27
               </label>
               <select
                 value={dateRange}
-                onChange={(e) => setDateRange(e.target.value)}
+                onChange={() => undefined}
                 className="w-full px-4 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-blue-500 focus:border-transparent"
               >

[Survived] ConditionalExpression
src/pages/AnalysisPage.tsx:150:14
               </select>
             </div>
 
-            {dateRange === 'custom' && (
+            {true && (
               <>
                 <div>

[Survived] EqualityOperator
src/pages/AnalysisPage.tsx:150:14
               </select>
             </div>
 
-            {dateRange === 'custom' && (
+            {dateRange !== 'custom' && (
               <>
                 <div>

[Survived] ConditionalExpression
src/pages/AnalysisPage.tsx:196:16
             </div>
             <p className="text-3xl font-bold">${totalBudget.toFixed(2)}</p>
             <p className="text-sm opacity-80 mt-1">
-              {totalSpent > totalBudget ? 'Over budget' : 'On track'}
+              {false ? 'Over budget' : 'On track'}
             </p>
           </div>

[Survived] EqualityOperator
src/pages/AnalysisPage.tsx:196:16
             </div>
             <p className="text-3xl font-bold">${totalBudget.toFixed(2)}</p>
             <p className="text-sm opacity-80 mt-1">
-              {totalSpent > totalBudget ? 'Over budget' : 'On track'}
+              {totalSpent >= totalBudget ? 'Over budget' : 'On track'}
             </p>
           </div>

[Survived] ArithmeticOperator
src/pages/AnalysisPage.tsx:214:61
               <Calendar size={24} />
               <span className="text-sm opacity-80">Remaining</span>
             </div>
-            <p className="text-3xl font-bold">${Math.max(0, totalBudget - totalSpent).toFixed(2)}</p>
+            <p className="text-3xl font-bold">${Math.max(0, totalBudget + totalSpent).toFixed(2)}</p>
             <p className="text-sm opacity-80 mt-1">
               {((Math.max(0, totalBudget - totalSpent) / totalBudget) * 100).toFixed(0)}% of budget

[Survived] MethodExpression
src/pages/AnalysisPage.tsx:214:49
               <Calendar size={24} />
               <span className="text-sm opacity-80">Remaining</span>
             </div>
-            <p className="text-3xl font-bold">${Math.max(0, totalBudget - totalSpent).toFixed(2)}</p>
+            <p className="text-3xl font-bold">${Math.min(0, totalBudget - totalSpent).toFixed(2)}</p>
             <p className="text-sm opacity-80 mt-1">
               {((Math.max(0, totalBudget - totalSpent) / totalBudget) * 100).toFixed(0)}% of budget

[Survived] MethodExpression
src/pages/AnalysisPage.tsx:216:18
             </div>
             <p className="text-3xl font-bold">${Math.max(0, totalBudget - totalSpent).toFixed(2)}</p>
             <p className="text-sm opacity-80 mt-1">
-              {((Math.max(0, totalBudget - totalSpent) / totalBudget) * 100).toFixed(0)}% of budget
+              {((Math.min(0, totalBudget - totalSpent) / totalBudget) * 100).toFixed(0)}% of budget
             </p>
           </div>

[Survived] ArithmeticOperator
src/pages/AnalysisPage.tsx:216:30
             </div>
             <p className="text-3xl font-bold">${Math.max(0, totalBudget - totalSpent).toFixed(2)}</p>
             <p className="text-sm opacity-80 mt-1">
-              {((Math.max(0, totalBudget - totalSpent) / totalBudget) * 100).toFixed(0)}% of budget
+              {((Math.max(0, totalBudget + totalSpent) / totalBudget) * 100).toFixed(0)}% of budget
             </p>
           </div>

[Survived] LogicalOperator
src/pages/AnalysisPage.tsx:222:64
         </div>
 
         <div className="space-y-6">
-          <LineChart transactions={filteredTransactions} days={parseInt(dateRange) || 30} />
+          <LineChart transactions={filteredTransactions} days={parseInt(dateRange) && 30} />
 
           <div className="grid grid-cols-1 lg:grid-cols-2 gap-6">

[Survived] ConditionalExpression
src/pages/AnalysisPage.tsx:222:64
         </div>
 
         <div className="space-y-6">
-          <LineChart transactions={filteredTransactions} days={parseInt(dateRange) || 30} />
+          <LineChart transactions={filteredTransactions} days={true} />
 
           <div className="grid grid-cols-1 lg:grid-cols-2 gap-6">
