[Timeout] ArrayDeclaration
src/pages/DashboardPage.tsx:18:66
 
 export function DashboardPage({ onNavigateToAnalysis }: DashboardPageProps) {
   const { user, signOut } = useAuth();
-  const [categories, setCategories] = useState<BudgetCategory[]>([]);
+  const [categories, setCategories] = useState<BudgetCategory[]>(["Stryker was here"]);
   const [transactions, setTransactions] = useState<Transaction[]>([]);
   const [showCategoryModal, setShowCategoryModal] = useState(false);

[Timeout] BooleanLiteral
src/pages/DashboardPage.tsx:20:62
   const { user, signOut } = useAuth();
   const [categories, setCategories] = useState<BudgetCategory[]>([]);
   const [transactions, setTransactions] = useState<Transaction[]>([]);
-  const [showCategoryModal, setShowCategoryModal] = useState(false);
+  const [showCategoryModal, setShowCategoryModal] = useState(true);
   const [showTransactionModal, setShowTransactionModal] = useState(false);
   const [loading, setLoading] = useState(true);

[Timeout] BooleanLiteral
src/pages/DashboardPage.tsx:21:68
   const [categories, setCategories] = useState<BudgetCategory[]>([]);
   const [transactions, setTransactions] = useState<Transaction[]>([]);
   const [showCategoryModal, setShowCategoryModal] = useState(false);
-  const [showTransactionModal, setShowTransactionModal] = useState(false);
+  const [showTransactionModal, setShowTransactionModal] = useState(true);
   const [loading, setLoading] = useState(true);
 

[Timeout] BooleanLiteral
src/pages/DashboardPage.tsx:22:42
   const [transactions, setTransactions] = useState<Transaction[]>([]);
   const [showCategoryModal, setShowCategoryModal] = useState(false);
   const [showTransactionModal, setShowTransactionModal] = useState(false);
-  const [loading, setLoading] = useState(true);
+  const [loading, setLoading] = useState(false);
 
   useEffect(() => {

[Survived] StringLiteral
src/pages/DashboardPage.tsx:33:51
   async function loadData() {
     try {
       const [categoriesRes, transactionsRes] = await Promise.all([
-        supabase.from('budget_categories').select('*').order('created_at', { ascending: true }),
+        supabase.from('budget_categories').select("").order('created_at', { ascending: true }),
         supabase.from('transactions').select('*').order('created_at', { ascending: false })
       ]);

[Survived] StringLiteral
src/pages/DashboardPage.tsx:34:23
     try {
       const [categoriesRes, transactionsRes] = await Promise.all([
         supabase.from('budget_categories').select('*').order('created_at', { ascending: true }),
-        supabase.from('transactions').select('*').order('created_at', { ascending: false })
+        supabase.from("").select('*').order('created_at', { ascending: false })
       ]);
 

[Survived] BlockStatement
src/pages/DashboardPage.tsx:46:89
     }
   }
 
-  async function addCategory(name: string, budget: number, color: string, icon: string) {
-    if (!user) return;
-
-    const { data, error } = await supabase
-      .from('budget_categories')
-      .insert([{ name, budget_amount: budget, color, icon, user_id: user.id }])
-      .select()
-      .single();
-
-    if (error) {
-      console.error('Error adding category:', error);
-      return;
-    }
-
-    if (data) {
-      setCategories([...categories, data]);
-    }
-  }
+  async function addCategory(name: string, budget: number, color: string, icon: string) {}
 
   async function updateCategoryBudget(id: string, amount: number) {

[Survived] BooleanLiteral
src/pages/DashboardPage.tsx:47:9
   }
 
   async function addCategory(name: string, budget: number, color: string, icon: string) {
-    if (!user) return;
+    if (user) return;
 
     const { data, error } = await supabase

[Survived] ConditionalExpression
src/pages/DashboardPage.tsx:47:9
   }
 
   async function addCategory(name: string, budget: number, color: string, icon: string) {
-    if (!user) return;
+    if (true) return;
 
     const { data, error } = await supabase

[Survived] StringLiteral
src/pages/DashboardPage.tsx:50:13
     if (!user) return;
 
     const { data, error } = await supabase
-      .from('budget_categories')
+      .from("")
       .insert([{ name, budget_amount: budget, color, icon, user_id: user.id }])
       .select()

[Timeout] ObjectLiteral
src/pages/DashboardPage.tsx:51:16
 
     const { data, error } = await supabase
       .from('budget_categories')
-      .insert([{ name, budget_amount: budget, color, icon, user_id: user.id }])
+      .insert([{}])
       .select()
       .single();

[Timeout] BlockStatement
src/pages/DashboardPage.tsx:55:16
       .select()
       .single();
 
-    if (error) {
-      console.error('Error adding category:', error);
-      return;
-    }
+    if (error) {}
 
     if (data) {

[Timeout] BlockStatement
src/pages/DashboardPage.tsx:60:15
       return;
     }
 
-    if (data) {
-      setCategories([...categories, data]);
-    }
+    if (data) {}
   }
 

[Timeout] BlockStatement
src/pages/DashboardPage.tsx:65:67
     }
   }
 
-  async function updateCategoryBudget(id: string, amount: number) {
-    const { error } = await supabase
-      .from('budget_categories')
-      .update({ budget_amount: amount, updated_at: new Date().toISOString() })
-      .eq('id', id);
-
-    if (error) {
-      console.error('Error updating category:', error);
-      return;
-    }
-
-    setCategories(categories.map(c => c.id === id ? { ...c, budget_amount: amount } : c));
-  }
+  async function updateCategoryBudget(id: string, amount: number) {}
 
   async function deleteCategory(id: string) {

[Survived] ObjectLiteral
src/pages/DashboardPage.tsx:68:15
   async function updateCategoryBudget(id: string, amount: number) {
     const { error } = await supabase
       .from('budget_categories')
-      .update({ budget_amount: amount, updated_at: new Date().toISOString() })
+      .update({})
       .eq('id', id);
 

[Timeout] StringLiteral
src/pages/DashboardPage.tsx:69:11
     const { error } = await supabase
       .from('budget_categories')
       .update({ budget_amount: amount, updated_at: new Date().toISOString() })
-      .eq('id', id);
+      .eq("", id);
 
     if (error) {

[Survived] ConditionalExpression
src/pages/DashboardPage.tsx:76:39
       return;
     }
 
-    setCategories(categories.map(c => c.id === id ? { ...c, budget_amount: amount } : c));
+    setCategories(categories.map(c => false ? { ...c, budget_amount: amount } : c));
   }
 

[Survived] ConditionalExpression
src/pages/DashboardPage.tsx:76:39
       return;
     }
 
-    setCategories(categories.map(c => c.id === id ? { ...c, budget_amount: amount } : c));
+    setCategories(categories.map(c => true ? { ...c, budget_amount: amount } : c));
   }
 

[Survived] BlockStatement
src/pages/DashboardPage.tsx:79:45
     setCategories(categories.map(c => c.id === id ? { ...c, budget_amount: amount } : c));
   }
 
-  async function deleteCategory(id: string) {
-    const { error } = await supabase
-      .from('budget_categories')
-      .delete()
-      .eq('id', id);
-
-    if (error) {
-      console.error('Error deleting category:', error);
-      return;
-    }
-
-    setCategories(categories.filter(c => c.id !== id));
-  }
+  async function deleteCategory(id: string) {}
 
   async function addTransaction(categoryId: string, amount: number, description: string, date: string) {

[Survived] BlockStatement
src/pages/DashboardPage.tsx:85:16
       .delete()
       .eq('id', id);
 
-    if (error) {
-      console.error('Error deleting category:', error);
-      return;
-    }
+    if (error) {}
 
     setCategories(categories.filter(c => c.id !== id));

[Survived] StringLiteral
src/pages/DashboardPage.tsx:86:21
       .eq('id', id);
 
     if (error) {
-      console.error('Error deleting category:', error);
+      console.error("", error);
       return;
     }

[Survived] MethodExpression
src/pages/DashboardPage.tsx:90:19
       return;
     }
 
-    setCategories(categories.filter(c => c.id !== id));
+    setCategories(categories);
   }
 

[Survived] ConditionalExpression
src/pages/DashboardPage.tsx:90:42
       return;
     }
 
-    setCategories(categories.filter(c => c.id !== id));
+    setCategories(categories.filter(c => false));
   }
 

[Survived] BlockStatement
src/pages/DashboardPage.tsx:93:104
     setCategories(categories.filter(c => c.id !== id));
   }
 
-  async function addTransaction(categoryId: string, amount: number, description: string, date: string) {
-    if (!user) return;
-
-    const { data, error } = await supabase
-      .from('transactions')
-      .insert([{ category_id: categoryId, amount, description, transaction_date: date, user_id: user.id }])
-      .select()
-      .single();
-
-    if (error) {
-      console.error('Error adding transaction:', error);
-      return;
-    }
-
-    if (data) {
-      setTransactions([data, ...transactions]);
-    }
-  }
+  async function addTransaction(categoryId: string, amount: number, description: string, date: string) {}
 
   async function deleteTransaction(id: string) {

[Survived] ConditionalExpression
src/pages/DashboardPage.tsx:94:9
   }
 
   async function addTransaction(categoryId: string, amount: number, description: string, date: string) {
-    if (!user) return;
+    if (true) return;
 
     const { data, error } = await supabase

[Survived] ConditionalExpression
src/pages/DashboardPage.tsx:94:9
   }
 
   async function addTransaction(categoryId: string, amount: number, description: string, date: string) {
-    if (!user) return;
+    if (false) return;
 
     const { data, error } = await supabase

[Survived] StringLiteral
src/pages/DashboardPage.tsx:97:13
     if (!user) return;
 
     const { data, error } = await supabase
-      .from('transactions')
+      .from("")
       .insert([{ category_id: categoryId, amount, description, transaction_date: date, user_id: user.id }])
       .select()

[Survived] ObjectLiteral
src/pages/DashboardPage.tsx:98:16
 
     const { data, error } = await supabase
       .from('transactions')
-      .insert([{ category_id: categoryId, amount, description, transaction_date: date, user_id: user.id }])
+      .insert([{}])
       .select()
       .single();

[Survived] BlockStatement
src/pages/DashboardPage.tsx:102:16
       .select()
       .single();
 
-    if (error) {
-      console.error('Error adding transaction:', error);
-      return;
-    }
+    if (error) {}
 
     if (data) {

[Survived] BlockStatement
src/pages/DashboardPage.tsx:107:15
       return;
     }
 
-    if (data) {
-      setTransactions([data, ...transactions]);
-    }
+    if (data) {}
   }
 

[Survived] BlockStatement
src/pages/DashboardPage.tsx:112:48
     }
   }
 
-  async function deleteTransaction(id: string) {
-    const { error } = await supabase
-      .from('transactions')
-      .delete()
-      .eq('id', id);
-
-    if (error) {
-      console.error('Error deleting transaction:', error);
-      return;
-    }
-
-    setTransactions(transactions.filter(t => t.id !== id));
-  }
+  async function deleteTransaction(id: string) {}
 
   const getSpentByCategory = (categoryId: string) => {

[Survived] BlockStatement
src/pages/DashboardPage.tsx:118:16
       .delete()
       .eq('id', id);
 
-    if (error) {
-      console.error('Error deleting transaction:', error);
-      return;
-    }
+    if (error) {}
 
     setTransactions(transactions.filter(t => t.id !== id));

[Survived] MethodExpression
src/pages/DashboardPage.tsx:123:21
       return;
     }
 
-    setTransactions(transactions.filter(t => t.id !== id));
+    setTransactions(transactions);
   }
 

[Survived] EqualityOperator
src/pages/DashboardPage.tsx:123:46
       return;
     }
 
-    setTransactions(transactions.filter(t => t.id !== id));
+    setTransactions(transactions.filter(t => t.id === id));
   }
 

[Survived] ConditionalExpression
src/pages/DashboardPage.tsx:128:20
 
   const getSpentByCategory = (categoryId: string) => {
     return transactions
-      .filter(t => t.category_id === categoryId)
+      .filter(t => true)
       .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   };

[Survived] ArithmeticOperator
src/pages/DashboardPage.tsx:132:53
       .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   };
 
-  const totalBudget = categories.reduce((sum, c) => sum + parseFloat(c.budget_amount.toString()), 0);
+  const totalBudget = categories.reduce((sum, c) => sum - parseFloat(c.budget_amount.toString()), 0);
   const totalSpent = transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
 

[Survived] ArrowFunction
src/pages/DashboardPage.tsx:132:41
       .reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
   };
 
-  const totalBudget = categories.reduce((sum, c) => sum + parseFloat(c.budget_amount.toString()), 0);
+  const totalBudget = categories.reduce(() => undefined, 0);
   const totalSpent = transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
 

[Survived] ArrowFunction
src/pages/DashboardPage.tsx:133:42
   };
 
   const totalBudget = categories.reduce((sum, c) => sum + parseFloat(c.budget_amount.toString()), 0);
-  const totalSpent = transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
+  const totalSpent = transactions.reduce(() => undefined, 0);
 
   if (loading) {

[Survived] ArithmeticOperator
src/pages/DashboardPage.tsx:133:54
   };
 
   const totalBudget = categories.reduce((sum, c) => sum + parseFloat(c.budget_amount.toString()), 0);
-  const totalSpent = transactions.reduce((sum, t) => sum + parseFloat(t.amount.toString()), 0);
+  const totalSpent = transactions.reduce((sum, t) => sum - parseFloat(t.amount.toString()), 0);
 
   if (loading) {

[Survived] OptionalChaining
src/pages/DashboardPage.tsx:153:45
             </div>
             <div>
               <h1 className="text-3xl font-bold text-gray-900">Budget Tracker</h1>
-              <p className="text-gray-600">{user?.email}</p>
+              <p className="text-gray-600">{user.email}</p>
             </div>
           </div>

[Survived] LogicalOperator
src/pages/DashboardPage.tsx:167:26
             <ExportPDF
               categories={categories}
               transactions={transactions}
-              userEmail={user?.email || ''}
+              userEmail={user?.email && ''}
             />
             <button

[Survived] OptionalChaining
src/pages/DashboardPage.tsx:167:26
             <ExportPDF
               categories={categories}
               transactions={transactions}
-              userEmail={user?.email || ''}
+              userEmail={user.email || ''}
             />
             <button

[Survived] ArrowFunction
src/pages/DashboardPage.tsx:170:24
               userEmail={user?.email || ''}
             />
             <button
-              onClick={() => setShowTransactionModal(true)}
+              onClick={() => undefined}
               disabled={categories.length === 0}
               className="flex items-center gap-2 px-4 py-2 bg-blue-500 text-white rounded-lg font-medium hover:bg-blue-600 transition-colors disabled:opacity-50 disabled:cursor-not-allowed shadow-sm"

[Survived] BooleanLiteral
src/pages/DashboardPage.tsx:170:54
               userEmail={user?.email || ''}
             />
             <button
-              onClick={() => setShowTransactionModal(true)}
+              onClick={() => setShowTransactionModal(false)}
               disabled={categories.length === 0}
               className="flex items-center gap-2 px-4 py-2 bg-blue-500 text-white rounded-lg font-medium hover:bg-blue-600 transition-colors disabled:opacity-50 disabled:cursor-not-allowed shadow-sm"

[Survived] ConditionalExpression
src/pages/DashboardPage.tsx:171:25
             />
             <button
               onClick={() => setShowTransactionModal(true)}
-              disabled={categories.length === 0}
+              disabled={true}
               className="flex items-center gap-2 px-4 py-2 bg-blue-500 text-white rounded-lg font-medium hover:bg-blue-600 transition-colors disabled:opacity-50 disabled:cursor-not-allowed shadow-sm"
             >

[Survived] ConditionalExpression
src/pages/DashboardPage.tsx:171:25
             />
             <button
               onClick={() => setShowTransactionModal(true)}
-              disabled={categories.length === 0}
+              disabled={false}
               className="flex items-center gap-2 px-4 py-2 bg-blue-500 text-white rounded-lg font-medium hover:bg-blue-600 transition-colors disabled:opacity-50 disabled:cursor-not-allowed shadow-sm"
             >

[Survived] BooleanLiteral
src/pages/DashboardPage.tsx:178:51
               Add Transaction
             </button>
             <button
-              onClick={() => setShowCategoryModal(true)}
+              onClick={() => setShowCategoryModal(false)}
               className="flex items-center gap-2 px-4 py-2 bg-orange-500 text-white rounded-lg font-medium hover:bg-orange-600 transition-colors shadow-sm"
             >

[Survived] ArrowFunction
src/pages/DashboardPage.tsx:178:24
               Add Transaction
             </button>
             <button
-              onClick={() => setShowCategoryModal(true)}
+              onClick={() => undefined}
               className="flex items-center gap-2 px-4 py-2 bg-orange-500 text-white rounded-lg font-medium hover:bg-orange-600 transition-colors shadow-sm"
             >

[Survived] ConditionalExpression
src/pages/DashboardPage.tsx:196:10
 
         <BudgetSummary totalBudget={totalBudget} totalSpent={totalSpent} />
 
-        {categories.length === 0 ? (
+        {true ? (
           <div className="bg-white rounded-xl shadow-sm border border-gray-200 p-12 text-center">
             <PiggyBank size={64} className="mx-auto text-gray-300 mb-4" />

[Survived] ConditionalExpression
src/pages/DashboardPage.tsx:196:10
 
         <BudgetSummary totalBudget={totalBudget} totalSpent={totalSpent} />
 
-        {categories.length === 0 ? (
+        {false ? (
           <div className="bg-white rounded-xl shadow-sm border border-gray-200 p-12 text-center">
             <PiggyBank size={64} className="mx-auto text-gray-300 mb-4" />

[Survived] ArrowFunction
src/pages/DashboardPage.tsx:214:33
             <div className="mb-8">
               <h2 className="text-xl font-semibold text-gray-900 mb-4">Budget Categories</h2>
               <div className="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-6">
-                {categories.map(category => (
-                  <BudgetCard
-                    key={category.id}
-                    category={category}
-                    spent={getSpentByCategory(category.id)}
-                    onUpdate={updateCategoryBudget}
-                    onDelete={deleteCategory}
-                  />
-                ))}
+                {categories.map(() => undefined)}
               </div>
             </div>

[Survived] ConditionalExpression
src/pages/DashboardPage.tsx:238:8
         )}
       </div>
 
-      {showCategoryModal && (
-        <AddCategoryModal
-          onClose={() => setShowCategoryModal(false)}
-          onAdd={addCategory}
-        />
-      )}
+      {true}
 
       {showTransactionModal && (

[Survived] ConditionalExpression
src/pages/DashboardPage.tsx:238:8
         )}
       </div>
 
-      {showCategoryModal && (
-        <AddCategoryModal
-          onClose={() => setShowCategoryModal(false)}
-          onAdd={addCategory}
-        />
-      )}
+      {false}
 
       {showTransactionModal && (

[Survived] ArrowFunction
src/pages/DashboardPage.tsx:240:20
 
       {showCategoryModal && (
         <AddCategoryModal
-          onClose={() => setShowCategoryModal(false)}
+          onClose={() => undefined}
           onAdd={addCategory}
         />

[Survived] BooleanLiteral
src/pages/DashboardPage.tsx:240:47
 
       {showCategoryModal && (
         <AddCategoryModal
-          onClose={() => setShowCategoryModal(false)}
+          onClose={() => setShowCategoryModal(true)}
           onAdd={addCategory}
         />

[Survived] ConditionalExpression
src/pages/DashboardPage.tsx:245:8
         />
       )}
 
-      {showTransactionModal && (
-        <AddTransactionModal
-          categories={categories}
-          onClose={() => setShowTransactionModal(false)}
-          onAdd={addTransaction}
-        />
-      )}
+      {true}
     </div>
   );

[Survived] ConditionalExpression
src/pages/DashboardPage.tsx:245:8
         />
       )}
 
-      {showTransactionModal && (
-        <AddTransactionModal
-          categories={categories}
-          onClose={() => setShowTransactionModal(false)}
-          onAdd={addTransaction}
-        />
-      )}
+      {false}
     </div>
   );

[Survived] ArrowFunction
src/pages/DashboardPage.tsx:248:20
       {showTransactionModal && (
         <AddTransactionModal
           categories={categories}
-          onClose={() => setShowTransactionModal(false)}
+          onClose={() => undefined}
           onAdd={addTransaction}
         />

[Survived] BooleanLiteral
src/pages/DashboardPage.tsx:248:50
       {showTransactionModal && (
         <AddTransactionModal
           categories={categories}
-          onClose={() => setShowTransactionModal(false)}
+          onClose={() => setShowTransactionModal(true)}
           onAdd={addTransaction}
         />
